{
    "scrape_settings": {
        "subreddit": "cscareerquestions",
        "category": "search",
        "n_results_or_keywords": "job",
        "time_filter": "year"
    },
    "data": [
        {
            "author": "u/fermented_ass_candy",
            "created_utc": "06-02-2021 11:05:06",
            "distinguished": null,
            "edited": false,
            "id": "nqnunu",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nqnunu",
            "nsfw": false,
            "num_comments": 180,
            "permalink": "/r/cscareerquestions/comments/nqnunu/anyone_ever_take_a_job_find_out_it_was_a_shit/",
            "score": 640,
            "selftext": "I joined a company a few months ago as a remote dev. This is what has transpired since then:\n\n- No onboarding, I was working on code a few hours into my shift before even being introduced to everyone. Wasn't even signed up for health insurance but they were still like \"MUSH!\"\n- CEO is an asshole. Yells at people in meetings. Openly hated by employees.\n- No culture. People don't talk to each other at all. Everyone is cold and unfriendly.\n- Mass attrition. The engineering department has lost 1/3rd of existing employees this year. They have responded by doing mass hiring but even those new people are noping out after they found out what a nightmare this place is.\n- Bait and switch job. I am not doing what I interviewed for.... at ALL\n- I was supposed to get RSU's but mysteriously all talks of that are gone. So I'm literally missing compensation.\n- They have been throwing around the idea of moving all employees (even remote) to in office across the country next year which I won't do. So I might not even have a job come 2022.\n\nSo needless to say this place fucking sucks. But instead of stressing myself out and cranking up my anxiety, I have taken a different approach: I have not been taking this job seriously at all. \n\nI get up and sign on to Slack on my phone and not leave bed until an hour or more later. I never work past 5 despite others working long hours. I might do 2 hours of actual work a day. I'll get up in the middle of the work day and and disappear for awhile. \n\nI mean why the fuck should I care? This place has shit all over me, and I don't care if I do the same. If I get fired I'll just tell the next job I was let go because I didn't want to move across the country (which is already all over Glassdoor). If I'm not let go I plan on doing this until late this year and then I'll start leetcoding again. \n\nSo my question is, has anyone ever done this before? What was the overall impact to your career to just dick around for awhile at a place you hate before moving on somewhere else?",
            "spoiler": false,
            "stickied": false,
            "title": "Anyone ever take a job, find out it was a shit show, and then piss around for awhile before looking again?",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nqnunu/anyone_ever_take_a_job_find_out_it_was_a_shit/"
        },
        {
            "author": "u/ElectronCopy",
            "created_utc": "05-04-2021 10:43:00",
            "distinguished": null,
            "edited": false,
            "id": "n4q10h",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_n4q10h",
            "nsfw": false,
            "num_comments": 686,
            "permalink": "/r/cscareerquestions/comments/n4q10h/because_of_leetcode_my_current_programming_job/",
            "score": 1827,
            "selftext": "Does anyone feel the same way as me?  I entered the field two years ago able to do Leetcode easy questions and a handful of mediums.  This was definitely more than enough to get a job back then for me at a respected company.\n\n\n\n\n\nNow, I am failing technical interviews at unknown companies because they are consistently asking mediums and hards.  A seed funded startup asked me to do a difficult dynamic programming problem involving strings.  A non-tech company asked me a hard graph traversal question.\n\n\n\n\nSure, I will explain my thought process during the problem.  But I feel like a lot of interviewers are looking for memorized answers.",
            "spoiler": false,
            "stickied": false,
            "title": "Because of Leetcode, my current programming job might be my last programming job",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n4q10h/because_of_leetcode_my_current_programming_job/"
        },
        {
            "author": "u/trivial-color",
            "created_utc": "05-13-2021 12:21:08",
            "distinguished": null,
            "edited": false,
            "id": "nbki8u",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nbki8u",
            "nsfw": false,
            "num_comments": 385,
            "permalink": "/r/cscareerquestions/comments/nbki8u/my_job_is_too_comfy/",
            "score": 1395,
            "selftext": "I’ve been a full time dev for 3 years in a non-tech company. Being one of the few developers my life is quite easy.\n\nI probably work a total of 30ish hours a week, fully remote and can come and go as I wish. Pay is pretty good but not big n level. I could essentially dick around 70% of my time. I also get a huge amount of “research” and “self training” time. I sleep in, no hard set hours, go for walks, basically I get my small amount of work done and the rest is an open book. No one tracks me other than my end result output which is very easy to meet.\n\nOne sad thing is that I don’t really believe working hard here will help. I busted my ass when I first got here. Due to our type of work, people don’t care, it’s all about meeting the bar, exceeding doesn’t do much imo.\n\nBasically there are not many people here who can do my type of work so my productivity is relatively very high.\n\nI even received the highest performance marks and will be getting a promotion soon.\n\nProblem is I just don’t see myself getting great experience and I would like higher pay.\n\nI feel like I have gotten “soft” or something though. The idea of leaving and going back to deadlines and stress sounds... awful.\n\nBut I also don’t want to be the guy who coasts for 10 years and ends up with nothing to show for it.\n\nAny insight or motivation would be great. \n\nI also acknowledge my privileged and lucky position.",
            "spoiler": false,
            "stickied": false,
            "title": "My Job is Too Comfy",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nbki8u/my_job_is_too_comfy/"
        },
        {
            "author": "u/SimulationV2018",
            "created_utc": "05-27-2021 10:40:05",
            "distinguished": null,
            "edited": false,
            "id": "nm8xut",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nm8xut",
            "nsfw": false,
            "num_comments": 116,
            "permalink": "/r/cscareerquestions/comments/nm8xut/to_anyone_trying_to_get_a_job_have_faith/",
            "score": 749,
            "selftext": "About 2 years ago I decided to teach myself React.js and I sat down with a you tube tutorial into the syntax and how to write JS. Then once that had finished I was wondering what to do now? Like so many people who get to this stage and decide I have not really learned much and not really getting this, so I will give up. I think this is where a lot of self-taught devs drop off. You learn all the syntax and how to debug a syntax error and not really how to create something.   \n\n\nSo I decided to go to uDemy and learn how to make a [slack clone](https://slackclone-5f7d8.firebaseapp.com/).  That taught me so much about debugging, flex boxes and frustration. I built it and was proud of it. Now what next I am not job ready so let me try and build something else...   \n\n\nI decided to try my hand at React Native this was just before covid hit and I was furloughed from a job I hated. Which I was ecstatic about because it gave me time to code and cycle. I continued trying to make an app for my cricket club, which never materialised unfortunately. I continued playing around with RN and building silly apps that never got anywhere but I learned so much.   \n\n\nThen in December a recruiter had seen my Linkedin profile and decided to give me a call about a contract job, and said that they were keen to hire ASAP and I should have an interview the next day. He also told me the name of the company. He requested my CV and I sent it over with a link to various projects and my Github. Then I never heard back from him. I was ghosted by him.   \n\n\nI found the CEO on Linkedin and sent her a message with my CV and GitHub link and my story and being upfront and honest about this being my first job and I am keen to learn. I had a call with the CEO and the CTO that same day and got the job. I have been working at the company since January and I have been learning so much and improving each day. \n\n&#x200B;\n\nSo for any devs trying to get a job:   \n\\- Don't give up  \n\\- Be relentless  \n\\- Always learn   \n\\- Publish your code on social media  \n\\- Write medium about what you are building  \n\n\nGood luck you can do it.   \nPS I am 36",
            "spoiler": false,
            "stickied": false,
            "title": "To anyone trying to get a job, have faith!!",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nm8xut/to_anyone_trying_to_get_a_job_have_faith/"
        },
        {
            "author": "u/hoduappa",
            "created_utc": "05-23-2021 20:53:45",
            "distinguished": null,
            "edited": false,
            "id": "njlqsu",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_njlqsu",
            "nsfw": false,
            "num_comments": 194,
            "permalink": "/r/cscareerquestions/comments/njlqsu/how_much_harder_is_it_to_get_a_job_if_ive_already/",
            "score": 444,
            "selftext": "I’ve been working at my current company for three and a half years now and have a total of about five years of experience. I’ve become extremely stressed and unhappy at my current job and want to leave. I’m looking for a new job right now and would prefer to find a new one before I quit, but this current job is seriously messing with my mental state and I’m starting to consider just leaving immediately. I have some money saved up and a spouse who’s making enough money to support us alone in a pinch.\n\nMy question is, how much is it going to hurt my chances with prospective new employers if I don’t currently have a job? Do they strongly prefer candidates that are currently employed? How great an impact does this have on the job hunt in your experience?",
            "spoiler": false,
            "stickied": false,
            "title": "How much harder is it to get a job if I’ve already left my previous job?",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/njlqsu/how_much_harder_is_it_to_get_a_job_if_ive_already/"
        },
        {
            "author": "u/fried_katsu",
            "created_utc": "05-08-2021 17:03:51",
            "distinguished": null,
            "edited": false,
            "id": "n7ygij",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_n7ygij",
            "nsfw": false,
            "num_comments": 393,
            "permalink": "/r/cscareerquestions/comments/n7ygij/almost_a_year_with_no_job/",
            "score": 840,
            "selftext": "I graduated last June and still haven’t found a job yet. I’m afraid that once I’m no longer considered a “new grad” and still haven’t found any experience this past year, it’s only going to get tougher. I recently managed to get to the final interview for a startup, but it didn’t go my way in the end. Any words of advice or encouragement right now for new grads in my situation? Thanks ❤️",
            "spoiler": false,
            "stickied": false,
            "title": "Almost a year with no job",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n7ygij/almost_a_year_with_no_job/"
        },
        {
            "author": "u/ThoughtEnough3244",
            "created_utc": "05-29-2021 04:19:33",
            "distinguished": null,
            "edited": false,
            "id": "nnitnh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nnitnh",
            "nsfw": false,
            "num_comments": 101,
            "permalink": "/r/cscareerquestions/comments/nnitnh/got_a_job_but_turned_out_it_was_false/",
            "score": 522,
            "selftext": "I recently quit my job and got another one (pays 15k more) as an IOS dev, it's a scale-up. During the interview process they told me they care about Unit tests, clean coding, architecture, work-life balance and SE best practices (classic lies but devs sounded legit), turned out all of them are bullshit. fast forward to my 2nd month at work (never had onboarding btw cuz everybody is too busy) I have to work on shitty code with no proper architecture, it's a mess and only one of the devs knows about project, if he leaves this company they are fucked up big time. I have to work 10 hours a day because they always rush for releases, they do absolutely horrible practises like approving PR's without even checking because they have no time, and if PR passes with bugs they blame the PR creator. I'm already sick of this job, should I just chill for 5-6 more months and pretend I'm caring or start looking for a new job? Do you think it's a red flag to switch jobs after 2 months? Thanks..",
            "spoiler": false,
            "stickied": false,
            "title": "Got a job but turned out it was false advertisement",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nnitnh/got_a_job_but_turned_out_it_was_false/"
        },
        {
            "author": "u/DeepLearningGod",
            "created_utc": "04-27-2021 09:26:41",
            "distinguished": null,
            "edited": "04-27-2021 09:40:13",
            "id": "mzofdk",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mzofdk",
            "nsfw": false,
            "num_comments": 356,
            "permalink": "/r/cscareerquestions/comments/mzofdk/stop_blindly_saying_grind_leetcode_to_anyone_who/",
            "score": 2522,
            "selftext": "Not everyone needs more leetcode.  There are tons of CS students who are technically skilled but have trouble selling themselves on a re sume or in an inter view.  Instead, find what stage you're failing at and fix it.\n\nIf you can't get ANY responses at all -> build a better re sume, do more projects, reach out directly to recruiters or managers\n\nIf you are stuck on online assessments -> grind leetcode\n\nIf you fail at inter views -> inter view prep, learn how to sell yourself better, get rid of awkwardness\n\nIn my experience, there are a lot more students who fail at #1 and #3 and this sub leads them in the wrong direction",
            "spoiler": false,
            "stickied": false,
            "title": "Stop blindly saying \"grind leetcode\" to anyone who can't find a job.",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mzofdk/stop_blindly_saying_grind_leetcode_to_anyone_who/"
        },
        {
            "author": "u/wizards_tower",
            "created_utc": "05-07-2021 09:30:29",
            "distinguished": null,
            "edited": false,
            "id": "n6yjhi",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_n6yjhi",
            "nsfw": false,
            "num_comments": 315,
            "permalink": "/r/cscareerquestions/comments/n6yjhi/what_do_employers_really_want_when_they_list_cc/",
            "score": 660,
            "selftext": "Are they looking for someone who is proficient is both C and C++? \n\nOr someone who is proficient in either one and they can chose on the job which language to use?\n\nOr is this HR not understanding programming just doing what they see on every other job posting?\n\nI wish employers would list the language they use or if they use both, list it like \"C, C++, ...\"\n\nI am proficient in C but have barely used C++. Is that a dealbreaker for any of these jobs?",
            "spoiler": false,
            "stickied": false,
            "title": "What do employers really want when they list C/C++ on a job posting?",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n6yjhi/what_do_employers_really_want_when_they_list_cc/"
        },
        {
            "author": "u/DowntownTomorrow51",
            "created_utc": "05-17-2021 08:17:48",
            "distinguished": null,
            "edited": "05-17-2021 08:27:01",
            "id": "neep01",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_neep01",
            "nsfw": false,
            "num_comments": 134,
            "permalink": "/r/cscareerquestions/comments/neep01/client_causing_me_stress_because_i_found_a_better/",
            "score": 503,
            "selftext": "I've been working an hourly job part-time and (at times) full-time towards the end of my studies. It was pretty stressful because the client had dealt with poor hiring choices by my employer.\n\nThe person hired and then fired before I came along wasn't very good, and pushed some of the worst code I had ever seen. Paired with the other dev (my current colleague), they didn't use any testing or version control. App folders were everywhere, and it was just a general mess.\n\nDespite the awful practices I was getting hours to fix their codebase and contribute ideas based on my academic experience, but the client was spending money elsewhere and said he could only afford 1 programmer at a time after 10 months of me working there.\n\nSo a lot of tasks I should've done such as API and mobile app pair was split between me and another dev. The client didn't want to pay me to help the other dev design the API even though the other dev pushed a lot of buggy/badly designed code, which always stretched out the time I worked on the app, which meant I was often waiting for fixes to the API and maybe doing a few Wordpress updates in the meantime. Even recently, I called out a design flaw in the API, and the client's response now was to rewrite it as I would've done it, but have the other dev program it. So obviously going in circles.\n\nLast week, I found a job paying 2x what I was paid last year and put in 4 weeks notice (4 weeks is normal in New Zealand).\n\nMy employer let his largest client know today and in response there was just silence. I don't feel bad at all, because I've been covering rent with savings for the past few months because as an hourly dev, he's pushed my tasks later and later in the year while the other developer worked full time fixing bugs (his coding skills were improving but still green and without tests.. bugs always appeared in production because the client didn't want him to take the time to learn xdebug). My direct employer is cool, but he felt threatened that the client could yank the project at any time, killing his software house.\n\nI imagine the next weeks are going to be hell with the client because he's used to firing people, not having people leave since people often come to him desperate for work. He's abused my employer and my colleague multiple times for their religion because they take breaks to pray. I'm not religious, but I still don't think it's right to shame employees for taking a religious day off or going to prayer in the afternoon.\n\nAnd being that I was the only dev who wrote an entire mobile app and knows Java, his app will be paused until they can find another dev who's willing to work part-time. The worry is that they will get another developer like my predecessor who has no experience and is unwilling to learn. He's likely going to push me to do documentation on everything, which I would've done earlier but he didn't want to pay me to do on his tight deadline.\n\nHow should I approach this if the client gets abusive.. Just leave?",
            "spoiler": false,
            "stickied": false,
            "title": "Client causing me stress because I found a better job",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/neep01/client_causing_me_stress_because_i_found_a_better/"
        },
        {
            "author": "u/anAnonymousWolverine",
            "created_utc": "04-30-2021 15:02:39",
            "distinguished": null,
            "edited": "04-30-2021 15:07:45",
            "id": "n20w9y",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_n20w9y",
            "nsfw": false,
            "num_comments": 268,
            "permalink": "/r/cscareerquestions/comments/n20w9y/opinion_going_above_and_beyond_for_your_job_is/",
            "score": 1042,
            "selftext": "I'm actually really curious what people think so please feel free to tell me I'm wrong\n\nI feel like we're constantly encouraged to go above and beyond but it doesn't seem worth it at all. Here's why:\n\nLet's say my hourly rate is $50/hr (based on my salary working 40 hours) and going above and beyond would mean working an extra 10 hours per week on average (as an example), that's roughly an opportunity cost of $26,000 per year (give or take) that I could be spending elsewhere (in my case, studying for my part time master's degree).\n\nMeanwhile, what's my incentive for going above and beyond? 3-7K additional bonus + an extra 2-3% raise (at my company).\n\nDoesn't seem worth it to me. What do you think? Anything I'm missing? Has it ever been worth it for you?\n\nLet me know!",
            "spoiler": false,
            "stickied": false,
            "title": "OPINION: Going above and beyond for your job is not worth it",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n20w9y/opinion_going_above_and_beyond_for_your_job_is/"
        },
        {
            "author": "u/DreamChaserDoedie",
            "created_utc": "05-09-2021 19:52:54",
            "distinguished": null,
            "edited": false,
            "id": "n8qvo4",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_n8qvo4",
            "nsfw": false,
            "num_comments": 141,
            "permalink": "/r/cscareerquestions/comments/n8qvo4/finding_a_job_is_a_full_time_job_at_this_point/",
            "score": 571,
            "selftext": "My coworkers from my internship have said my resume is pretty decent. I have 2 years of internship experience and I just can’t seem to get any bites. I’m not even getting phone screens at this point. Rejection letter, after rejection letter. It’s pretty demoralizing at this point. Occasionally I’ll go deep into the interview process, feel like I knocked it out of the park, just to get denied. I’m honestly considering just going back to school in the meantime because the job search is getting me nowhere.",
            "spoiler": false,
            "stickied": false,
            "title": "Finding a job is a full time job at this point.",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n8qvo4/finding_a_job_is_a_full_time_job_at_this_point/"
        },
        {
            "author": "u/knitcow",
            "created_utc": "05-26-2021 10:07:45",
            "distinguished": null,
            "edited": false,
            "id": "nlhw9e",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nlhw9e",
            "nsfw": false,
            "num_comments": 103,
            "permalink": "/r/cscareerquestions/comments/nlhw9e/my_boss_says_if_i_cto_leave_the_startup_it_will/",
            "score": 96,
            "selftext": "After working for a startup for 2+ years as the CTO (from the start) and building the quite extensive REST API backend for a consumer app (among other things), I have decided to start a Master's degree. From the beginning of working there, I have communicated to them that one day I would do that. I told my boss 6 weeks ago (about 4 months before leaving and 2 months before being obliged to tell him) that I was planning to start the degree this year, but said I was interested in continuing to work there part-time. Back then he said that it was quite a short time to find someone else, but accepted it.\n\nHe didn't get back to me for 5 weeks (and apparently didn't do anything about it during that time), so it was me who asked for a meeting about 1 week ago to discuss the details of the part-time engagement. Turns out we had very different expectations of how much work I was going to do - I was planning to focus on the degree and thus only work there for 8h/week (at least for a couple months, and then probably leave once a new opportunity comes along), he was expecting 20h/week + more outside the lecture periods. I told him I didn't want to work that much to focus on the degree, he argued that a financing round was planned for this fall and without a \"real\" CTO he had a hard time raising funds, and without funds he had a hard time finding a new CTO and thus had a huge problem. It seemed like he was making me feel as though this was my fault now and giving me a bad conscience about it. This stirred me up a bit and I started to look for alternatives what to do instead working there part-time during my degree (e.g., freelancing). We decided to talk about it again 1 week later.\n\nThinking more about this and finding the alternatives much more attractive and more valuable in terms of my career, I decided I didn't want to work there anymore long-term for different reasons. So I told him today in our meeting that it was my plan to leave the company in 3 months instead of continuing to work there part-time as originally planned. He was staggered and told me he was very disappointed and me not wanting to work there for a couple more weeks/months (part-time) could now cost everyone their job (because of them not getting new funding this way). He made me feel guilty of letting the team down.\n\nWhile I am still sure this is the right decision for me and my career and I don't think I have done anything wrong (feel free to convince me otherwise), I'm still feeling bad about the possibility that me leaving might actually negatively affect the jobs of my team mates (as I have an essential role in the company, both operationally and (apparently) for getting funding).   \n\n\nWould love to hear your thoughts on it!",
            "spoiler": false,
            "stickied": false,
            "title": "My boss says if I (CTO) leave the startup it will go bankrupt and people will lose their jobs",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nlhw9e/my_boss_says_if_i_cto_leave_the_startup_it_will/"
        },
        {
            "author": "u/codeboyyy",
            "created_utc": "05-30-2021 05:43:00",
            "distinguished": null,
            "edited": "05-30-2021 05:53:31",
            "id": "no7r5r",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_no7r5r",
            "nsfw": false,
            "num_comments": 51,
            "permalink": "/r/cscareerquestions/comments/no7r5r/i_got_my_dream_job_and_it_has_been_a_nightmare/",
            "score": 185,
            "selftext": "I got my dream job at ecomm company as mid level engineer 6 months back and I feel like I am in absolute hell ever since. I have not been provided formal trainings, directions on tasks are vague and have to figure everything out where I always feel like I have missed something. Some Seniors are helpful and some doesn't give a shit. \n\nAll these has played in my head and taken a serious toll on my mental health. My anxiety levels are off the chats and started to fear my work. My self confidence is all time low and constantly feel like this is my last month here in company and I am going to get fired soon enough. I am yet to see how my manager reacts when someone screws up badly because I am sure i had or will in future.\n\nThe only good thing here is perks and benefits and salary. \n\nAll these things make me wonder if I should quit before the hell breaks on me and pushes me into depression?",
            "spoiler": false,
            "stickied": false,
            "title": "I got my dream job and it has been a nightmare",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/no7r5r/i_got_my_dream_job_and_it_has_been_a_nightmare/"
        },
        {
            "author": "u/scratchingmynutsack",
            "created_utc": "04-09-2021 14:37:16",
            "distinguished": null,
            "edited": false,
            "id": "mnnogu",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mnnogu",
            "nsfw": false,
            "num_comments": 500,
            "permalink": "/r/cscareerquestions/comments/mnnogu/my_entire_job_is_bullshit_do_i_just_play_along/",
            "score": 1902,
            "selftext": "I work for a federal agency where we don't do any real work. Every work day is just spent sitting in meetings where we \"review\" projects that our consultants put together. Everyone on the team has job titles like \"computer scientist\" and \"data scientist\" but none of them actually have any real knowledge about their respective fields. Every meeting is a two hour long cringe-fest where everybody takes turns spouting nonsense while using big words and buzzwords that don't actually mean anything.\n\nThe hilarious thing is that even the consultants and contractors are clearly bullshitting. They can obviously tell that none of the feds actually understand any of the material, so they just use the same powerpoint slides every week with slight changes made, babble on for a couple hours, dropping the same buzzwords while the feds nod their heads like play along. \n\nNo actual work gets done here. I've been with the agency for almost a year and we're still \"running iterations\" and \"refining our models\". There's a policy letter that we've probably spent hundreds of hours in meetings on and we still haven't even drafted a page worth of material yet. \n\nSo here's the problem. My boss is getting upset about my lack of participation in the bullshit meetings. It also feels a bit demeaning and even shameful to do absolutely nothing at work like this. I'm still very early in my career. Should I try to find something else or should I just learn to bullshit and be grateful for an easy job?",
            "spoiler": false,
            "stickied": false,
            "title": "My entire job is bullshit. Do I just play along?",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mnnogu/my_entire_job_is_bullshit_do_i_just_play_along/"
        },
        {
            "author": "u/waveecho",
            "created_utc": "04-22-2021 19:29:42",
            "distinguished": null,
            "edited": "04-23-2021 03:41:09",
            "id": "mwhue9",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_mwhue9",
            "nsfw": false,
            "num_comments": 225,
            "permalink": "/r/cscareerquestions/comments/mwhue9/how_to_get_first_job_as_swe_two_cents_from_an/",
            "score": 1055,
            "selftext": "Hello,\n\nI am \"experienced\" software engineer at FANG with 5 yoe. Experienced is in quotes because five years isn't whole lot, but I'm definitely not new grad anymore. I've given dozens of interviews, was a manager for couple of years in my previous company, and met with hundreds of job seekers at career fairs. This subreddit was great when I was looking for new jobs, but it seems now more than ever saturated by either new grads or students, so wanted to give some perspectives on how to get that first job. Everything is my personal opinion, and will be geared towards people looking for entry level swe positions.\n\nSo you've been applying. You've had few bites here and there, but no real offer yet. Some people say job search is numbers game, which is true, to an extent. But if you spend some time introspecting on what you are lacking, then you can hugely improve your odds. There are three main components to job search: your resume, people skill, technical interview skill.\n\nFirst your resume, this is your foundation. If the foundation is solid, it will make your job searching that much easier. You can tell your resume is lacking if your callback rate is low. If your resume isn't the best, then your focus should be improving this. Because it doesn't matter how good of engineer you are or master leetcoder, if you never get an interview in first place to able to show them. Formatting and wording is important, but what I usually look for when looking at resumes of new grads is whether they have internships or significant personal projects. Internship is usually better than personal projects, but if you are having hard time getting internship or it doesn't work with your timeline, then spend couple of months making personal project or, better yet, getting a group of friends to do a project and join hackathons. This not only boosts your resume but also gives you talking points in your interviews. 80 percent of the companies will ask you to tell them about something you built.\n\nNow the personal skills. Or as I would like to call it, do you know how to function in a professional setting. If you pass the resume screening (and online assessments) first step is usually a recruiter call. They are looking for red flags and whether you are really interested in their company. So smile, look engaged, and most importantly sound excited for the opportunity. Do some research about the company beforehand, ask meaningful questions and not something like \"is the lunch free?\"\n\nLastly the technical assessment. This is the most dreaded part for most people. Alas, there isn't a golden bullet here. You just have to grind. Grind leetcode, hit the books, and you will get better eventually. But be sure to leetcode intentionally. Meaning you don't always look at solutions after being stuck couple of minutes. If you had to look at a solution to solve a question, then try redoing it right away or the day after, you will be surprised how many questions you've done before you can't do anymore, this just means you didn't truly master the concept, so take it as sign to study more.\n\nLastly, learn from your failures. Unless you are very lucky or all star new grad from Stanford with 5 internships, you will fail your first interviews. The company will also never tell you what the issue was, so spend time on your own what you think went wrong. Was it technical question? Did you say something wrong? Were you too nervous? Debrief with your friends and mentors. And pat on yourself on the back, because that just means you just got that much better at interviewing.  Think of it as getting exp points in interviewing skills. Also remember that luck plays a huge factor in interviews. So keep trying and don't talk rejections personally. Learn from them and eventually you will have an offer.\n\nHope my perspective will be helpful to at least some of you. Feel free to ask me any questions in the comments. I'll answer all of them.\n\nEdit: If you could do me a favor and ask your question as a top level comment, that would make it easier for me to find you. Thank you.\nEdit2: Adding a couple of caveats here, I'm an American so some suggestions might not be as valid in your home country. Also it's for someone looking for a general SWE engineer role, so for breaking into specific industry like AI, embedded, etc, the process is a bit different.",
            "spoiler": false,
            "stickied": false,
            "title": "How to get first job as swe: two cents from an \"experienced\" FANG engineer",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mwhue9/how_to_get_first_job_as_swe_two_cents_from_an/"
        },
        {
            "author": "u/eternally__curious",
            "created_utc": "05-27-2021 10:14:50",
            "distinguished": null,
            "edited": false,
            "id": "nm8ena",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_nm8ena",
            "nsfw": false,
            "num_comments": 59,
            "permalink": "/r/cscareerquestions/comments/nm8ena/people_who_quit_their_job_to_travel_for_few/",
            "score": 102,
            "selftext": "**Background**\n\nI have been working for about 6 years as a jack of all trades guy in a small tech company . This is my first job out of college . Travel is something extremely important to me and I have been doing some travel  for about couple of weeks at a time once a year or so. Now with covid that has reduced to zero obviously  and I have been dreaming about not working and traveling for 3-6 months . \n\nAs I am not specifically \"good\" at something  and have worked at multiple things ( automating projects  , minor devops , measuring and tuning benchmarks , etc )   I am worried about what kind of jobs would I get after my trip . Luckily I don't have any dependents or loans or rent to pay so the only thing that will get impacted is my career  which to be honest I don't care that much about , I only care about the money as it allows me to travel and have a comfortable life.\n\n**Questions**\n\n* My question is for people who quit their job to travel for few months , how did you land a job after your trip?  \n   * Do you think the gap was a big negative in your CV , were you questioned about it at all? \n   * How was the experience of searching for a job while  not having one ? Do you recommend it ?",
            "spoiler": false,
            "stickied": false,
            "title": "People who quit their job to travel for few months , how did you land a job after your trip?",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nm8ena/people_who_quit_their_job_to_travel_for_few/"
        },
        {
            "author": "u/yyzJCO",
            "created_utc": "05-16-2021 12:37:30",
            "distinguished": null,
            "edited": false,
            "id": "nds63u",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nds63u",
            "nsfw": false,
            "num_comments": 92,
            "permalink": "/r/cscareerquestions/comments/nds63u/gifted_burnout_slacker_gets_a_job_offer_after_11/",
            "score": 135,
            "selftext": "I graduated university by leeching off my friends in coding projects and just memorized enough to get my diploma; I had ZERO coding experience/aptitude.\n\nMy programming journey started by doing LeetCode questions and I just felt incredibly stupid. I eventually was able to understand the logic behind 1 question but I didnt feel like I really progressed. \n\nThen I went to Udemy to do some online courses aaaaaaand yup. Tutorial Honeymoon phase. I felt like I was progressing and doing actual programming. Once I wanted to try to do what I’ve learned on my own, I realized, I had no idea how to start.\n\nOnce I decided to make my own projects, (and I emphasize that this is the crucial turning point to start the upswing) things started to click and connect. \n\nI started by literally spending a whole day just memorizing how to create a project:\nnpx create-react-app [project name], cd [project name], npm start. Then slowly but surely, I Googled and YouTubed what I wanted to do. It was a simple React Counting app, then I wanted to learn Hooks, then I wanted to learn CSS... it just kept snowballing. Before I knew it, I had my own portfolio website, a couple of projects I’ve completed on my own and I felt ready to apply. \n\nApplying is a numbers game. I applied to 10 jobs a day for 3 months straight. I’ve gotten maybe 15 calls in those 3 months. Of the 15 calls, 6 of them gave me a chance with a technical test, and of those 6 chances, I’ve failed 5 of them. The one I didnt fail? I made it to the final round of interviewing only to lose because someone else just had more experience than me. \n\nI was tired and drained but not too long after that final round silver medal, I got an email offer.\n\nI’ve never been so happy to get an offer in my life. All the struggle was worth it. I would also like to say that I identify as a “gifted burnout” and I did therapy to help me overcome my “child prodigy” ego or whatever you wanna call it. \n\nIf you feel like you’re past your prime or you cant learn to program, learn from a gifted-burnout-slacker like me. You CAN. Believe in yourself. Keep going. Its a marathon, and I’ll see you on the other side of the finish line.",
            "spoiler": false,
            "stickied": false,
            "title": "“Gifted burnout slacker” gets a job offer after 11 months of grinding and applying",
            "upvote_ratio": 0.77,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nds63u/gifted_burnout_slacker_gets_a_job_offer_after_11/"
        },
        {
            "author": "u/movieboy711",
            "created_utc": "04-05-2021 09:34:45",
            "distinguished": null,
            "edited": false,
            "id": "mkku1j",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_mkku1j",
            "nsfw": false,
            "num_comments": 407,
            "permalink": "/r/cscareerquestions/comments/mkku1j/3_years_after_graduating_and_still_unable_to_get/",
            "score": 809,
            "selftext": "My boyfriend graduated from college in 2018 with a CS degree. Since then, he has been unable to land a CS job. He's not even making it to the interview stage most of the time. I'm not really too sure what other advice to give him. He has applied to all jobs in practically every area of the CS spectrum. From engineering to general IT position, to UI/UX jobs. At this point, it's really starting to feel like a lost cause.\n\nWe talked about him going back to school since he really doesn't even like CS to begin with. He would much rather be in nursing, event planning, or maybe even accounting. Unfortunately, like many people, kinda realized this too late. And going back to school is really expensive, We also discussed maybe doing a coding bootcamp might be helpful.\n\nIMO, I think it's because he really doesn't have much technical experience on his resume. He never did an internship and his other part-time jobs aren't really \"CS\".\n\nAny ideas what to suggest?\n\nHere's a pic of his resume with personal details blurred out:\n\n https://imgur.com/N1t77TH",
            "spoiler": false,
            "stickied": false,
            "title": "3 years after graduating and still unable to get a CS job",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mkku1j/3_years_after_graduating_and_still_unable_to_get/"
        },
        {
            "author": "u/BitterMelono",
            "created_utc": "05-27-2021 03:37:23",
            "distinguished": null,
            "edited": false,
            "id": "nm25tf",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nm25tf",
            "nsfw": false,
            "num_comments": 62,
            "permalink": "/r/cscareerquestions/comments/nm25tf/2471_applications_and_no_job_offers_now_what/",
            "score": 35,
            "selftext": "I've just hit a year of job-searching. 2471 applications. 15 interviews. None of them bore fruition.  2 of them were about to extend an offer, but changed their minds for some reason. \n\n&#x200B;\n\nYes, I've had my resume checked 5 times in the past 3 months, both on here and on r/EngineeringResumes on my main account. I've made many changes and the last few updates got positive reception on there. I've asked friends in the industry to eviscerate it and it looks fine, apparently. I've got multiple side projects, but no internships. Is that really the problem; no ACTUAL experience? Plus, I'm becoming increasingly bitter and vengeful, and I almost lashed out at the last interviewer I had. So yeah, I've been filtered out. Congrats, senior developers, you won. \n\n&#x200B;\n\nAlright. The theatrics aside, something is clearly wrong with me and there's no way for me to organically find a job like everyone else does. Those of you who (miraculously) got out of this situation, what did you do? I'm completely at a loss, here. The idea of an unpaid internship was ridiculous to me, but it seems to be the only option, aside from the military.",
            "spoiler": false,
            "stickied": false,
            "title": "2471 applications and no job offers. Now what?",
            "upvote_ratio": 0.73,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nm25tf/2471_applications_and_no_job_offers_now_what/"
        },
        {
            "author": "u/Sinister-Zone",
            "created_utc": "05-20-2021 19:03:52",
            "distinguished": null,
            "edited": false,
            "id": "nhe381",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nhe381",
            "nsfw": false,
            "num_comments": 72,
            "permalink": "/r/cscareerquestions/comments/nhe381/from_45k_as_a_junior_to_80k_at_a_new_job_feels/",
            "score": 70,
            "selftext": "I have only 2 years of experience. I left my first company as a software developer, and just joined the company last week and so far it feels familiar to what I've been doing at my last job (various full-stack development, React, Ruby, Node). But I can't help thinking I am paid too much. What I mean by that is, what if my valuation is in a bubble, and the company starts to realize it? They might knock my salary down to something more reasonable like $50 to $60k. Is there a big chance of that happening? I feel like I ripped them off at $80k lol",
            "spoiler": false,
            "stickied": false,
            "title": "From $45k as a junior to $80k at a new job. Feels too good to be true?",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nhe381/from_45k_as_a_junior_to_80k_at_a_new_job_feels/"
        },
        {
            "author": "u/Engineered_art",
            "created_utc": "05-15-2021 23:05:25",
            "distinguished": null,
            "edited": false,
            "id": "ndf2yc",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ndf2yc",
            "nsfw": false,
            "num_comments": 99,
            "permalink": "/r/cscareerquestions/comments/ndf2yc/what_would_make_you_leave_your_job_the_fastest/",
            "score": 47,
            "selftext": "Feel free to answer this positively, such as if you got another offer for X% more money, was a promotion, or that offered some other new benefit, or negatively, such as an unwelcome environmental or task change, a demotion, new management practice, etc, or both positively and negatively.\n\nFor me, negatively, the first thing that comes to mind would be if I came to be regarded as a total screw-up and was unable to feel respected by my colleagues and take pride in my work. That, plus the concerns over job security that would surely come as a result, would make me look for a way out faster than anything. \n\nPositively, 25%+ increase in current salary would be pretty tempting, all else being equal.",
            "spoiler": false,
            "stickied": false,
            "title": "What would make you leave your job the fastest?",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ndf2yc/what_would_make_you_leave_your_job_the_fastest/"
        },
        {
            "author": "u/D2destiny",
            "created_utc": "05-08-2021 00:51:28",
            "distinguished": null,
            "edited": false,
            "id": "n7hmjo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_n7hmjo",
            "nsfw": false,
            "num_comments": 135,
            "permalink": "/r/cscareerquestions/comments/n7hmjo/anyone_else_noticing_a_lot_of_entry_level_jobs/",
            "score": 92,
            "selftext": "Is this just me noticing this or what. \n\nMultiple web dev companies offering sub 45k salaries for remote work...?\n\nIs this cuz the field is so saturated at entry level?\n\nObviously I'm not talking about faang/unicorn/experienced salaries.",
            "spoiler": false,
            "stickied": false,
            "title": "Anyone else noticing a lot of entry level jobs offering lower salaries?",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n7hmjo/anyone_else_noticing_a_lot_of_entry_level_jobs/"
        },
        {
            "author": "u/Irantwomiles",
            "created_utc": "04-16-2021 16:04:29",
            "distinguished": null,
            "edited": "04-16-2021 22:29:18",
            "id": "msb9tt",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_msb9tt",
            "nsfw": false,
            "num_comments": 139,
            "permalink": "/r/cscareerquestions/comments/msb9tt/just_got_my_first_offer_its_still_unreal_that_i/",
            "score": 1037,
            "selftext": "Kind of a rant I guess, but yesterday I got my first offer at a small company and I'm genuinely so excited. It's so weird thinking about why I started to program and how now I have a career in it.\n\n&#x200B;\n\nFor those interested. I started applying in October, but not seriously. I mainly started applying after I graduated in December. I believe I have over 230 applications, 4-5 interviews and only 1 offer.\n\n&#x200B;\n\nEDIT: Since this post has taken off I've seen some similar questions. The location is in North Carolina and the salary is 64k. ",
            "spoiler": false,
            "stickied": false,
            "title": "Just got my first offer, It's still unreal that I got a job",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/msb9tt/just_got_my_first_offer_its_still_unreal_that_i/"
        },
        {
            "author": "u/codegreatnate",
            "created_utc": "04-25-2021 12:22:08",
            "distinguished": null,
            "edited": "04-25-2021 17:57:55",
            "id": "mybng0",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_mybng0",
            "nsfw": false,
            "num_comments": 119,
            "permalink": "/r/cscareerquestions/comments/mybng0/i_landed_a_73k_sde_job_while_still_in_undergrad/",
            "score": 417,
            "selftext": "Last year I landed a software developer role while still in school. I was set to graduate about a two months from when I got the job and had previously gunshot out over 200 applications. I started working while I was still wrapping up linear algebra.\n\nOf those applications I got plenty of interviews and even landed interviews at Amazon, Square, and IBM just to name a few. I failed pretty hard at the interviews because I'm trash at Leetcode, but I did keep getting asked how I even landed interviews with them. I attribute a lot of my success to my resume and the format I used, primarily because for every phone screen the recruiter mentioned how much they loved the graphics I included, and how interesting the resume was.\n\nI know 73K is not a lot but its at a startup and the stock options and profit share even it out nicely in my opinion.\n\nAnyway, I just wanted to post some advice on what I did to format my resume and also what a lot of recruiters and friends who did work at FAANG told me to include on my resume.\n\n1. Find a resume template that is engaging, but still clean and readable. A lot of you have resume's that are a hot mess. I saw a post recently where an interviewer talked about how people really put a sentence or two at the bottom of their resume just to say they got interviewed at FAANG, as if thats supposed to sway the interviewer. Some of you don't add margins, headings, etc. If you're entry level, no one really cares about the objective section. Just delete it and use the room to add more about your experience and personal projects.\n2. Use action words and talk about impact. That was a big one for Amazon and Microsoft. They want to know what you did and who you impacted. If you don't have any metrics than discuss who your tech should impact. Add a human element, especially if your tech could help vulnerable communities.\n3. Applicant Tracking System. Run your resume through an ATS parser. You want to make sure your resume is being parsed properly.\n4. Try to add involvement that is not tech related. It really highlights how well rounded a person you are. I have two. One that is tech inspired but not purely tech related and one that is unrelated to tech but shows my interests. We all grind and code, but its interesting to know you don't spend all of your time doing that.\n\nHere is the template I use:\n\nMy resume: [https://www.overleaf.com/latex/templates/entry-level-resume-template-latex/jsmpwkcwyntg](https://www.overleaf.com/latex/templates/entry-level-resume-template-latex/jsmpwkcwyntg)\n\nHere is the standard resume template used in tech:\n\nJake's resume: [https://www.overleaf.com/latex/templates/jakes-resume/syzfjbzwjncs](https://www.overleaf.com/latex/templates/jakes-resume/syzfjbzwjncs)\n\nLet me know if there's anything else I could post that may provide insight into the interview process with some of those companies. Some videos I plan on making detail the organizations and internships for freshman and sophomores that I didn't know about (until it was too late and I was a junior) that I saw got my peers into great companies; and what its really like to be a SDE, including scrum, realistic tasks for juniors, etc; and interviews with my friends who do work anywhere from FAANG to national labs as SDE's and MLEs.\n\nAlso feedback is greatly appreciated (:\n\nJust wanted to give back since this community raised me lol.",
            "spoiler": false,
            "stickied": false,
            "title": "I landed a 73K SDE job while still in undergrad",
            "upvote_ratio": 0.8,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mybng0/i_landed_a_73k_sde_job_while_still_in_undergrad/"
        },
        {
            "author": "u/jaypeejay",
            "created_utc": "05-08-2021 16:20:12",
            "distinguished": null,
            "edited": false,
            "id": "n7xlhs",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Meta",
            "locked": false,
            "name": "t3_n7xlhs",
            "nsfw": false,
            "num_comments": 122,
            "permalink": "/r/cscareerquestions/comments/n7xlhs/if_you_have_a_good_job_what_are_you_learning_to/",
            "score": 68,
            "selftext": "Title",
            "spoiler": false,
            "stickied": false,
            "title": "If you have a good job, what are you learning to make sure you still have a good job in ten years?",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n7xlhs/if_you_have_a_good_job_what_are_you_learning_to/"
        },
        {
            "author": "u/BeautifulSoup97",
            "created_utc": "04-15-2021 09:24:48",
            "distinguished": null,
            "edited": false,
            "id": "mreldh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mreldh",
            "nsfw": false,
            "num_comments": 145,
            "permalink": "/r/cscareerquestions/comments/mreldh/do_you_continuously_oscillate_between_loving_and/",
            "score": 838,
            "selftext": "I'm not sure if this is my personal trait or every developer goes through this. At one point I feel really grateful to work on new technologies and get a good amount of money. While at other times I'm just pulling my hair thinking mental health comes first and I should go for an \"easier\" job.\n\nI just oscillated between these feelings 3-4 times today. How do y'all deal with this? If I feel this way too often then should I consider another industry for the long term?",
            "spoiler": false,
            "stickied": false,
            "title": "Do you continuously oscillate between loving and hating your job?",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mreldh/do_you_continuously_oscillate_between_loving_and/"
        },
        {
            "author": "u/shawn_gibs_",
            "created_utc": "04-29-2021 16:03:23",
            "distinguished": null,
            "edited": false,
            "id": "n1cvti",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_n1cvti",
            "nsfw": false,
            "num_comments": 100,
            "permalink": "/r/cscareerquestions/comments/n1cvti/i_have_just_graduated_with_a_degree_in_computer/",
            "score": 279,
            "selftext": "All i really feel i have learned in the last 4 years is how to write terminal based applications in java or c# asp.net applications. I dont feel ive learned anything that could really be applied at a career",
            "spoiler": false,
            "stickied": false,
            "title": "I have just graduated with a degree in computer science, yet i dont feel any more prepared for a career in this field than i did the first day of freshman year. Is this normal or did i do something horribly wrong? What are some must have skills i need before i apply for a job?",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n1cvti/i_have_just_graduated_with_a_degree_in_computer/"
        },
        {
            "author": "u/WillingSmoke",
            "created_utc": "06-02-2021 11:45:33",
            "distinguished": null,
            "edited": false,
            "id": "nqou6g",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_nqou6g",
            "nsfw": false,
            "num_comments": 23,
            "permalink": "/r/cscareerquestions/comments/nqou6g/what_should_i_do_leetcode_or_development_to_land/",
            "score": 47,
            "selftext": "The title says it all. I'm an EC student and I don't know where my future ends. I'm from India and companies here literally decides your resume based on what college you are from.\n\nI'm from a tier-3 college and applied for more than 100 internships from LinkedIn, Internshala and other websites. Only one company replied and asked me whether I know about algorithms that are implemented in Snapchat, Instagram and other popular social media, come on I'm still in my 6th semester and I don't even have any experience, how do I know about it if I don't have any exposure to real world problems?\n\nMy friends from tier-1 colleges landed in internships from fortune 500 companies and they told me that they might get the PPO too. And here I am looking for internships that pay 3% of what they make in a month :(\n\nIn our college, students will be placed in companies like TCS, Infosys, Capgemini, etc. The salary will be 3.4 LPA or nearly 4700 USD per year, which boils down to 390 USD per month.\n\nLooking at LinkedIn posts makes me sad, people are joining in Product based companies and unicorn startups. And I'm looking for a one single internship.\n\nI'm solving leetcode questions from the past month(110 problems until now) and learning NodeJS along with it. I'm at this point that I think I should put this aside and take up another business.\n\nDid you face anything similar to this? If yes how did you cope up with anxiety and how did you reach to recruiters? Any help would be appreciated.",
            "spoiler": false,
            "stickied": false,
            "title": "What should I do leetcode or development to land a decent job? I want to badly quit but I can't.",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nqou6g/what_should_i_do_leetcode_or_development_to_land/"
        },
        {
            "author": "u/YareSekiro",
            "created_utc": "04-29-2021 08:03:07",
            "distinguished": null,
            "edited": false,
            "id": "n12tgu",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_n12tgu",
            "nsfw": false,
            "num_comments": 130,
            "permalink": "/r/cscareerquestions/comments/n12tgu/what_was_software_developers_job_like_in_the_90s/",
            "score": 159,
            "selftext": "Just as the title says, how was the working environment, practices and routines for developers/software engineers different when it was in the 90s/early 00s when there wasn't a mature cloud service provider, DevOps didn't exist, mobile wasn't a thing yet and waterfall was still the dominant model?",
            "spoiler": false,
            "stickied": false,
            "title": "What was software developers' job like in the 90s and early 00s?",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n12tgu/what_was_software_developers_job_like_in_the_90s/"
        },
        {
            "author": "u/kp4ws",
            "created_utc": "05-31-2021 18:52:12",
            "distinguished": null,
            "edited": false,
            "id": "npfk6t",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_npfk6t",
            "nsfw": false,
            "num_comments": 45,
            "permalink": "/r/cscareerquestions/comments/npfk6t/is_45k_the_average_salary_for_a_junior_developer/",
            "score": 10,
            "selftext": "I just recently graduated with a diploma in Software Development so I have 2 years of school experience. I don't have any industry experience.\n\nI got offered a job for $45,000 per year. If I'm not mistaken, the average salary for a junior developer is $50,000/year? Should I still take the job anyway?",
            "spoiler": false,
            "stickied": false,
            "title": "Is 45k the average salary for a junior developer job (in Canada)?",
            "upvote_ratio": 0.74,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/npfk6t/is_45k_the_average_salary_for_a_junior_developer/"
        },
        {
            "author": "u/RemoteSpace9558",
            "created_utc": "04-26-2021 12:05:23",
            "distinguished": null,
            "edited": false,
            "id": "mz148a",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mz148a",
            "nsfw": false,
            "num_comments": 91,
            "permalink": "/r/cscareerquestions/comments/mz148a/leaving_my_new_job_after_a_month_because_its_a/",
            "score": 326,
            "selftext": "A month ago I started a new remote job at a mid size tech company no one has heard of for a mid level dev role. Here has been the insanity that has ensued in that time frame:\n\n- The job title I interviewed for was not the one I received in my offer letter. Thought nothing of it, until I started to find out I would be doing support and not writing code. I spoke to my manager and she said it was 80% support, I might get to code later in the year. They did the same thing to two other new hires, WTF \n\n- Required to watch a recorded zoom call. The call actually got heated between management and employees. The CEO cut off an engineer and said \"LOOK HERE'S THE DEAL…\" This is shown to all new hires lmao\n\n- Was told I got equity day 1 in the interviews as part of my comp. Well to my surprise it's radio silence about equity. I spoke to my manager about this and she said this was \"coming soon\". So what I was told in my interviews about that comp doesn't even exist but is supposed to come later? WTF\n\n- Day 1, four hours into my shift I started doing support. I didn't even have my bank account setup to get paid nor did I know who anyone was. No idea what I was doing and I just fumbled through it. \n\n- Work life balance is trash. There are certain PM's that are on Slack 24 hours, you can contact them any time. Boss seems to do 10-11 hour days on average\n\n- First week and 3 engineers left. Granted I don't know how engineering is laid out, but definitely heard \"we can't do X because we lost a guy\" more than once. Department lead mentioned issues around employee retention in all hands meetings WTF \n\n- Culture is trash. No one talks in slack channels, no fun talk about things outside work, no light hearted convos. Don't know anything about my coworkers, It's just work work work. Some people might prefer that but believe me it's about as welcoming as a morgue slab.\n\nSo naturally after week 1 I saw the writing on the wall (the bait and switch alone had me out the door) and continued interviewing. Well I got an offer and they want me to start in two weeks. \n\nI'm thinking after this fucking madness I will only give them 1 week notice and take the next week off to recharge. Then I will leave it off my resume forever. What do you think? Should I even care about burning that bridge?",
            "spoiler": false,
            "stickied": false,
            "title": "Leaving my new job after a month because it's a next level shit show",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mz148a/leaving_my_new_job_after_a_month_because_its_a/"
        },
        {
            "author": "u/paasaaplease",
            "created_utc": "05-06-2021 20:01:56",
            "distinguished": null,
            "edited": false,
            "id": "n6lhu7",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_n6lhu7",
            "nsfw": false,
            "num_comments": 103,
            "permalink": "/r/cscareerquestions/comments/n6lhu7/is_software_engineering_a_low_stress_job/",
            "score": 64,
            "selftext": "Based on your professional experience, is software engineering a \"low stress job? Did you think it would be going into it? Is it a high stress job? Is it neither high stress or low stress?\n\nSome might say, name a lower stress job that pays this much money, but that doesn't mean it's a low stress job. \n\nWhat do you think?",
            "spoiler": false,
            "stickied": false,
            "title": "Is software engineering a \"low stress\" job?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n6lhu7/is_software_engineering_a_low_stress_job/"
        },
        {
            "author": "u/hypercrying",
            "created_utc": "06-01-2021 17:58:08",
            "distinguished": null,
            "edited": false,
            "id": "nq5sqd",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nq5sqd",
            "nsfw": false,
            "num_comments": 20,
            "permalink": "/r/cscareerquestions/comments/nq5sqd/feeling_like_ive_wasted_4_years_being_complacent/",
            "score": 37,
            "selftext": "I'm 28 living in the US with a computer science bachelors degree. I've had one job since graduating college that I've been at for the past 4 years. It's a decent job (95k salary, good work environment, relatively low stress).\n\n\nHowever I am realizing that there's no personal growth if I stay here. I've been doing the same types of tasks as when I was first hired. Bug fixing, minor feature implementation, and rewriting old/bad code using Java/hibernate/JavaScript. \n\n\nI'm not up to date on any in demand skills like react or node. My interview skills are probably subpar (working on leetcode now though). I just feel like I'd get outclassed by 99% of this sub. There's no reason any employer would want to hire me for more than what I'm earning now. \n\n\nSo to the point: I constantly see people here talking about how switching jobs got them 20-30% salary increases, and they do that every few years. \n\n\nI want to become a skilled enough dev so that I can have that kind of lifestyle. But is this 4 year slacker period right out of college going to hurt me? Am I just trying to polish a turd at this point? I guess I'm just looking for advice one way or the other.",
            "spoiler": false,
            "stickied": false,
            "title": "Feeling like I've wasted 4 years being complacent at my current job and desperately want to change",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nq5sqd/feeling_like_ive_wasted_4_years_being_complacent/"
        },
        {
            "author": "u/spider_man00",
            "created_utc": "03-25-2021 10:29:44",
            "distinguished": null,
            "edited": false,
            "id": "mczjmx",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_mczjmx",
            "nsfw": false,
            "num_comments": 286,
            "permalink": "/r/cscareerquestions/comments/mczjmx/my_manager_says_im_bad_at_my_job_yet_is_dependent/",
            "score": 1273,
            "selftext": "I'm currently looking for a new job with 2 years of experience.  My manager has been telling me for the past year and a half that he plans to promote me but never does.  In the past year, he has given me more responsibilities than ever compared to what is expected from my level.\n\n\n\n\n\nI can't even take a day off without feeling guilty because everything is so dependent on me.  When I told my manager this and suggested a promotion or raise, he told me that I was bad at my job.  I am burning out at my job pretty fast because I have all these responsibilities, no recognition, and everyone is so dependent on me.  As a junior engineer that is expected to function as a senior, I feel like there is no room for growth.",
            "spoiler": false,
            "stickied": false,
            "title": "My manager says I'm bad at my job, yet is dependent on me for getting a huge amount of work done",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mczjmx/my_manager_says_im_bad_at_my_job_yet_is_dependent/"
        },
        {
            "author": "u/Same-Company-7yrs",
            "created_utc": "05-17-2021 13:33:58",
            "distinguished": null,
            "edited": false,
            "id": "nemh22",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nemh22",
            "nsfw": false,
            "num_comments": 50,
            "permalink": "/r/cscareerquestions/comments/nemh22/job_search_prep_is_overwhelming/",
            "score": 51,
            "selftext": "There’s LeetCode, system design, language trivia, behaviorial questions, salary negotiations, presentation anxiety and more. Depending on the company you’re interviewing for, they might not ask you a single LeetCode question but a different company might ask you a LeetCode hard.\n\nTo be prepared for it all, it would take me at least a year to feel like I have a good understanding of almost everything that a person can ask me. I keep procrastinating my job search prep because I feel so overwhelmed on the vast amount knowledge I’m supposed to know in order to pass interviews.\n\nI’m trying to break it down into smaller pieces so I don’t feel so overwhelmed. Last time I attempted and failed to get a new job, I studied LeetCode like crazy to be asked the most simple LeetCode problems or none at all but still fail because of my presentation anxiety when I was whiteboarding the problems. It felt like a huge waste of time spending so much time on LeetCode.\n\nThis time around, I just don’t know what to focus on. There are so many different aspects of interviews to work on and improve and I don’t know which ones are the “most” important for me to excel at. Is it LeetCode? Is it soft skills? Is it language knowledge? Web knowledge?\n\nI’m seriously struggling with how to break it down into parts and know what to focus on. Can anyone help me figure out what I should focus on? Or how I can figure out what to focus in based off of my own personal assessment?\n\nI totally forgot everything about interviewing, so I’m pretty much a total newbie at this",
            "spoiler": false,
            "stickied": false,
            "title": "Job search prep is overwhelming",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nemh22/job_search_prep_is_overwhelming/"
        },
        {
            "author": "u/International_Ad_179",
            "created_utc": "05-27-2021 20:51:27",
            "distinguished": null,
            "edited": false,
            "id": "nmm091",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_nmm091",
            "nsfw": false,
            "num_comments": 24,
            "permalink": "/r/cscareerquestions/comments/nmm091/graduated_with_a_cs_degree_but_my_first_job_has/",
            "score": 42,
            "selftext": "I'll try to give a summary of my situation without going too much into detail. Really just looking for some advice or motivation.\n\nI graduated with a CS degree back in May 2020 during the early stages of the pandemic. I was pretty desperate, so I basically took the first tech job I could get. It was at a large non technical F500 company (retail). I've been here around 9 months, but I feel like things are going pretty bad.\n\n&#x200B;\n\n* I spend like 75% of my time at my job doing IT support / help desk type stuff. I really hate this and I find it exhausting. I constantly am working tickets and having to work odd hours. I get pulled into doing stuff at 2:00AM sometimes. This is the worst part of the job because I feel like I am not gaining any transferable experience, and at the same time it leaves me completely exhausted. I can barely even describe what I do it all seems so specific to the company's systems.\n* The projects that I do get assigned to do I think are being done with very bad coding practices. This is my first job so I'm not sure how things are normally done. But my first project I was assigned I worked completely alone. I did all the requirements gathering, coding, testing, etc by myself, and would only get to meet with a senior coworker when I need my code promoted. I would try to reach out but didn't get a ton of assistance from coworkers. I've only been with the company a few months and had code promoted to production without anyone else on the team actually looking at it or reviewing. In hindsight I should have tested stuff much more I'm surprised I didn't break anything. Now, my current project has just been \"pair programming\" with the senior dev. But it's all very advanced stuff and I try to keep up, but it's basically just him coding everything and me watching then I do all the documentation. \n* The only other coding I do is write random PowerShell scripts when asked by my manger. For this, I basically just google every single thing I do.\n\n&#x200B;\n\nSorry if this was a rant, but I really don't like my job. I want to start looking for a new one, but I just feel very mentally drained. It's hard to work on side projects or leetcode when I'm already working like 60 hours a week. And this job is really the only thing I have to put on my resume but I'm not even sure if I'm learning enough to get another job. I've already been out of school for a year so I can't even apply to most new grad roles it seems. Overall, I just feel very stuck in this job and am pretty exhausted honestly.",
            "spoiler": false,
            "stickied": false,
            "title": "Graduated with a CS degree but my first job has been a bad experience. I feel very burnt out, how do I recover from this?",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nmm091/graduated_with_a_cs_degree_but_my_first_job_has/"
        },
        {
            "author": "u/SWEwannabe",
            "created_utc": "05-31-2021 11:26:24",
            "distinguished": null,
            "edited": false,
            "id": "np5yna",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_np5yna",
            "nsfw": false,
            "num_comments": 30,
            "permalink": "/r/cscareerquestions/comments/np5yna/worked_in_a_different_industry_for_a_year_cant/",
            "score": 17,
            "selftext": "Hello all, I apologize if my questions have been covered extensively before, I haven’t quite been able to find answers.\n\nI graduated with a BS in comp sci from a top 20 CS school (per USNews) last summer with a slightly sub 3.0 GPA. I never did any internships and didn’t make time to build a portfolio in college, but I did work part time all the way through college and held some substantial leadership roles.\n\nLast summer I took the first job I could get after graduating to pay the bills, which was a sales and logistics role, I had a minor leadership role there and have a pretty good description of the time management and problem solving skills it required on my resume. I resigned because I didn’t want to pursue sales long term and it was too time consuming to allow me to pursue a different career.\n\nNow, I can’t seem to even get an interview for SWE roles, even the lower paying ones (I’m looking primarily on the East coast), and I don’t know what to do. I understand the degree itself doesn’t prove I’m a good programmer, but I thought it would be enough to at least get me some interviews.\n\nWhat steps do I need to take to become hireable? I am beginning to work on a portfolio but I know that’s going to take months to be worth much, I need to pay my bills so I can’t really dedicate weeks or months to a bootcamp.\n\nAre there any jobs that are at least in the same field I can get with my degree alone? What are they and how do I look for them? I am okay with not being an SWE right out of the gate if that’s not feasible at the moment but that is my long term goal and I want to try and at least steer my short term career path back in that direction.",
            "spoiler": false,
            "stickied": false,
            "title": "Worked in a different industry for a year, can’t find a job now",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/np5yna/worked_in_a_different_industry_for_a_year_cant/"
        },
        {
            "author": "u/smooth_ducky",
            "created_utc": "03-21-2021 18:05:49",
            "distinguished": null,
            "edited": false,
            "id": "ma7ejz",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ma7ejz",
            "nsfw": false,
            "num_comments": 470,
            "permalink": "/r/cscareerquestions/comments/ma7ejz/in_order_to_get_a_pulse_on_the_junior_03_yoe/",
            "score": 539,
            "selftext": "Has COVID actually affected anything, or is the market similar to what it was in 17-18-19?\n\nI'm landing interviews here and there, but I'm wondering how competitive a given position is right now. If you're interviewing with company A at the moment, is the competition for that spot tougher than it was a couple years ago?",
            "spoiler": false,
            "stickied": false,
            "title": "In order to get a pulse on the junior (0-3 YoE) level job market: How has job hunting been for y'all?",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ma7ejz/in_order_to_get_a_pulse_on_the_junior_03_yoe/"
        },
        {
            "author": "u/DimFakJimKK",
            "created_utc": "05-17-2021 13:25:00",
            "distinguished": null,
            "edited": false,
            "id": "nem8j4",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nem8j4",
            "nsfw": false,
            "num_comments": 49,
            "permalink": "/r/cscareerquestions/comments/nem8j4/there_seem_to_be_a_fair_amount_of_govt_jobs/",
            "score": 44,
            "selftext": "Hi all!\n\nI frequent this subreddit often and the general consensus seems to be that govt jobs are low-paying and hard to acquire. On the advice of a recent thread I decided to look at these jobs anyway and they seem ...normal?\n\nFor instance there are several GS-12+ jobs outside major cities that pay $76,721 to $109,358 per year with the only requirement being:\n\n\"One year of appropriate specialized experience equivalent to at least the GS-11 level in the Federal service that demonstrates accomplishment of computer project assignments that required a wide range of knowledge of computer requirements and techniques pertinent to the position to be filled. \"\n\n\n\nThere are a few GS-09 jobs with even lower requirements!\n\n\nIt looks like any dev that's had 2-3 of years industry work would qualify? And an upper-5-figure salary in a mid-sized town in, say, Oregon isn't bad at all. Throw in benefits and the stability of govt work and it sounds like a great deal.\n\n.\n\nSo I feel I must be missing something here. Is the hiring process very stringent for those coming from the private sector? Are the technical/onsite rounds insanely difficult? Or is it something else entirely?",
            "spoiler": false,
            "stickied": false,
            "title": "There seem to be a fair amount of govt jobs paying a pretty good wage right now, what's the catch?",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nem8j4/there_seem_to_be_a_fair_amount_of_govt_jobs/"
        },
        {
            "author": "u/SweatyShirtlessMan",
            "created_utc": "05-16-2021 10:17:27",
            "distinguished": null,
            "edited": false,
            "id": "ndp9r3",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ndp9r3",
            "nsfw": false,
            "num_comments": 41,
            "permalink": "/r/cscareerquestions/comments/ndp9r3/how_easy_is_it_to_land_a_second_job_if_you_stayed/",
            "score": 65,
            "selftext": "Hi everyone. I have been a developer for 10 months now and have gotten 2 promotions since starting. I am very underpaid compared to others in my area with my level of experience so I’m considering leaving soon. I want to be paid the market rate. \n\nIn your experience how easy/hard is it to land a second job with a year of experience? Thanks",
            "spoiler": false,
            "stickied": false,
            "title": "How easy is it to land a second job if you stayed at your first job for over a year?",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ndp9r3/how_easy_is_it_to_land_a_second_job_if_you_stayed/"
        },
        {
            "author": "u/insanelylogical",
            "created_utc": "05-18-2021 14:06:09",
            "distinguished": null,
            "edited": false,
            "id": "nfhnor",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nfhnor",
            "nsfw": false,
            "num_comments": 52,
            "permalink": "/r/cscareerquestions/comments/nfhnor/what_are_your_thoughts_on_the_future_of_go_golang/",
            "score": 30,
            "selftext": "GO was designed to make concurrency easy(ier) to program and I think many people believe it achieved that. The simplicity of the language meant restricting it's usecases and seem to lack some features, such as generics.  However, generics are now being introduced to the language among other things to broaden its usecases.\n\nDo you see GO competing with languages like Java and C++ as general programming languages? How will program with GO in the future? Will it be destined to take the fate of languages like Scala, only used in certain domains?",
            "spoiler": false,
            "stickied": false,
            "title": "What are your thoughts on the future of GO (golang) over the next 5 years? What job roles (that aren't already commonly using go) will adopt it as part of their standard stack?",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nfhnor/what_are_your_thoughts_on_the_future_of_go_golang/"
        },
        {
            "author": "u/MonkeysDropMuchAcid",
            "created_utc": "05-22-2021 07:07:20",
            "distinguished": null,
            "edited": false,
            "id": "nig97k",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nig97k",
            "nsfw": false,
            "num_comments": 54,
            "permalink": "/r/cscareerquestions/comments/nig97k/i_had_2_database_courses_in_uni_and_i_hated_them/",
            "score": 12,
            "selftext": "Through the entire duration of both of those courses I didn't find it enjoyable for a single moment. But I see databases mentioned half frequently so my question is can you actually have a job without touching this stuff? Which job positions require a knowledge of databases and which jobs have nothing to do with them?",
            "spoiler": false,
            "stickied": false,
            "title": "I had 2 database courses in uni and I hated them - how important is database knowledge (SQL, MySQL, etc) for various jobs?",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nig97k/i_had_2_database_courses_in_uni_and_i_hated_them/"
        },
        {
            "author": "u/jonnycross10",
            "created_utc": "05-15-2021 20:01:12",
            "distinguished": null,
            "edited": false,
            "id": "ndbxz1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ndbxz1",
            "nsfw": false,
            "num_comments": 62,
            "permalink": "/r/cscareerquestions/comments/ndbxz1/did_coding_as_a_job_ruin_your_enjoyment_of_it/",
            "score": 29,
            "selftext": "I love coding, and I've been getting a few interviews and I've started thinking about this question. My guess is that I'll still code a little bit in my free time doing whatever's exciting at the time. What's your experience? Did you stop coding in your freetime when you got a job?",
            "spoiler": false,
            "stickied": false,
            "title": "Did coding as a job ruin your enjoyment of it?",
            "upvote_ratio": 0.87,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ndbxz1/did_coding_as_a_job_ruin_your_enjoyment_of_it/"
        },
        {
            "author": "u/GoodWill_returns",
            "created_utc": "05-29-2021 08:38:48",
            "distinguished": null,
            "edited": false,
            "id": "nnmn1k",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_nnmn1k",
            "nsfw": false,
            "num_comments": 22,
            "permalink": "/r/cscareerquestions/comments/nnmn1k/what_last_year_cs_student_should_learn_to_improve/",
            "score": 26,
            "selftext": "I will graduate in 13 months. I am already excellent in algorithm and python (read: can solve leet without looking around on web). \n\nI am decent in Java and web. \n\nWhat else should I learn? Android development, Flutter, desktop application, improve web, or anything other? Should I try wider or deeper approach? \n\nShould I focus more on creating good projects or writing an academic paper? \n\n&#x200B;\n\nThank you. Please do advice.",
            "spoiler": false,
            "stickied": false,
            "title": "What last year CS student should learn to improve his chances in real world jobs?",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nnmn1k/what_last_year_cs_student_should_learn_to_improve/"
        },
        {
            "author": "u/mjeanbapti",
            "created_utc": "05-13-2021 23:16:47",
            "distinguished": null,
            "edited": false,
            "id": "nbz2q5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_nbz2q5",
            "nsfw": false,
            "num_comments": 65,
            "permalink": "/r/cscareerquestions/comments/nbz2q5/what_did_you_do_when_you_couldnt_land_a_job_fresh/",
            "score": 35,
            "selftext": "Hello, I just recently received my degree in computer science. I’ve been in the job market for almost a year now. I’ve constantly been applying, doing side projects, just trying to bulk my resume. I’ve had a few interviews, but I was rejected. I’m getting discouraged. I don’t know what to do, should I keep applying and do what I’m doing or should I go back to school? I’m applying to every entry level position: software engineer, software developer, QA analyst etc. Am I applying to the wrong jobs? I do not have any work experience so that’s why I’ve been doing side projects. One side project I’ve been doing was creating an e-commerce website using the MERN stack. I’m literally lost at this point, I don’t know what to do.",
            "spoiler": false,
            "stickied": false,
            "title": "What did you do when you couldn’t land a job fresh out of college?",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nbz2q5/what_did_you_do_when_you_couldnt_land_a_job_fresh/"
        },
        {
            "author": "u/skinnyweeb1325",
            "created_utc": "04-14-2021 13:22:02",
            "distinguished": null,
            "edited": "04-14-2021 15:46:03",
            "id": "mqvcrh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mqvcrh",
            "nsfw": false,
            "num_comments": 69,
            "permalink": "/r/cscareerquestions/comments/mqvcrh/after_years_of_selfstudy_and_internships_i/",
            "score": 1170,
            "selftext": "To give a brief overview of my background, I started college in 2016 and my mother died a year later which left me without parents. Ended up becoming super depressed and dropped out after getting enough credits to snag an associates degree. I took a few programming courses in college for fun and noticed that I was pretty decent at programming relative to my peers so I decided to give programming a shot after dropping out. I put in a lot of self-study, built out some projects just using the MERN stack, and secured an internship from those projects. I ended up working three different internships before receiving my offer for a software engineering position.\n\nThis may sound kind of stupid, but I was making around ten dollars an hour at most of my internships.  My last internship ran out of funding and couldn't really pay me so I went out on the job search again. Ended up interviewing for a position that required two years of experience as well as a bachelor's degree. I had four interviews with them, absolutely killed the interviews. I could tell they were interested in me and I got along with them really well. One interview was supposed to last an hour but I ended up spending two hours on the zoom call with him talking about tech. The position is fully remote and pays \\~$100k. This feels completely undeserved, I feel like I cheated my way into this or something. Even though there's no evidence for it other than I took a completely different path than most.\n\nWondering if there's anyone who has had similar experiences? What was it like working for that position once you secured that well-paying job? Did you feel like an impostor? Any advice on how to cope with this? Thanks!\n\n&#x200B;\n\nEdit: Thanks so much for all the positive support! I'll be sure to send private messages to anyone if they have any questions. ",
            "spoiler": false,
            "stickied": false,
            "title": "After years of self-study and internships, I finally got a real job. Unsure how to process this.",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mqvcrh/after_years_of_selfstudy_and_internships_i/"
        },
        {
            "author": "u/__lemur",
            "created_utc": "04-30-2021 13:59:43",
            "distinguished": null,
            "edited": false,
            "id": "n1ziud",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Meta",
            "locked": false,
            "name": "t3_n1ziud",
            "nsfw": false,
            "num_comments": 62,
            "permalink": "/r/cscareerquestions/comments/n1ziud/a_study_found_that_brainteasers_were_not_a_good/",
            "score": 134,
            "selftext": "How many of you are still getting brain teasers during an interview?\n\nThere is a study on this topic. \n\n>> On the hiring side, we found that brainteasers are a complete waste of time... They don’t predict anything. They serve primarily to make the interviewer feel smart. (laszlo Bock, senior vice president of people operations at google, quoted in Bryant, 201\n\nPaper can be found [here](https://www.researchgate.net/profile/Scott-Highhouse/publication/327502211_Dark_Motives_and_Elective_Use_of_Brainteaser_Interview_Questions/links/5ff3243f92851c13feeb0e1a/Dark-Motives-and-Elective-Use-of-Brainteaser-Interview-Questions.pdf?origin=publication_detail)",
            "spoiler": false,
            "stickied": false,
            "title": "A study found that brainteasers were not a good way to measure job performance",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n1ziud/a_study_found_that_brainteasers_were_not_a_good/"
        },
        {
            "author": "u/Elaurora",
            "created_utc": "05-13-2021 12:37:34",
            "distinguished": null,
            "edited": false,
            "id": "nbkwfs",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nbkwfs",
            "nsfw": false,
            "num_comments": 51,
            "permalink": "/r/cscareerquestions/comments/nbkwfs/do_i_really_need_to_always_have_a_job/",
            "score": 32,
            "selftext": "I've been working remotely through the pandemic, saving the majority of my salary, and want to take some time away from having a job to just enjoy going and doing things for some indeterminate number of months. \n\nAs long as I give my company ample notice, leave respectably, don't burn any bridges, is there really any potential harm to my career as a whole for doing this ? Is there anything I should watch out for, or that I should be thinking about ?",
            "spoiler": false,
            "stickied": false,
            "title": "Do I really NEED to always have a job ?",
            "upvote_ratio": 0.88,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nbkwfs/do_i_really_need_to_always_have_a_job/"
        },
        {
            "author": "u/MurderousEquity",
            "created_utc": "05-31-2021 16:44:01",
            "distinguished": null,
            "edited": false,
            "id": "npcwhz",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_npcwhz",
            "nsfw": false,
            "num_comments": 18,
            "permalink": "/r/cscareerquestions/comments/npcwhz/what_does_a_first_day_on_the_job_look_like_in_the/",
            "score": 19,
            "selftext": "I start my graduate position in a week's time, I will be working from home for at least the first month, it seems so odd to start working in a place without going to the office. How has covid impacted recruitment and training of new staff in your own companies?",
            "spoiler": false,
            "stickied": false,
            "title": "What does a first day on the job look like in the covid era?",
            "upvote_ratio": 0.8,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/npcwhz/what_does_a_first_day_on_the_job_look_like_in_the/"
        },
        {
            "author": "u/International_Ad_179",
            "created_utc": "05-19-2021 21:50:30",
            "distinguished": null,
            "edited": false,
            "id": "ngnix4",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ngnix4",
            "nsfw": false,
            "num_comments": 45,
            "permalink": "/r/cscareerquestions/comments/ngnix4/what_would_be_the_absolute_least_stressful_job_i/",
            "score": 21,
            "selftext": "I have a disorder that has made it extremely difficult for me to keep up with the pace of the jobs I've had so far, and it has taken a toll on mental health. I'm now looking for a very slow paced job where there are not too many pressing deadlines. I don't want to sound lazy, but I honestly would like a job where I could spend a decent amount of my time doing nothing and nobody would really notice. I don't care about salary or working on anything super interesting, I would just like something that doesn't leave me completely burned out at the end of each day.\n\nAre there certain companies that are known to be low stress? Are there certain questions I could ask during an interview? Thank you.",
            "spoiler": false,
            "stickied": false,
            "title": "What would be the absolute least stressful job I could get with a CS degree?",
            "upvote_ratio": 0.79,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ngnix4/what_would_be_the_absolute_least_stressful_job_i/"
        },
        {
            "author": "u/fireasdfg",
            "created_utc": "04-03-2021 14:23:15",
            "distinguished": null,
            "edited": "04-03-2021 18:07:31",
            "id": "mje4tg",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mje4tg",
            "nsfw": false,
            "num_comments": 201,
            "permalink": "/r/cscareerquestions/comments/mje4tg/what_are_badly_paid_software_dev_jobs_like/",
            "score": 315,
            "selftext": "Software dev positions with salaries (far) below average for software devs (in a given geographical area), how are they different than the well paid positions? Are the expectations in terms of productivity lower? Are they aimed at people with worse skills, familiar with fewer technologies? Is the life-work balance better?\n\nEdit: thanks for the replies, they are truly eye-opening!",
            "spoiler": false,
            "stickied": false,
            "title": "What are badly paid software dev jobs like?",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mje4tg/what_are_badly_paid_software_dev_jobs_like/"
        },
        {
            "author": "u/stygian07",
            "created_utc": "05-24-2021 08:33:15",
            "distinguished": null,
            "edited": "05-24-2021 12:15:18",
            "id": "njwwgy",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_njwwgy",
            "nsfw": false,
            "num_comments": 36,
            "permalink": "/r/cscareerquestions/comments/njwwgy/bestfriend_offered_me_job_took_it_bad_at_it_hate/",
            "score": 18,
            "selftext": "So I'm back, clearly doing what someone in this subreddit told me not to do if I took the job. I just needed to get this out, maybe get some peoples opinions again.\n\nso basically here's [part 1](https://www.reddit.com/r/cscareerquestions/comments/hl78y1/best_friend_is_offering_me_a_job_i_know_im/) of this post, don't really need to read it as I'll give the jist of it but it does contain insights as to why I'm not really a good programmer and don't really enjoy this job...\n\nTechnical Manager/Solutions Architect Bestfriend offered to help me out, gave me months to prepare for a software engineering job. Originally he wanted me to get a sort of level 1-2 position. To be completely honest with myself, no amount of preparation was going to get me worthy of a MID to SENIOR position (even if he was able to pull the strings to do so) so I took the lowest one as a junior/associate SE.\n\nI got the job, doesn't pay great but I live alone and so the pay is more than enough for me to survive life and even spend a little on my hobbies. There was a 9 week paid bootcamp, comes with a 2 year bond though (I did not leave this out intentionally in the last thread, because the original plan was for me to take a mid level position which I hesitated), I passed that and was put into an ongoing sprint which is managed by my bestfriend (so basically another charity case by him) with a small team of 5 devs (including me) about 2 months ago.\n\nIt started okay, but the pressure was honestly there, I was completely blind at the start but I understood from most posts here that what I felt was normal, but here's comes the part that I hate. The job environment is tbh very chill, the people are good to me , they help me out but I'm just not really good at this, the previous sprint I did not sleep properly for 3 days just to keep up with the work load, I forgot to eat on most days, I would work for free through the night and weekends just to keep up with the deadlines and I assure you the things I'm working on doesn't even seem hard its just I suck... bad.\n\nI would ask help from my team but unless they spoonfed me, most explanations would go over my head and I always feel embarrassed whenever I force myself to ask them. My bestfriend would help me out on numerous occasions just for me to finish a couple of the work assigned to me and I really feel like he's sick and tired of it.\n\nBasically, I have to endure this for a year and a half more Unless I wanted to go AWOL, which I can't really afford. I keep begging my bestfriend to put me into support work, which is bug fixing but he says I would never grow there but I'm honestly just so tired of not having to sleep or eat just to keep up with these 2 week sprints. I feel like I am not ready for this and It's not like I even feel joy whenever I finish my work. There's absolutely no satisfaction here except for that twice a month paycheck.\n\nI'm really considering just begging people to take me out of the team, It would probably be a horrible idea to go into a division that doesn't offer growth but I just want to survive, I cant keep this up, I am a mess and I am so unhappy. I can endure this and pretend like I'm getting better but I think my team wouldn't appreciate their work getting blocked and looking bad infront of the client every time a sprint ends.\n\nIs this all worth it and I'm just too easy to give up? I don't remember the last time I was able to sleep a full 8 hours tbh.\n\nEdit: clarifications about the bootcamp and the bond that came with it.",
            "spoiler": false,
            "stickied": false,
            "title": "Bestfriend offered me job. took it. bad at it. Hate it.",
            "upvote_ratio": 0.8,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/njwwgy/bestfriend_offered_me_job_took_it_bad_at_it_hate/"
        },
        {
            "author": "u/shinyhero07",
            "created_utc": "04-27-2021 07:06:09",
            "distinguished": null,
            "edited": "04-27-2021 09:45:56",
            "id": "mzlz0j",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mzlz0j",
            "nsfw": false,
            "num_comments": 98,
            "permalink": "/r/cscareerquestions/comments/mzlz0j/i_suck_at_algorithms_how_do_i_study_for_them/",
            "score": 69,
            "selftext": "As the title mentions, I really suck at algorithms. I'm also working job with pretty long working hours and by the time I reach home, my brain is pretty much shut down.\n\nMy mornings are reserved for exercise but I still really want to get another job as I'm unhappy with my current one. I have weekends and an hour of being brain dead before I sleep on the weekdays to study for coding interviews. What is the best way to go about studying for coding interviews in this situation? Cram leetcode?\n\nHow can someone who sucks at algos become good enough to pass a technical interview?\n\nEdit: wow! Thanks for the tips! Seems like taking an algo course + cracking the coding interview + leetcode is the consensus",
            "spoiler": false,
            "stickied": false,
            "title": "I suck at algorithms. How do I study for them while holding a full time job?",
            "upvote_ratio": 0.88,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mzlz0j/i_suck_at_algorithms_how_do_i_study_for_them/"
        },
        {
            "author": "u/jbluntt",
            "created_utc": "04-21-2021 14:43:18",
            "distinguished": null,
            "edited": false,
            "id": "mvmdl0",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mvmdl0",
            "nsfw": false,
            "num_comments": 95,
            "permalink": "/r/cscareerquestions/comments/mvmdl0/did_my_employer_find_out_that_i_was_looking_for/",
            "score": 123,
            "selftext": "Around 3 weeks ago I updated my resume and started applying to a number of jobs. Then about 2 weeks later, HR at my current job calls me in and asks how I've been feeling about my work. She wonders how long I plan on staying and says they're hoping I have somewhat of a future here. \n\nShe then offers me a 12% raise and asks if I can hold off on sending out my resume for at least the rest of the year. I immediately assumed they figured out that I was job searching somehow. Also, 12% seems like a lot but really I was already getting paid fairly little which is why I started looking for new jobs.\n\nI pretty much agreed to her request since I was put on the spot, but I still think I could be making more elsewhere. However, I'm feeling a bit paranoid now and hesitant from applying to more jobs",
            "spoiler": false,
            "stickied": false,
            "title": "Did my employer find out that I was looking for new a job?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mvmdl0/did_my_employer_find_out_that_i_was_looking_for/"
        },
        {
            "author": "u/madsemo",
            "created_utc": "04-27-2021 23:38:44",
            "distinguished": null,
            "edited": "05-05-2021 10:56:44",
            "id": "n0627a",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_n0627a",
            "nsfw": false,
            "num_comments": 158,
            "permalink": "/r/cscareerquestions/comments/n0627a/400_web_dev_job_application_rejections_what_are/",
            "score": 21,
            "selftext": "Hello all,\n\nI graduated in August 2020 with a Bachelors Computer Science Degree. From August to January I looked for work and worked on personal projects 40 hours a week. In this time I also took advantage of the free Coursera courses and received 17 certificates! This included an 8 week React Course, which I enjoyed very much. Unfortunately all these efforts dont guarantee work. In this time I put in just under 400 job applications. I had only a handful of replies, and only 4 interviews. I was very surprised by the lack of responses considering I tailored each covered letter to nearly every job and wrote a thoughtful note. I had one offer and then was ghosted by them and tried multiple times to contact. Since January I have stopped looking altogether because I dont want to go down in a spiral of depression with the constant rejection. Instead I've been successfully trading crypto. Its really lifted my spirits and am considering looking for work again. I would like to know though, what are some other jobs I could get that might benefit from web dev experience? Or even just a Bachelor degree! At least $15 an hour would be good, *working from home*. Contract, permanent, temporary, I dont care. I just would like to land something, anything, (except Customer Assistance over the phone) it doesnt have to be related to web dev. \n\nThank you\n\nEdit: I updated my resume as all of you suggested. The alignment and spacing is still something I need to work on. It keeps changing depending on how its opened for some reason, so ignore that for now. It isn't complete because someone suggested to flesh out another project so I can add it. https://drive.google.com/file/d/1Etzmf7iFESFgi28jMg9DVDRD1p_N6I-y/view?usp=sharing",
            "spoiler": false,
            "stickied": false,
            "title": "400 web dev job application rejections, what are other non development roles I could go for?",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n0627a/400_web_dev_job_application_rejections_what_are/"
        },
        {
            "author": "u/dafad_ddu",
            "created_utc": "03-17-2021 16:26:06",
            "distinguished": null,
            "edited": "03-18-2021 12:32:12",
            "id": "m79rj1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_m79rj1",
            "nsfw": false,
            "num_comments": 200,
            "permalink": "/r/cscareerquestions/comments/m79rj1/i_finally_got_an_offer_for_a_real_software_dev_job/",
            "score": 1471,
            "selftext": "I can’t believe it, I’m so hyped... I hope this post is allowed. Just wanna vent it somewhere. \n\nI’m from a crappy town with no tech scene. I studied CS to get out of there, and latched onto the first real offer I got out of graduation, which took me to a massive company in Austin, TX. However, they lied about my responsibilities. They demanded a CS degree, interviewed me on my dev skills, and gave me the title “software developer,” but after I accepted the offer, they told me I would not be doing any dev work. I am doing basically glorified data entry. Haven’t written a single line of code, and I knew I couldn’t stay. This is a common complaint about this company, but I decided to roll the dice because I needed to leave. \n\nI brought up my concern extremely politely with my manager, but he turned it rude very fast, said something along the lines of “you’re 21, I don’t owe you shit.” I told HR about my concern, also very politely, but they said “oh wow, that sounds terrible, let’s organize a meeting...” and then ghosted my following 3 emails spread over 2 months. \n\nI was told that I MIGHT be switched to “something more dev focused” within TWO YEARS. That’s too long for me to let my skills rot, and when I asked if I could have it in writing, that’s when my manager turned rude to me. \n\nI’ve been using extra moments to interview with other companies, and I landed another offer at a company I already know about with a waaaay better culture, and I feel so relieved. They’re even covering my relocation expenses in the sign-on bonus. I have another final interview on Friday with another company that I wanna know my status about, but once I hear back from them, I’ll choose one of the offers and put in a two weeks’ notice. \n\nI will name and shame this company once I actually quit.",
            "spoiler": false,
            "stickied": false,
            "title": "I finally got an offer for a REAL software dev job",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m79rj1/i_finally_got_an_offer_for_a_real_software_dev_job/"
        },
        {
            "author": "u/Worldly_Pineapple_80",
            "created_utc": "05-06-2021 14:45:36",
            "distinguished": null,
            "edited": false,
            "id": "n6efnz",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Lead/Manager",
            "locked": false,
            "name": "t3_n6efnz",
            "nsfw": false,
            "num_comments": 51,
            "permalink": "/r/cscareerquestions/comments/n6efnz/unknowingly_took_a_job_that_will_stagnate_my/",
            "score": 57,
            "selftext": "Hey everyone. I'm a (formerly) lead developer based in the Rust Belt. Have about 12 years experience, skill wise I have had my hands all over the place. My last company went belly up due to the pandemic and earlier this year I started interviewing.\n\nWith remote jobs popping off, a whole new world was opened up for me with job opportunities. I got 5 offers since January. Some gave me close or near my low Rust Belt salary, or the benefits weren't great so I turned them down. Then I got an offer from a mid sized West Coast company (remote).\n\nThe job was for a mid level developer role and their salary was amazing for me, so I took it. But then I took the job and found out that the job itself is way beneath me skills wise.... and I haven't even wrote a single line of code in the 2 months I've been there. So here are my pros and cons:\n\nCons:\n\n- Haven't wrote any code, worried I will stagnate skills wise over time.\n\n- They mislead me, so not exactly hyped about that\n\n- Company is going through a transitionary period, a good number of people have left and been backfilled\n\nPros:\n\n- Pay is WAY more than I can get locally. For reference my friend works in my city as a senior dev and gets $40k less than I do for a tough dev job, while I tweak XML files and other easy stuff. Pay is also more than I got with other remote offers\n\n- Great benefits (unlimited PTO with 20 days minimum encouraged, employee perks, don't have to commute)\n\n- I like my coworkers and they like me\n\n- Low stress. No micromanagement, no one cares what schedule you work, job is a breeze, no panic attacks come deadline time. And best of all, NO DAILY STANDUPS OR SCRUM SHIT!!!\n\nSo I am thinking about just sticking it out for a year. After all the mental stress put on by the pandemic, I feel like I could use a year to work a low stress job and remove myself from the rat race, at least for awhile. However, I am worried that I will stagnate and not interview well in a year. I have no problem getting offers now, and I figure that down the line I can work on my Github and stuff again and get back up to speed.\n\nWhat do you think? Is it worth the risk this far into my career?",
            "spoiler": false,
            "stickied": false,
            "title": "Unknowingly took a job that will stagnate my skills, but it's low stress and the pay is amazing. Stick it out for a year?",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n6efnz/unknowingly_took_a_job_that_will_stagnate_my/"
        },
        {
            "author": "u/csengg1004",
            "created_utc": "05-17-2021 06:13:00",
            "distinguished": null,
            "edited": false,
            "id": "neccqc",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_neccqc",
            "nsfw": false,
            "num_comments": 29,
            "permalink": "/r/cscareerquestions/comments/neccqc/is_the_job_market_really_that_competitive_in/",
            "score": 32,
            "selftext": "I have been applying for jobs for a while now and I have sent out about 100 applications to companies in Netherlands, UK and Germany and I have received about 50 rejection emails (all generic ones stating that they've received too many applications and have better candidates), only 2 phone interviews and 2 coding assignments.\n\nI was under the impression that the job market is quite good for someone with experience and a master's degree.\n\nSome details about me: I am currently doing my masters in the Netherlands in Comp Sci (graduating in July) and I am a Non-EU citizen and I have about 3.5 years of work experience. I have been applying mostly to mid-sized tech companies (about 100-500 people) for primarily Front-End or Software Developer roles.\n\nAttaching my resume for reference [Resume](https://imgur.com/PMT5wP9)\n\nUsing a throwaway to remain anonymous.",
            "spoiler": false,
            "stickied": false,
            "title": "Is the job market really that competitive in Europe?",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/neccqc/is_the_job_market_really_that_competitive_in/"
        },
        {
            "author": "u/BakuraGorn",
            "created_utc": "03-09-2021 07:18:56",
            "distinguished": null,
            "edited": false,
            "id": "m158xp",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_m158xp",
            "nsfw": false,
            "num_comments": 291,
            "permalink": "/r/cscareerquestions/comments/m158xp/my_manager_went_through_hell_to_get_me_a/",
            "score": 1465,
            "selftext": "\nA little more context from title: last month I got a job offer from another company a bit bigger than my current employer, and it would double my salary. I talked to my manager and she insisted I listen to a counter offer, she threw numbers at me but they didn’t hit at least equal to the other offer, so I declined. She then escalated it to her manager, we talked and while he got closer to what I wanted, it wasn’t enough, so I stood my ground and opted to go to the new company. Then, he escalated things to HIS manager which is basically second to the CEO himself, and his manager finally offered me the same amount from the job offer, so I decided to stay and declined the job offer. \n\n\nFast forward to last week, I get an email from Big A stating that I passed the virtual on-site and they want to hire me. The salary they offered is almost 3 times the one I have right now, which is a lot, and obviously working in big tech will look great on my resume. There’s no way I can decline this, but I feel bad for making my employers scrape the bottom of the barrel to pay me what I thought as deserving, so how do I go about telling them I’ll leave anyway without burning any bridges?",
            "spoiler": false,
            "stickied": false,
            "title": "My manager went through hell to get me a promotion a month ago, but now I got a job offer in the big leagues. How do I talk do her?",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m158xp/my_manager_went_through_hell_to_get_me_a/"
        },
        {
            "author": "u/icePickposideon",
            "created_utc": "05-31-2021 03:08:55",
            "distinguished": null,
            "edited": false,
            "id": "noxb6l",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_noxb6l",
            "nsfw": false,
            "num_comments": 16,
            "permalink": "/r/cscareerquestions/comments/noxb6l/2_years_experience_do_i_look_for_junior_jobs/",
            "score": 11,
            "selftext": "I'm looking into parting ways with my current employer after 1.5 years. This is my first gig out of college, so this was very much an entry level/junior role.\n\n Now that I have close to 2 years under my belt, I'm not sure where I fit on the experience level totem pole. Do I literally type in Junior Software engineer into indeed and call it a day, or is there something more useful I can search that would fit my experience level. \n\nThanks in advance! \n\n(If it helps, I'd like to transition to full stack development.)",
            "spoiler": false,
            "stickied": false,
            "title": "~2 years experience. Do I look for junior jobs?",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/noxb6l/2_years_experience_do_i_look_for_junior_jobs/"
        },
        {
            "author": "u/AzusaNakajou",
            "created_utc": "03-05-2021 12:59:19",
            "distinguished": null,
            "edited": false,
            "id": "lyhsv6",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lyhsv6",
            "nsfw": false,
            "num_comments": 351,
            "permalink": "/r/cscareerquestions/comments/lyhsv6/looking_for_a_new_job_this_is_the_most_ridiculous/",
            "score": 1322,
            "selftext": "- (For some reason I have to put all text in bullet points or else the text becomes tiny)\n\n- I'm only at 1.5 YoE so I haven't seen much, but this was a real *fuck that* moment. The job is for jr(wtf) full stack at an agency-esque company, and their initial assessment is as follows with 48 hours to complete everything:\n\n\n1. The frontend of an ecommerce website (15 pages), each component with very specific instructions such as how they are animated and other effects or else you won't get assessed.\n\n2. Create a complete backend for a Twitter clone and support things that even Twitter doesn't support, include unit tests for everything.\n\n3. Build a fully functional stock market tracking system\n\n* None of the intermediate dev places I've applied to have even come close to having something like this, do people actually bother with places like this?",
            "spoiler": false,
            "stickied": false,
            "title": "Looking for a new job, this is the most ridiculous take home assessment I've ever seen.",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lyhsv6/looking_for_a_new_job_this_is_the_most_ridiculous/"
        },
        {
            "author": "u/Sippinonjoy",
            "created_utc": "05-05-2021 11:19:32",
            "distinguished": null,
            "edited": "05-05-2021 16:53:40",
            "id": "n5idvw",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_n5idvw",
            "nsfw": false,
            "num_comments": 60,
            "permalink": "/r/cscareerquestions/comments/n5idvw/how_long_after_your_career_started_did_you_land/",
            "score": 33,
            "selftext": "Title. I’m currently working my first post graduation job but it is not at all what I envisioned for my career. I’m unmotivated, frustrated, and I’m working in a business that I feel no passion for. I’m currently spending my free time to build my portfolio for my ideal job but I know it’s going to take some time.\n\nSo how long did it take you in your career to land your dream job?\n\nEdit: Holy shit now I’m depressed.",
            "spoiler": false,
            "stickied": false,
            "title": "How long after your career started did you land your “dream” job?",
            "upvote_ratio": 0.88,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n5idvw/how_long_after_your_career_started_did_you_land/"
        },
        {
            "author": "u/Capable-Ad8332",
            "created_utc": "03-13-2021 12:55:29",
            "distinguished": null,
            "edited": false,
            "id": "m4bgeq",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m4bgeq",
            "nsfw": false,
            "num_comments": 302,
            "permalink": "/r/cscareerquestions/comments/m4bgeq/other_than_not_having_income_is_something_wrong/",
            "score": 653,
            "selftext": "I see people post all the time that you should never quit a job without having another one lined up. The reasoning is usually sparse or nonexistent, and when present is usually \"why not keep earning income when you could be earning income!?\". \n\nWell, I've got enough in the bank to live without working for a few years. I'm no longer happy in my job and feel it's WAY more demanding and frustrating than it is worth. Whether or not that is true isn't my question, I've decided that it is true. So the \"stay to keep earning income\" thing just doesn't apply to me. I don't care about the income since I've decided it's a bad deal for me.\n\nAre there other solid reasons why I shouldn't just quit, take a couple months off to decompress, leetcode, and study and interview around?",
            "spoiler": false,
            "stickied": false,
            "title": "Other than not having income, is something wrong with quitting a job without having another one lined up?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m4bgeq/other_than_not_having_income_is_something_wrong/"
        },
        {
            "author": "u/HenesysMSEast",
            "created_utc": "05-25-2021 07:59:14",
            "distinguished": null,
            "edited": false,
            "id": "nknzv4",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_nknzv4",
            "nsfw": false,
            "num_comments": 27,
            "permalink": "/r/cscareerquestions/comments/nknzv4/should_i_apply_for_jobs_even_before_i_feel_im/",
            "score": 16,
            "selftext": "A little more background, I have the goal to get a “better” (higher paying) engineering job in a different city (looking to leave my city). \n\n- 4.0 College GPA\n- 3 years professional experience at my first job out of college\n- No personal projects (I built a portfolio website with react but have no projects to actually put on the portfolio website, so I don’t feel like including it)\n- Mostly front end angular experience. Our backend is dotnet core at work, but I almost never have to touch it\n- not very experienced with leetcode. Back in my college day, I aced data structures and algorithms, but that was years ago. If I hop on leetcode today, I can usually take a good stab at the “easy” questions \n\nSince I never really had to work on the backend, I’ve been brushing up on some dotnet core terminology, and I’m working through a MEAN stack course on udemy to get more exposure to full stack. \n\nA lot of my friends still tell me I’m talented enough to get a new job now and I should be sending out my resume and not worrying so much about my credentials. But only I know how talented I truly feel compared to college. And it sometimes feels like my basics have deteriorated some. Should I keep pushing through this course and grind leetcode some more, or also start sending out my resume and risk getting declined from companies that would perhaps accept me if I just practice a bit more? It’s worth noting that I don’t have a lot experience with tech interviews \n\nAny advice is appreciated, thanks",
            "spoiler": false,
            "stickied": false,
            "title": "Should I apply for jobs even before I feel I’m “ready”?",
            "upvote_ratio": 0.76,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nknzv4/should_i_apply_for_jobs_even_before_i_feel_im/"
        },
        {
            "author": "u/lewkerie",
            "created_utc": "03-17-2021 09:55:56",
            "distinguished": null,
            "edited": false,
            "id": "m70yha",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m70yha",
            "nsfw": false,
            "num_comments": 272,
            "permalink": "/r/cscareerquestions/comments/m70yha/how_much_of_a_salary_increase_would_it_take_for/",
            "score": 511,
            "selftext": "I'm in my first job out of college, and I've been here a little bit over year. I'm making around $71k a year, and I'm in the end of an interview process with a company that seems really cool. The type of work seems like it's exactly what I'm looking for, and it's got me thinking... How much of a salary increase would you need to take the new job if you were in my position? Since it's my first job out of college I'm not sure where the ballpark range should be.",
            "spoiler": false,
            "stickied": false,
            "title": "How much of a salary increase would it take for you to jump jobs?",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m70yha/how_much_of_a_salary_increase_would_it_take_for/"
        },
        {
            "author": "u/jaycarterhere",
            "created_utc": "05-15-2021 23:01:55",
            "distinguished": null,
            "edited": "05-16-2021 00:21:47",
            "id": "ndf0px",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ndf0px",
            "nsfw": false,
            "num_comments": 45,
            "permalink": "/r/cscareerquestions/comments/ndf0px/should_i_take_the_job_with_at_least_a_50k_raise/",
            "score": 12,
            "selftext": "I know this might seem like a straightforward \"duh\" answer, but I'd love some advice here. I'm looking at two job offers right now. One will give me a raise of only $10K initially. However; it comes with bonuses, benefits, and I'll no longer have to drive to an office. It's 100% remote work and won't change. My wife can stay in the job she's in, we don't have to move and my son will stay in his current school. He's 5 years old.\n\nThe second one would be at least a $50K raise. However, we would have to move to a new state. From Texas to Florida. The cost of living where we could move to would be a little higher. The new job offers no benefits at all. My wife would lose about $5K in her salary. We would probably just use her insurance from her new job to cover us all if she can secure a new position (teacher) I'd be back to driving about half an hour to forty-five minutes to the office and back each day.\n\nIf I were single, I'd jump right to Florida. However; I'm not sure if after everything is said and done if the 50K will be worth it. What would you do?\n\nEdit:\n1. 80K to 90K with full benefits, no move, fully remote. Bonuses could add an additional $15-25K.\n\nVs \n\n2. 80K to 130K with no benefits, moving, commuting, no bonuses. \n\nCurrently renting a home at 1600/m, to match what we have here we’d need to rent at least at 2200/m from what we’ve seen.",
            "spoiler": false,
            "stickied": false,
            "title": "Should I take the job with at least a 50K raise or the one with only a 10K raise?",
            "upvote_ratio": 0.66,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ndf0px/should_i_take_the_job_with_at_least_a_50k_raise/"
        },
        {
            "author": "u/JmCole19",
            "created_utc": "05-24-2021 12:34:32",
            "distinguished": null,
            "edited": false,
            "id": "nk23hg",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_nk23hg",
            "nsfw": false,
            "num_comments": 18,
            "permalink": "/r/cscareerquestions/comments/nk23hg/job_hunt_exhaustion/",
            "score": 22,
            "selftext": "I'm just here to rant, I'm so tired.  \n\n\nI'm tired of constantly applying and reaching out to people, only to be ghosted. I'm tired of all the interviews and meetings that seem to go well and then they disappear. I'm tired of wondering what I'm doing wrong.  \n\n\nI've been told that I struggle with the basics, I've been told that I did too much. I've had interviewers apologize for not communicating what they wanted and ending the interview process, even after my work met their requirements. I'm tired of being told that they'll definitely be making an offer, only to be asked for another assessment and then being rejected because the process took too long. I'm just so tired.  \n\n\nI'm working two part time jobs, I love both of them, but the hours are inconsistent, I'm labeled as a contractor, and some days I just don't do anything. I've even been asked to speak to incoming students at a local university, and I just don't know how to encourage them. I'm tired of feeling like I'm not good enough, or wondering if I'm just not capable. I am tired.\n\n&#x200B;\n\nFor any others out there feeling the way I do, take a moment, take a deep breath, and just remember not too push yourself too hard. I hope you find what you're looking for and I hope you are appreciated. I hope you are not as tired as I am.  \n\n\nP.S. If anyone wants to collaborate on a fun/stupid project, shoot me a message, if anyone wants to chat and get some feedback, again shoot me a message.   \n\n\nTL;DR: I am really, really tired.",
            "spoiler": false,
            "stickied": false,
            "title": "Job hunt exhaustion",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nk23hg/job_hunt_exhaustion/"
        },
        {
            "author": "u/InsideAspect",
            "created_utc": "04-08-2021 18:21:48",
            "distinguished": null,
            "edited": "04-09-2021 01:11:00",
            "id": "mn33mb",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_mn33mb",
            "nsfw": false,
            "num_comments": 81,
            "permalink": "/r/cscareerquestions/comments/mn33mb/got_my_first_job_out_of_college/",
            "score": 475,
            "selftext": "Graduated in December from a no-name university with no internships and barely any relevant job history. I started applying a month ago, ~30 applications later and today I accepted a position for $80k in a low COL area. Just posting to let others know that there is hope.\n\nAnd just for kicks - here's the [laziest response I got](https://i.imgur.com/pTUTccL.png)\n\n[My resume](https://i.imgur.com/5z2HdGp.png) is almost identical to the CTCI author's suggested template with some minor changes.\n\nFor me, what got me the job was knowing my design patterns and giving a strong interview. They weren't looking for a junior developer (and initially turned me down because of that) but my resume got me in the door and my interview secured it. My advice is to know your bottleneck and fix it. If you're dead set on FAANG that might be leetcode but if you want anything else it's probably not that. My interviews had a few leetcode-style questions but nothing above an easy-ish medium, the emphasis is very much on how well you can convey your thoughts and communicate with the interviewer.",
            "spoiler": false,
            "stickied": false,
            "title": "Got my first job out of college!",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mn33mb/got_my_first_job_out_of_college/"
        },
        {
            "author": "u/MukLukDuck",
            "created_utc": "06-02-2021 14:03:54",
            "distinguished": null,
            "edited": false,
            "id": "nqs1xr",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nqs1xr",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/cscareerquestions/comments/nqs1xr/unhappy_in_my_job_loved_my_cs_degree_but_not/",
            "score": 10,
            "selftext": "Hi everyone, I’m looking for some career advice. A few years back, I went back to school for a CS bachelor’s (already had a bachelors in an unrelated field) because I loved coding, and once I graduated I started a software development job. I’m now about 2 years into that job, 1 year with my current team. And I’m finding that the work itself just isn’t enjoyable. I loved my classes in school and really enjoyed the problem solving aspects, like my discrete math and data science classes, and solving my programming projects in general. But I feel like I don’t get to do that much coding at work; so much more of my time is spent on access requests, back and forth with QA, Agile ceremonies, release planning tasks, random infrastructure stuff that my team has to take on—I hate all that stuff. I spend maybe 10% of my time actually doing what I like. I also seriously hate production support. Like, would gladly take a pay cut to avoid doing it. I also don’t do well with full-time remote work, which we’ve transitioned to permanently, and we’ve been losing a lot of devs due to the fact that we’re undergoing a merger, so I’m having to take on projects that are way beyond my skill level and with that much stress, my mental health is in the toilet. \n\nIs this just what development work is like and I need to get over it? Or should I consider a pivot into another related field (and what might that be?)\n\nI would love any and all thoughts and suggestions! Thanks in advance!",
            "spoiler": false,
            "stickied": false,
            "title": "Unhappy in my job, loved my CS degree but not liking software development. Where to go from here?",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nqs1xr/unhappy_in_my_job_loved_my_cs_degree_but_not/"
        },
        {
            "author": "u/randomseller",
            "created_utc": "05-30-2021 08:12:44",
            "distinguished": null,
            "edited": false,
            "id": "no9x8q",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_no9x8q",
            "nsfw": false,
            "num_comments": 16,
            "permalink": "/r/cscareerquestions/comments/no9x8q/freelance_developers_are_you_happy_with_your_job/",
            "score": 7,
            "selftext": "I live in a not so rich country, currently studying as a software dev and since freelance devs can usually make a decent amount of money I am considering that option currently. I have started working over Upwork and had a few short jobs with salaries being from 12 to 15$/hour. This is in my opinion a incredible starting salary, when you take into consideration that i made about 5euro/hr at my last student job(which is not considered a bad salary here)... \n\nSo im just wondering if there are any freelance devs here and if they’re happy with their jobs? One od the downsides Ive noticed is that like 90% of the jobs are something along the lines of a Tinder clone or something like that, so I am afraid that it might not always be the most exiciting job out there? Would love to hear your thoughts and experiences, thanks!",
            "spoiler": false,
            "stickied": false,
            "title": "Freelance developers, are you happy with your job?",
            "upvote_ratio": 0.74,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/no9x8q/freelance_developers_are_you_happy_with_your_job/"
        },
        {
            "author": "u/SuccMyStrangerThings",
            "created_utc": "03-31-2021 06:36:19",
            "distinguished": null,
            "edited": false,
            "id": "mh3acy",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_mh3acy",
            "nsfw": false,
            "num_comments": 131,
            "permalink": "/r/cscareerquestions/comments/mh3acy/what_skillstech_stack_to_master_during_ms_cs_to/",
            "score": 380,
            "selftext": "I got an admit from USC for MS CS. I'm on cloud 9!! \n\nSo, pretty much the question. I will be looking for AI/DS related jobs. Which skills should I focus and dig deep into. I'm not much interested in SWE roles. \n\nI'm thinking: Python, Numpy, Pandas, Seaborn, Plotly, Tensorflow, Keras, MySQL, AWS, some JavaScript knowledge. \n\n\nIs this stack sufficient?",
            "spoiler": false,
            "stickied": false,
            "title": "What skills/tech stack to master during MS CS to get a job after graduation",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mh3acy/what_skillstech_stack_to_master_during_ms_cs_to/"
        },
        {
            "author": "u/Walker323818",
            "created_utc": "05-11-2021 22:54:01",
            "distinguished": null,
            "edited": false,
            "id": "naerzx",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_naerzx",
            "nsfw": false,
            "num_comments": 41,
            "permalink": "/r/cscareerquestions/comments/naerzx/is_it_hard_to_find_a_second_dev_job_as_the_first/",
            "score": 22,
            "selftext": "Hey everyone,\n\nI finished a coding bootcamp about a year ago and have been working professionally as a web developer for about 7 months. Getting my first job was a nightmare. I was wondering how easy it is getting the second now that I have some work experience.\n\nWould love to hear your feedback.",
            "spoiler": false,
            "stickied": false,
            "title": "Is it hard to find a second dev job as the first?",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/naerzx/is_it_hard_to_find_a_second_dev_job_as_the_first/"
        },
        {
            "author": "u/Fluxriflex",
            "created_utc": "05-31-2021 22:03:50",
            "distinguished": null,
            "edited": "06-01-2021 00:07:05",
            "id": "npj4v8",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_npj4v8",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/cscareerquestions/comments/npj4v8/i_only_enjoy_working_on_side_projects_that_i/",
            "score": 13,
            "selftext": "Hello, r/cscareerquestions.\nI'm a relatively new developer with about two years of experience under my belt at this point. I've worked previously for an insurance company that used some relatively new technologies (Azure Functions, .Net Core, AngularJS) but the subject matter was extremely boring. I currently work for a private consultancy firm in a long-term contract with the city government where I live. Despite how it sounds, the projects that we work on in the new job are much more interesting by comparison, however the design and technologies are a bit older (.NET MVC stuff)\n  \nWith both of my jobs, I've gotten burnt out and tired of working very shortly after starting. During that time, I've also had a handful of contacts reach out to have me build some small-scale web applications on the side, and I've found those to be *far* more engaging. There are times during my regular job where I feel like I hate coding, but the excitement I feel working on side projects has proved that theory wrong. I feel like I'd drop my current job in a heartbeat in favor of freelancing, but I don't have the network of potential clients in order for it to be a reliable source of income.\n  \nIs this a normal feeling? Is there something that I can do to make my actual job less dull? Has anyone switched from a job at a larger company to do freelance who can comment on this?  \n  \nThanks in advance!",
            "spoiler": false,
            "stickied": false,
            "title": "I only enjoy working on side projects that I setup from scratch; I can't stand my regular 9-5 job. Is this normal?",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/npj4v8/i_only_enjoy_working_on_side_projects_that_i/"
        },
        {
            "author": "u/aplenglow",
            "created_utc": "05-08-2021 21:49:52",
            "distinguished": null,
            "edited": "05-08-2021 23:04:40",
            "id": "n83rd9",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_n83rd9",
            "nsfw": false,
            "num_comments": 87,
            "permalink": "/r/cscareerquestions/comments/n83rd9/best_small_cities_for_tech_jobs_for_those_who_do/",
            "score": 6,
            "selftext": "I have been reading tons of other posts talking about tech hubs, but they all are from the POV of an urban dweller. I am from a small town in British Columbia, Canada and I am currently eyeing my options for places I might consider moving to when I finish my CS degree. \n I am looking for recommendations on places to live for those who dislike larger cities/dense urban living. \n\nEDIT -- I am not looking for small town living, but options for smaller, less dense cities. A possibility of eventually living out of town would be nice though -- \n\n- I would like a place with space, not super dense\n- dislike living in apartments\n- would like to be able to get out of the city easily/quickly into some natural areas\n- I am from Canada, so in the US I would be very politically left and would prefer to be in a more left state\n- I like outdoor sports.  I am not an adventure sport/skiing/biking/climbing junkie, but like reasonable access to nice areas to explore. \n- I drive a pickup and would like a lifestyle where I can keep my pickup\n- single and without kids, so pretty free to do as I wish\n- starting out as a junior software engineer \n\nI have been thinking of Seattle, Colorado Springs, Denver and Boulder as options. Thoughts?\n\nI love Portland but from what I can tell it is not the greatest city for finding tech jobs? Eugene seems great too, but lacking in tech jobs...",
            "spoiler": false,
            "stickied": false,
            "title": "Best small cities for tech jobs (for those who do not like urban living)? Low to medium COL?",
            "upvote_ratio": 0.75,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n83rd9/best_small_cities_for_tech_jobs_for_those_who_do/"
        },
        {
            "author": "u/tom2kk",
            "created_utc": "03-10-2021 03:50:02",
            "distinguished": null,
            "edited": false,
            "id": "m1t79y",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m1t79y",
            "nsfw": false,
            "num_comments": 375,
            "permalink": "/r/cscareerquestions/comments/m1t79y/ukeu_devs_that_moved_to_the_us_for_a_job_what/",
            "score": 422,
            "selftext": "What realisations did you come across when you removed the rose-tinted glasses?",
            "spoiler": false,
            "stickied": false,
            "title": "UK/EU devs that moved to the US for a job. What unforseen negatives did you find once you got there and started work?",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m1t79y/ukeu_devs_that_moved_to_the_us_for_a_job_what/"
        },
        {
            "author": "u/email_versioncontrol",
            "created_utc": "04-02-2021 11:28:11",
            "distinguished": null,
            "edited": false,
            "id": "mimn3t",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_mimn3t",
            "nsfw": false,
            "num_comments": 93,
            "permalink": "/r/cscareerquestions/comments/mimn3t/why_do_recruiters_do_this_to_people_looking_for/",
            "score": 455,
            "selftext": "I applied to same jobs online in the past month.  Two internal company recruiters got back to me asking for times that I am available for a zoom interview.  I replied back within the hour.\n\n\n\n\n\n\nAfter that, no response, even after emailing for a followup.  Why bother doing this to people looking for jobs?",
            "spoiler": false,
            "stickied": false,
            "title": "Why do recruiters do this to people looking for jobs?",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mimn3t/why_do_recruiters_do_this_to_people_looking_for/"
        },
        {
            "author": "u/Crowdsurfingbabies",
            "created_utc": "05-22-2021 15:35:02",
            "distinguished": null,
            "edited": false,
            "id": "niq8qx",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_niq8qx",
            "nsfw": false,
            "num_comments": 18,
            "permalink": "/r/cscareerquestions/comments/niq8qx/what_can_i_do_to_get_a_job_after_doing_nothing/",
            "score": 19,
            "selftext": "Hi, I graduated in 2016 or so with an Associate's degree in Web Development, focusing mostly on Java full stack.  After I graduated I guess I just sunk into depression and didn't really do anything with my life.  I took a single framework class at some point since then but other than that I just haven't even been able to get myself to program. It's not that I don't enjoy programming, I actually love it, I just couldn't get myself to work on projects or work up the confidence to apply for any internships.\n\n\n\nSo what can I do?  I know making a project would be good but I'm not sure if I can get myself to, even though I have an idea I'd actually like to make.  And even if I can get myself to do that, I don't think anybody will hire someone who hasn't done anything for 5 years after graduating.  It really feels like the only time in my life where I was doing anything is now a complete waste.",
            "spoiler": false,
            "stickied": false,
            "title": "What can I do to get a job after doing nothing for 5 years after graduating?",
            "upvote_ratio": 0.86,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/niq8qx/what_can_i_do_to_get_a_job_after_doing_nothing/"
        },
        {
            "author": "u/ronivec",
            "created_utc": "05-25-2021 12:53:19",
            "distinguished": null,
            "edited": false,
            "id": "nkue3p",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_nkue3p",
            "nsfw": false,
            "num_comments": 14,
            "permalink": "/r/cscareerquestions/comments/nkue3p/how_do_you_answer_why_do_you_want_to_relocate/",
            "score": 17,
            "selftext": "I'm from country X currently working in country Y in continent A. I recently started applying for jobs in continent B because I want to live in continent B for a while. \n\nI have a number of interviews scheduled in the coming days. One of these is a company which has 2 offices one in my own country and another one in another city in continent B. And I applied for a job in the second office. \n\nAre there any good answers to the question? My personal reasons are simply that I am a young single guy and I want to explore the world and live in different locations and experience different cultures while I'm young. \n\nBut I'm not sure if that is a good response. I've been asked this question once in the past but I'm not sure if I answered it in the best possible way. Any suggestions? Thanks!",
            "spoiler": false,
            "stickied": false,
            "title": "How do you answer, ' Why do you want to relocate?' when applying to jobs in foreign countries?",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nkue3p/how_do_you_answer_why_do_you_want_to_relocate/"
        },
        {
            "author": "u/tadpoleSquish",
            "created_utc": "05-29-2021 19:57:49",
            "distinguished": null,
            "edited": false,
            "id": "nnzakp",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nnzakp",
            "nsfw": false,
            "num_comments": 30,
            "permalink": "/r/cscareerquestions/comments/nnzakp/2021_grad_cant_find_a_job/",
            "score": 1,
            "selftext": "I'm a recent graduate with a Programming and Analysis degree. I only have my AS but I plan to get my BS in the future but decided to try to find work now as I will be studying online.\n\nI've applied to so many jobs already and have had nothing but rejections. Any advice?",
            "spoiler": false,
            "stickied": false,
            "title": "2021 grad can't find a job",
            "upvote_ratio": 0.57,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nnzakp/2021_grad_cant_find_a_job/"
        },
        {
            "author": "u/Stevenjgamble",
            "created_utc": "02-23-2021 07:33:49",
            "distinguished": null,
            "edited": false,
            "id": "lqhejo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_lqhejo",
            "nsfw": false,
            "num_comments": 487,
            "permalink": "/r/cscareerquestions/comments/lqhejo/how_the_fuck_can_bootcamps_like_codesmth_openly/",
            "score": 838,
            "selftext": "I censored the name because every mention of that bootcamp on this site comes with multi paragraph positive experiences with grads somehow making 150k after 3 months of study.\n\nThis whole thing is super fishy, and if you look through the bootcamp grad accounts on reddit, many comment exclusively postive things about these bootcamps.\n\nI get that some \"elite\" camps will find people likely to succeed and also employ disingenuous means to bump up their numbers, but allegedly every grad is getting hired at some senior level position?\n\nIs this hogwash? What kind of unscrupulous company would be so careless in their hiring process as to hire someone into a senior role without actually verifying their work history? \n\nIf these stories are true then is the bar for senior level programmers really that low? Is 3 months enough to soak in all the intricacies of skilled software development?\n\nAm I supposed to believe his when their own website is such dog water?\nWhat the fuck is going on here?",
            "spoiler": false,
            "stickied": false,
            "title": "How the fuck can bootcamps like codesm!th openly claim that grads are getting jobs as mid-level or senior software engineers?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lqhejo/how_the_fuck_can_bootcamps_like_codesmth_openly/"
        },
        {
            "author": "u/GojoPojo",
            "created_utc": "05-24-2021 19:31:41",
            "distinguished": null,
            "edited": false,
            "id": "nkbi3q",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nkbi3q",
            "nsfw": false,
            "num_comments": 19,
            "permalink": "/r/cscareerquestions/comments/nkbi3q/starting_a_new_job_as_a_full_stack_engineer_and/",
            "score": 10,
            "selftext": "I recently got offered a job as a Jr Full Stack Engineer for a Data engineering/ web API team. The list of qualifications is pretty long from understanding microservices, Azure Kubernetes Services, distributed caching, and continuous integration. I had a pleasant interview process and accepted the offer but I am worried that they will think I am a catfish or something because I have no experience with these technologies. I plan on studying the basics of all these things before my first day but does anyone have some recommendations on how to cram this knowledge? This would actually be my first time working on enterprise level applications and although I am really eager to learn and contribute, I am worried that I am way too far behind and I'll just get fired. Any tips?",
            "spoiler": false,
            "stickied": false,
            "title": "Starting a new job as a Full Stack Engineer and I'm not sure if I am qualified?",
            "upvote_ratio": 0.75,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nkbi3q/starting_a_new_job_as_a_full_stack_engineer_and/"
        },
        {
            "author": "u/Chatt_IT_Sys",
            "created_utc": "05-23-2021 07:18:10",
            "distinguished": null,
            "edited": false,
            "id": "nj5qtw",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_nj5qtw",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/cscareerquestions/comments/nj5qtw/first_day_first_week_first_month_of_new_job_any/",
            "score": 26,
            "selftext": "Pretty much sums it up in title. It's purposefully vague so it doesn't focus on a language or framework. But I would be sure that is one of the answers...to learn the stack and framework top to bottom. To clarify though in my case it's an analyst job with 1/2 time coding. Thanks and you people are awesome.",
            "spoiler": false,
            "stickied": false,
            "title": "First day; first week; first month of new job. Any advice? Best approach? Pro Tips? Thanks",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nj5qtw/first_day_first_week_first_month_of_new_job_any/"
        },
        {
            "author": "u/ThatRedChip",
            "created_utc": "05-20-2021 03:02:34",
            "distinguished": null,
            "edited": false,
            "id": "ngtc3g",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ngtc3g",
            "nsfw": false,
            "num_comments": 18,
            "permalink": "/r/cscareerquestions/comments/ngtc3g/should_i_quit_my_job_and_take_a_break/",
            "score": 19,
            "selftext": "Hi everyone,\n\nUsing an old throwaway account as my main account might get recognized by people, and sorry for the really long post.\n\nI'm a mid 20s software engineer based in South East Asia, and lately I've been feeling really depressed lately due to my job and the COVID situation in my country.\n\nA little background: \n\n* Started work straight out of university, been working for the same employer for 3 years now.\n* Been working from home since March 2020.\n* Initially thought of quitting this job last September, but since it's during the pandemic I've decided to stay longer due to not knowing what the job market will look like after I've quit.\n* Thought about quitting the job again around March of this year, but again put that idea o hold due to the pandemic in my country has been getting worse and worse as the year goes by.\n\nSometime around last week, I've suddenly feel a huge wave of negative emotions pouring onto me during work, i feel overwhelmed by work as there was some restructuring around my team and added a responsibility that mostly deals with the customer on top of doing new client request changes as well as bug fix etc. Most morning i would wake up and just feel really anxious opening up my work laptop, and throughout the workday i would feel mentally exhausted and stressed out. \n\nOutside of work, i would probably watch some Youtube videos, or play video games, read books, watch movies, doing online courses, or maybe play my musical instrument, but lately outside of work i just don't have the motivation to do anything listed there, I'll do an online course lesson halfway and just turn it off as i can't focus on that, same goes for anything thing else i suppose.\n\nI'm pretty sure i have a pretty standard case of burnout, and usually i can bounce back from that feeling with a bit of time, like during university whilst working on a pretty big and technically challenging project, i would feel burnout constantly, but after a day i would feel better and more motivated than ever to finish the project. But now after work, i would feel burnout but it just seems gets worse everyday.\n\nI am thinking of leaving this job since a year ago and wanting to do something else for my career (doing software engineering work in another company or industry, or maybe starting a small business). And during the break, i would probably use the time to first of all enjoy the NOW and stop feeling too anxious about the future, and brush up my skills as well as learning new skills like learning modern web frameworks and such. Maybe start to look for a new job after i feel better about myself and have a fresh mindset.\n\nI have about a year worth of my monthly salary saved up in my bank account, as well as some other liquid assets in some stocks, robo advisor, etc. My expenses are pretty low as I'm living with my family for the past year due to the pandemic.\n\nTL;DR: Burned out from work, and feeling depressed lately. Wanting to quit the job and take a break for some time to de stress and re-calibrate myself. \n\nSo what do you guys think? Should i quit my job now and take a break for 1-3 months? \n\nOr anyone with similar experience can share their thoughts here.",
            "spoiler": false,
            "stickied": false,
            "title": "Should i quit my job and take a break?",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ngtc3g/should_i_quit_my_job_and_take_a_break/"
        },
        {
            "author": "u/LordDIOXXI",
            "created_utc": "05-19-2021 18:33:42",
            "distinguished": null,
            "edited": false,
            "id": "ngja1y",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ngja1y",
            "nsfw": false,
            "num_comments": 22,
            "permalink": "/r/cscareerquestions/comments/ngja1y/searching_for_a_job_is_depressing/",
            "score": 15,
            "selftext": "I need help with finding a path into a cs job. I've been searching for a Software Engineering job for over a year now and not many replies at all. I have an associates in Computer Science and Analysis and I know most people are gonna recommend getting a bachelors but I can't really see myself going back to college after taking 4 years to finish a 2 year degree. Is there any way to make my Associates work? Going back to college is kind of an option but it's kind of a bullet I'm scared to bite.",
            "spoiler": false,
            "stickied": false,
            "title": "Searching for a job is depressing",
            "upvote_ratio": 0.86,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ngja1y/searching_for_a_job_is_depressing/"
        },
        {
            "author": "u/takeiteasyamigo",
            "created_utc": "05-24-2021 10:55:16",
            "distinguished": null,
            "edited": false,
            "id": "njztq2",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_njztq2",
            "nsfw": false,
            "num_comments": 21,
            "permalink": "/r/cscareerquestions/comments/njztq2/what_are_some_jobs_that_help_lead_to_a_software/",
            "score": 6,
            "selftext": "I'm having a hard time with recruiting, mostly due to lack of experience. Wondering if there was an easier job that I could look for to gain experience. \n\nFor example: \n\nBookkeeping helps land accounting jobs.\n\n&#x200B;\n\nJob search has been a struggle.",
            "spoiler": false,
            "stickied": false,
            "title": "What are some jobs that help lead to a software engineer role?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/njztq2/what_are_some_jobs_that_help_lead_to_a_software/"
        },
        {
            "author": "u/Kerak_Castle",
            "created_utc": "03-22-2021 11:10:15",
            "distinguished": null,
            "edited": false,
            "id": "mapu1z",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mapu1z",
            "nsfw": false,
            "num_comments": 200,
            "permalink": "/r/cscareerquestions/comments/mapu1z/is_this_sub_biased_towards_job_hunt_gloom_and/",
            "score": 251,
            "selftext": "I don’t want this to come off as a flex post but here goes: I and my friend circle graduated in May 2020. All but 1 of us is either working as a SWE or will be starting a SWE job soon. Just from talking to my friends, it doesn’t sound like any of them needed to send out the 200, 300, 400 applications many people on this sub claim. I like to think my friends and I are generally competent, but none of us are 4.0 GPA, multiple FAANG internship overachievers. 2 are URMs so maybe that helped a bit, but the others are straight white or Asian males and they didn’t have to send out 200 apps either. Are we all unicorns or is this sub biased?",
            "spoiler": false,
            "stickied": false,
            "title": "Is this sub biased towards job hunt “gloom and doom” or are most people really needing to send out 200+ applications to get 1 call back?",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mapu1z/is_this_sub_biased_towards_job_hunt_gloom_and/"
        },
        {
            "author": "u/Noiz-Eka",
            "created_utc": "05-31-2021 13:50:42",
            "distinguished": null,
            "edited": "06-01-2021 08:30:57",
            "id": "np94vo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_np94vo",
            "nsfw": false,
            "num_comments": 19,
            "permalink": "/r/cscareerquestions/comments/np94vo/ive_had_a_really_rough_time_finding_a_job_what/",
            "score": 2,
            "selftext": "Context:\n\nI am 19, I've been writing software for a while (since early middle school). I started off with C++, learned reverse engineering a bit, did graphics programming, UI development, etc. Around the end of highschool I realized that kind of work is \"specialized\", and really hard for a young guy with no degree to get a job with regardless of skill, so I started learning web development with VueJS, NodeJs, MongoDb, etc. I have been applying to anything on Indeed with the word \"intern\" or \"developer\" or \"web\" in it, and I've gotten 2 interviews so far in the last 2-3 months. First one was way out of my league (idk why they even bothered with me) and the second one, they interviewed me for an internship position that was already filled. Probably dodged a bullet there but anyways...\n\nI don't know what else I can be/should be doing, I just want to make money with the many skills I've worked hard to learn. I have a personal website/portfolio with a few projects on it ( here: [https://lunaranomaly.com](https://lunaranomaly.com/)), from there you are able to download my resume and a link to my github if you feel like reviewing it.\n\nI've also started trying to freelance (as of today, I re-made my [Freelancer.com](https://freelancer.com/) profile) and the kinds of jobs being posted on there are just, from what I can gather, either gatekept by the site itself or they are complete wastes of time; for instance, people wanting to hire someone to complete their coursework for them. It's obviously low quality, and low return. I also have done every step of creating an Upwork account besides upload a profile picture which I'll be doing tomorrow, once I get some sleep and don't look such a mess :P\n\nI've just been fed up lately, I don't know what to do or what I am doing wrong, which is why I am here.\n\nMy questions are:\n\nAm I advertising myself to the wrong people?\n\nAm I applying on the wrong websites (such as Indeed)?\n\nWhat am I mucking up?\n\nIts really hard for me to tell these things as I am only 19, and never had a dev job, so I lack the relevant experience to know what it is that I don't know.\n\nTL;DR: I've been trying to get a dev job for the last 2 months and I feel like I am shooting blanks with my resume/portfolio, not sure what the issue is but I know I am lacking something to attract employers.\n\nThank you for taking the time to read, and if you have any questions, advice, or critiques I will be very responsive to all and it would be \\*greatly\\* appreciated!\n\n\\-T  \n\n\nEDIT: I forgot to mention, I am pursuing a CS degree at UTD, I transferred from a community college so I will be starting my first semester at UTD this Fall. ",
            "spoiler": false,
            "stickied": false,
            "title": "I've had a really rough time finding a job. What can I do better, and what do I need to stop doing?",
            "upvote_ratio": 0.67,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/np94vo/ive_had_a_really_rough_time_finding_a_job_what/"
        },
        {
            "author": "u/ChanceRealistic",
            "created_utc": "04-29-2021 12:10:10",
            "distinguished": null,
            "edited": false,
            "id": "n17rkz",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_n17rkz",
            "nsfw": false,
            "num_comments": 45,
            "permalink": "/r/cscareerquestions/comments/n17rkz/my_company_lead_me_on_and_told_me_theyd_be/",
            "score": 43,
            "selftext": "Basically the title.\n\nI was offered a 3 month UX internship, with the possibility of full-time afterwards. The internship ends in 3 weeks. Just yesterday, my supervisor and even HR told me they'd definitely keep me on board after my internship ended. Today I got the news that they don't have the budget for a full time employee.\n\nAnd I don't feel like going back to work the next 3 weeks. I feel like I'd be better off spending these 3 weeks working on my portfolio and reading UX-related books.\n\nWhat should I do? Should I quit or stay? Help!",
            "spoiler": false,
            "stickied": false,
            "title": "My company lead me on and told me they'd be excited in offering me a full time job after my internship ended. Today they told me the don't have the budget for a full time job. Should I quit?",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n17rkz/my_company_lead_me_on_and_told_me_theyd_be/"
        },
        {
            "author": "u/newppcdude",
            "created_utc": "03-14-2021 10:09:13",
            "distinguished": null,
            "edited": false,
            "id": "m4vp3g",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m4vp3g",
            "nsfw": false,
            "num_comments": 193,
            "permalink": "/r/cscareerquestions/comments/m4vp3g/i_have_had_zero_code_reviews_in_a_year_and/",
            "score": 535,
            "selftext": "My major concern is I have no degree.\n\nMy job pays too little.\n\nZero code reviews\n\nI've literally learned everything by myself.\n\nNo senior dev guidance.\n\nNew project with another junior dev.\n\nI feel like I'm wading through mountains of shit.\n\nI'm growing increasingly unhappy and want to quit.\n\nI'm learning nothing. My code is messy and shitty and nobody is helping me fix it.\n\nI have a year of expenses saved.\n\nI can hustle really hard so I figured... if I can even get a couple clients at $30 an hour i can replace my job and be making more.\n\nSo my plan:\n\n1. Quit\n2. Work on open source 4-6 hours a day\n3. Rest of time trying to get clients.\n\nIf I don't get any work/clients within 6 months ill start Looking for another job.\n\nI feel like id be better off in terms of career growth focusing on open source since I'm learning fuck all at my job.\n\nThoughts?",
            "spoiler": false,
            "stickied": false,
            "title": "I have had zero code reviews in a year and working with only 1 other Jr dev. Should I quit to do open source while looking for another job?",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m4vp3g/i_have_had_zero_code_reviews_in_a_year_and/"
        },
        {
            "author": "u/jeesuscheesus",
            "created_utc": "03-19-2021 18:41:29",
            "distinguished": null,
            "edited": false,
            "id": "m8t6q3",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m8t6q3",
            "nsfw": false,
            "num_comments": 164,
            "permalink": "/r/cscareerquestions/comments/m8t6q3/mathheavy_software_development_jobs_i_like_math/",
            "score": 414,
            "selftext": "Hello. I'm only a second year student in computer science, but I enjoy the mathematics so far. Alongside machine learning and graphics programming, what are some other niches in the industry that heavily involve mathematics? Thank you.",
            "spoiler": false,
            "stickied": false,
            "title": "Math-heavy software development jobs? I like math.",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m8t6q3/mathheavy_software_development_jobs_i_like_math/"
        },
        {
            "author": "u/MrReeseisDead",
            "created_utc": "03-23-2021 06:30:24",
            "distinguished": null,
            "edited": "03-23-2021 23:57:00",
            "id": "mbbp92",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_mbbp92",
            "nsfw": false,
            "num_comments": 73,
            "permalink": "/r/cscareerquestions/comments/mbbp92/finally_got_a_job_offer_and_accepted_it_after/",
            "score": 1333,
            "selftext": "I have like documented my entire journey from May 2019, So this may be long to read.\n\n&#x200B;\n\n**Little Background**\n\n* I graduated from a reputed college in India in Computer Science in May 2019. I hated coding during college and never tried to focus on it. I felt overwhelmed in college due to the competitive environment there.\n* After May 2019, I had no idea what to do after graduation. I never sat for campus placements even though my college had a very nice record. At that time I didn't want to end up in this area.\n* 3 months passed by, I did nothing (I live with my parents) and was just home. Fortunately I had some good friends during college, who suggested me that there's still a chance that I can try to get in the field, If I start fresh, as there's no college pressure now and assured me that I can do it.\n* I was already familiar with python and spent like 2 months (Sept-Oct 2019) doing easy level and then medium level leetcode questions, 1 problem daily. (Focused on only Basic Arrays, strings, linked list and Tree questions).\n* Then my friend suggested me to try Flask, which led me to enroll in a course named Web programming with Python and JS (CS50 WEB) by Harvard University.\n* This course entirely changed my perspective, and was like a direction that lead me deeper in the web development area. I spent (Oct 2019 - Dec 2019) 2-3 months trying to finish this course at my own pace. \n* I already knew HTML and CSS before. Some stuff I learned through this course were Git, basic db stuff, Flask, Basic JS concepts, Django, dom manipulation, and concepts related to scaling, security etc.\n* So with this course, I created like 4 projects from scratch, some using Flask, and some using django. And I hosted this apps on Heroku. And then started applying for jobs(Jan 2020 - )\n* So initially I felt overwhelmed while applying, as I never interviewed before. But eventually coped up with it and kept applying and interviewing. I got very less interviews.\n\n**COVID period** \n\n* Then COVID came around March 2020 first week and it added to my already demotivated journey of job hunting.\n* During that time I learned Angular. And tried to revamp my previous projects (which were just static sites) with angular and I integrated them. During this time I learnt many new things about JS, I deeply learnt about how Web works, how Internet works, Networking concepts, HTTP, REST, OOPs and all the basic stuff.\n* So I had a pretty good idea about what kind of questions I should expect from an interview and I would prepare accordingly.\n* Around August 2020 last week, one of a no name angel list startup offered me an internship role for 2 months with a joke of stipend. As I was desperate and had no prior internship, I accepted this opportunity and spend two months remotely doing this internship.\n\n**Internship (Sept - Nov 2020)**\n\n* Even though there were like literally 5-6 people in the company, and I knew that I'm just a cheap labor in name of an intern, I tried to make most out of it, and learned many new things there as well. I had no regrets.\n* They even offered me Full time role, again with joke of a salary. But this time I declined, as there was no proper structure, no testing, nothing. And I had a feeling that I would now get a new job quickly but it wasn't like so.\n\n**After Internship (Nov 2020 - March 2021)**\n\n* So again I started applying. Usually I'd try to apply like 20 companies on a single day. Or some weeks I'd apply daily to like 4-5 companies.\n* From when I started tracking (from July 2020) of which companies I've applied to in Google sheets file, I've applied to around 250+ companies. I know that's a huge number of companies. It has come down to how good your resume is, and whether your cover letter is good enough.\n* Mostly from these applications I had potentially like 15 companies where I had gone through at least one round of hiring process seriously.\n* I had many phone screens as well, where sometimes the company didn't considered me a good fit, while other times it was vice versa.\n* And also I've been ghosted by many after interviews.\n* During this period, I have encountered mostly take-home tasks and very few leet code style screenings.\n* I would only do the take-homes If I feel that I'm not being used as a free labor. Also I had learnt about Nodejs during intern, So I would try to learn new stuff, and also try to create new projects. But mostly I would try to revamp or improve my existing ones.\n\n**Breakthrough**\n\n* So I came across the company (which is a well known startup in India) from which I got the offer. I came to know about this company in Feb 2021 when I saw a tweet from someone on my TL related to the company. So I went on their website and applied from there.\n* So I had like 4 rounds with them which lasted for almost a month\n   * Basic Technical Discussion\n   * Take home task -> Code Review + A Live task was given, to make an improvement in the code that I submitted.\n   * Another technical round (DS, Algorithms and System design questions)\n   * Final round with CTO (technical discussion type, cultural fit check)\n* I knew that all of my rounds went well and I had cleared all the rounds as HR informed me that they have positive feedback.\n* I usually try to avoid initiating salary discussion from my end and try my best to not give a number from my side, during initial phases.\n* After all rounds were over they then asked me about the expected CTC. So I was prepared for that, I had already researched on glassdoor like what the company provides to same role in the same location. Now I had this range with me which I needed to mention when asked.\n* So I quoted for a salary range that I never would have even thought about an year before. I was undervaluing myself very much to like almost half of what I quoted.\n* They accepted my quoted range and offer me the lower bound one. I wanted to play safe as I had no other offers, but even though I tried asking if there's any room for increment. HR said they might need to discuss internally. When they shared the letter, it was more than what they initially offered and I was happy with that.\n\n**Some thoughts/ Approaches that I followed**\n\n* I am from India, so there might be some different approaches in reaching out to companies as this sub is mostly US based. Mostly I've applied through Indeed, Linked In, sometimes through angel list and through any leads I could get. I even try to get list of some good companies and would literally apply on their career section. Obviously I didn't aim for any FAANG. I just wanted to enter in the industry with average salary (that doesn't mean you aim low).\n* Although this approach has very less success. One advice I got was to get referrals from your network. But I didn't try getting referrals as I was kind of shy in asking (big mistake and setback for me). \n* I prepared a Google keep, where I stored all the links to blogs, concepts, articles which I could refer to before interview. My intern role was more frontend based, but I tried to learn backend as well and would apply for Full Stack roles. So this was kind of slow down factor, and I believed that I should have just focused on one of them. \n* Before an interview, I say this to myself that it's nothing but a discussion, and no one is gonna judge me.\n* Most difficult thing when an interview begins is to answer the question \"Tell Me about yourself?\". Your answer to this question would be like a foundation for how your rest of the interview is gonna be.\n   *  And I know when you have a gap and no prior experience, it kind of becomes awkward answering that.\n   * I would begin describing my graduation year and major.\n   * What I did after college, how would I utilize my time, which technologies I learnt.\n   * What's the most recent experience I had, If any.\n* I knew that I have drastically improved my communication skills over this period. And I added that to my advantage.\n* I would always try to be humble when interviewing, and would always speak softly. If I didn't know about something, I would simply say that I'm not aware about that and might have to look. Or I would politely ask them If they could tell me the answer (depends on situation).\n* Reverse interview questions are important and you definitely need to ask interviewer questions at the end, to standout from others. Questions should be interesting and should be framed in a way that can make the interviewer more attentive towards you.\n* After every interview,  I would note about which things I wasn't able to answer in a doc file, so I wouldn't miss that next time.\n* There were times were I felt burn out and demotivated. So it's okay to take a break and one should know when to take them.\n* I have been an active member on this subreddit since I started job searching, also I followed some cool people on tech twitter, which were helpful in some way or other.\n* At last, I'm satisfied with what I have presently, and the wait and journey was worth it.\n\n&#x200B;\n\n&#x200B;\n\n**TL;DR**\n\n\n* Began my job hunting journey from scratch after my graduation in CS.\n* No prior Internships.\n* Built projects during the time.\n* Landed an internship in a small startup. They offered full time, but I declined.\n* Started job search again.\n* 250+ applications.\n* Got an offer I never would have imagined one year before.\n\n**PS**\n\n\n* This post was meant for motivating others who are on the same boat. If someone like me could do this, you definitely can.\n* I won't mention the company name or my college name as I prefer to be anonymous on reddit.\n*  I don't want to directly reveal the CTC as well but for those people who are asking me, its closer to the lower bound of 10-15 LPA range",
            "spoiler": false,
            "stickied": false,
            "title": "Finally got a job offer and accepted it, after almost 1+ year of Job hunting!",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mbbp92/finally_got_a_job_offer_and_accepted_it_after/"
        },
        {
            "author": "u/SteadfastPooper",
            "created_utc": "05-15-2021 07:36:29",
            "distinguished": null,
            "edited": false,
            "id": "ncww08",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_ncww08",
            "nsfw": false,
            "num_comments": 21,
            "permalink": "/r/cscareerquestions/comments/ncww08/question_for_hiring_managers_uk_graduate_using/",
            "score": 23,
            "selftext": "So I have had an 'almost' job offer from the company that I did my final year project with, they have already gotten a picture of me to do client stuff with, and have said for me to talk to them on Monday to finalise things, told me I wont need an interview, and the position isn't being offered to anyone else, and already told me the day they want me to start. So although I don't have an official offer from them yet Its pretty darn close.\n\nNow I don't want the job, and in order to not let them down I want to find a new one asap before my start date in 7 weeks. I have [read online](https://www.monster.com/career-advice/article/should-i-share-offer-details-with-other-opportunity-quora-vicki-salemi) that telling hiring managers about my current offer in the other jobs ill be interviewing for will help my case, as it shows employability.\n\nWhat I'm trying to figure out is if I can stop progress with the company that has offered me a job (verbally but non contractually), save myself and them a lot of time and effort, and then just tell a white lie to the new interviewers and say I already have a job offer, and get that same leverage (as I near as dammit do have the offer, just not in paper) Or will a situation come up where the new potential employer says 'Oh okay if you have been offered a job then prove it by showing us the contract'?\n\nIf the latter then I need to continue the pantomime with the old company until they give me the offer letter, It will be a let down for them, more work for me, but at the end of the day I 100% want to be able to use this job offer as leverage, so if that means I need an offer letter then thats what I have to do. If the former and I can get away with a harmless white lie (because I basically do have the offer), then it saves a load of effort with no harm done. But I want to hear the opinion of hiring managers before I do anything stupid or anything that could be considered mal practice.",
            "spoiler": false,
            "stickied": false,
            "title": "Question for hiring managers - UK Graduate - Using job offer from one company as leverage to get a job from another - do I need to prove this to new employer with signed contract?",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ncww08/question_for_hiring_managers_uk_graduate_using/"
        },
        {
            "author": "u/weekendshiftjob",
            "created_utc": "03-07-2021 16:33:27",
            "distinguished": null,
            "edited": false,
            "id": "m008u8",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_m008u8",
            "nsfw": false,
            "num_comments": 174,
            "permalink": "/r/cscareerquestions/comments/m008u8/ten_year_anniversary_of_a_enjoyable_job_with_a/",
            "score": 1091,
            "selftext": "This month marks the ten year anniversary of my job with a unique shift. I work as an on demand remote DBA who works Fri-Sun 7AM-7PM and I get the other four days off.  I also get great benefits like 7 weekends of vacation which amounts to 2 months of vacation if I take them separately with my shift. I picked up and explored many hobbies due to my shift giving me all the free time. I'm trying to ride this job out as long as I can.",
            "spoiler": false,
            "stickied": false,
            "title": "Ten year anniversary of a enjoyable job with a unique shift",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m008u8/ten_year_anniversary_of_a_enjoyable_job_with_a/"
        },
        {
            "author": "u/wellhelloeverybody",
            "created_utc": "05-18-2021 10:38:45",
            "distinguished": null,
            "edited": false,
            "id": "nfcdhc",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_nfcdhc",
            "nsfw": false,
            "num_comments": 28,
            "permalink": "/r/cscareerquestions/comments/nfcdhc/person_i_referred_with_less/",
            "score": 19,
            "selftext": "Hi there! I work for a Financial Services company as a Senior Business Analyst in the IT department. I previously worked at a different company in the Financial Services industry in the same role in the EPMO department. \n\nI started at my current company in January 2020. I referred my previous coworker (through my current company's referral app, so her application is tied to my name) to apply for my same exact job (we have several openings). Her and I both started in our roles at the previous company within 2 months of each other. We both have unrelated bachelors degrees, I have an MBA and the CBAP certification. (Like the PMP for Business Analysts). \n\nIn her initial interview, the HR representative quoted her a salary range that, at a minimum is like $30 more per year than I'm currently making, and at its maximum is 20k more than I am currently making. If she were to receive an offer for more than I am making, it would bother me knowing that as I have more education and more tenure with the company with otherwise completely equal experience. (Literally our previous company and position and the types of projects we worked on were the exact same). \n\nIs it reasonable to try to request a pay increase based on this information should she accept an offer at a higher salary than me? They should not be surprised that I know her offer details as I am her referring employee and they legally cannot prevent us from discussing pay. That just seems ridiculous to me that they'd pay a new hire with less qualifications more than someone who has been there for over a year. However, I don't know if this is considered a legitimate reason for asking for a pay raise. We are in the process of waiting on our FY 21 performance reviews and I anticipate getting our highest rating. I consistently get great feedback from my peers and superiors. \n\n&#x200B;\n\nThanks for your help!",
            "spoiler": false,
            "stickied": false,
            "title": "Person I referred with less education/certifications, identical previous experience being quoted a salary range for my exact same job that higher than what I am making. Advice...",
            "upvote_ratio": 0.79,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/nfcdhc/person_i_referred_with_less/"
        },
        {
            "author": "u/Madler84",
            "created_utc": "03-31-2021 19:39:48",
            "distinguished": null,
            "edited": false,
            "id": "mhipv7",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_mhipv7",
            "nsfw": false,
            "num_comments": 53,
            "permalink": "/r/cscareerquestions/comments/mhipv7/graduate_this_may_and_i_just_accepted_a_job_offer/",
            "score": 858,
            "selftext": "I’ll start by saying I’m older, I’m 37. I will graduate this May from an Engineering School. None of my job history is in tech. I was a grunt in the army for 5 years and then worked as a research analyst in the oil industry for about 10 years. I am married and have 2 kids. \n\nI received an offer about a month ago to work for a contractor of the government basically just doing documentation but had strong potential with career growth. However my commute would be long and I would have to wake up at 430am just to be on time.\n\nHowever, now I just received a job offer from my number one choice where I will be a Software Developer for a Fortune 500 company. It took many interviews and assessments along with an extensive background check. But I got it and now I have to let the other job know I will not be starting with them next month.\n\nWith all that said my questions are:\nHow do I tell the first offer I accepted I will not be joining them anymore?\n\nHow do I avoid feeling imposter syndrome at this big corporation where there are 100s of software developers?\n\nAny tips on how to prepare for my role outside of “knowing the languages the company uses”?",
            "spoiler": false,
            "stickied": false,
            "title": "Graduate this May and I just accepted a Job Offer!",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mhipv7/graduate_this_may_and_i_just_accepted_a_job_offer/"
        },
        {
            "author": "u/tatravels",
            "created_utc": "03-08-2021 10:34:57",
            "distinguished": null,
            "edited": "03-13-2021 12:07:20",
            "id": "m0i7w1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m0i7w1",
            "nsfw": false,
            "num_comments": 211,
            "permalink": "/r/cscareerquestions/comments/m0i7w1/first_cs_job_starts_monday_tips_for_a_strong_start/",
            "score": 636,
            "selftext": "Finally locked in my first CS job (thank you for the help with my resume!). I also negotiated up my salary thanks to [content](https://haseebq.com/my-ten-rules-for-negotiating-a-job-offer/) shared here.\n\nI want to hit the ground running and I figured there may be certain questions I could ask, actions I could take/start, or items I should add to my to-do list.\n\nAny tips?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nEdit: Here are my key take-aways...\n\n&#x200B;\n\n* Document everything / take notes: Write down task processes, onboarding processes, Git flows, all items that required access/permissions (write down the access point of contact, as well), all software / dependencies / etc, all the jargon that doesn't make sense. Turn the onboarding process and access/permissions list into a document that they can use for the next hires.\n* Spend time meeting your co-workers and find the ones who are happy to help.\n* Expect to suck and don't be afraid to ask questions (only after spending 30-60 mins of trying to answer it yourself. And take notes on your attempts).\n* Ask for 3 and 6 months expectations.  Schedule a 30-60-90 day check in.\n* Put the extra effort in within the first month (AKA putting in more than 40 hours or studying more at home). I plan to ask if it's ok if I go over 40hrs/wk in the first month, then go back to aiming for \\~40 after that\n* Aim to make a commit within first week or two (can be to README or clarifying comment etc). Good to learn Git flow and good for first impression. Ask for a review of commit first.\n* Don't step on dogs and also punch a Senior dev in the face.",
            "spoiler": false,
            "stickied": false,
            "title": "First CS job starts Monday. Tips for a strong start?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m0i7w1/first_cs_job_starts_monday_tips_for_a_strong_start/"
        },
        {
            "author": "u/CSCareerThrowaway737",
            "created_utc": "04-26-2021 14:01:27",
            "distinguished": null,
            "edited": false,
            "id": "mz3rv9",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mz3rv9",
            "nsfw": false,
            "num_comments": 39,
            "permalink": "/r/cscareerquestions/comments/mz3rv9/found_out_my_team_is_hiring_an_old_boss_i_had/",
            "score": 70,
            "selftext": "tl;dr: boss I made a HR complaint at (that was acted on) one of my old jobs is being hired at a role senior to me at my new job, I only found out after they extended an offer. What're my options?\n\nThrowaway for very obvious reasons. I'm fuzzing the details a little bit, also for obvious reasons. \n\nOnly seniors and above are in the interview loop in my company, and I'm mid level. I've been here 2.5 years and this is a new change. \n\nOld boss \"inherited\" me at my old job when my first boss left. We never got along before that. Since we worked together at a huge company he did a lot of bureaucratic things to try and \"manage me out,\" like reassign all my work to his other other reports, then write me up for not doing as much as them. There was also definitely a racial component to it because we're different races and he only hired people of his race. \n\nRight around then, I went on FMLA leave because my mother had a stroke. When I came back he had a PIP written up for me, so that plus the racial stuff prompted me to go to HR and amp up my job hunt. I found out he was smack talking me to other people, too. On one of my interviews, the interviewer said \"we don't have use for people who decide to just take six months off because they can't handle the pace.\" This was almost the exact same wording he used, and LinkedIn searching showed me they went to the same school, same major, and same graduating class. I took this to HR and they formally disciplined him, and I saved those emails. \n\nI only found out he was hired today, because during our sprint planning the team lead announced he accepted an offer for a senior engineer role and we marked off some tine to onboard him. \n\nSo what do I do? My boss loves me, I'm scheduled for a promotion, and I have enough savings to sustain a year+ long job hunt, and I have a pretty good resume. But I really have no idea how to bring this to my boss.",
            "spoiler": false,
            "stickied": false,
            "title": "Found out my team is hiring an old boss I had made HR complaints against at an old job. What do I do?",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mz3rv9/found_out_my_team_is_hiring_an_old_boss_i_had/"
        },
        {
            "author": "u/echoaj24",
            "created_utc": "04-28-2021 12:44:27",
            "distinguished": null,
            "edited": false,
            "id": "n0j2wr",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_n0j2wr",
            "nsfw": false,
            "num_comments": 26,
            "permalink": "/r/cscareerquestions/comments/n0j2wr/my_experience_3_months_into_my_first_swe_job_out/",
            "score": 99,
            "selftext": "**Job Title:** \"Jr. Software Engineer in Test\"\n\n**Background:** Technically I am not a developer, I test the functionality of the software that developers write although I do write code here and there for my tests.  My company is small, around 60 employes and has been in business for 23 years.  They make tracking devices for construction vehicles, care centers, hospitals, maritime, and more. This is my first real job out of college in an actual tech company.  It's a fast-paced agile environment. \n\n**Week 1:** Trainings, creating accounts, settings up my development environment, installing OS and user apps on my hardware device.  My first week was super stressful because everything was very new to me, I was lacking basic hardware and networking knowledge, and it was hard to adapt.\n\n**Week 2:** After getting everything set up, I was mostly learning how to use Jira, running a simple test, and recording results.  It was the most chill week as I was doing basic stuff.\n\n**Week 3 - 7:** A test engineer on a different project put in his 2 weeks notice (he was the only tester on that project) so I had to learn everything about that project and take it over while working on the other project.  Created many test cases for both projects and executed them.  The work was always stressful, long hours, but I was able to kinda handle it.\n\n**Week 8 - 9:** As I was struggling with the first 2 projects, a HW engineer come up to me, says he is going on vacation, and gives me a 30 min confusing tutorial on the work I must get done the next day for testing the cell module FW.  The following week I had to set up an FTP server and perform some functional tests to do related to cell module FW that was also very hard to do.  These were the highest priority tests according to the program manager, lots of pressure, and stress.  Friday of the last week was my breaking point when the program manager came to work all pissed off, we had a stressful meeting and he was assigning more shit to do for another project I had.  Things I had no idea what to do.   The stress at this point was insane and was on the day I had to turn in the document of whether I will stay and continue working with them or not.  I could not sign.\n\n**Week 9 - 11:** On Monday I formally resigned to my higher-ups. They gave me fewer tasks to do since I was leaving and was only working on one project. The work was a lot easier and I was not stressed out.  On the 2nd to last day, I gave my test team and others gifts to leave off on a good note and to thank them for teaching me.\n\n**Summary:** There were some good moments during this job but a lot of bad moments.  Overall I always felt stressed out and especially during weeks 8 and 9, the stress was unbearable, to the point where I was crying every day after work, thinking how the hell am I going to survive here.  There was even one point where I was crying at my desk and the senior engineer took me outside to talk to me and calm me down.  I couldn't learn anything, was getting really bad brain fog, and could not retain information.  I literally had to tape-record everything I did and play it back later to remember.  My brain was not performing properly and this had never happened to me before.  The decision to leave my first job out of college 3 months in was the hardest decision of my life.  The amount of failure and guilt I felt for leaving my team behind was unbearable.   Everyone (besides the CEO who would yell at people every day) was overall cool and good people, especially my test team.  I thought to myself \"if this is how it's like as jr during my probation period, how is going to be like 6 months from now?\"  My desire to be a software engineer was being killed.  I figured things will not get any better and I had to make this choice, for my mental health, and career.  Now I have to start all over again finding a job but at least I had the courage to leave and do what is right for me.",
            "spoiler": false,
            "stickied": false,
            "title": "My experience 3 months into my first SWE job out of college.",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n0j2wr/my_experience_3_months_into_my_first_swe_job_out/"
        },
        {
            "author": "u/freefallingmonkey",
            "created_utc": "04-28-2021 14:37:05",
            "distinguished": null,
            "edited": false,
            "id": "n0lkqy",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_n0lkqy",
            "nsfw": false,
            "num_comments": 19,
            "permalink": "/r/cscareerquestions/comments/n0lkqy/finally_found_another_job_after_3_years/",
            "score": 183,
            "selftext": "I’ve been stuck at my first job out of college for 3 years. I’ve been passively looking and failing interviews throughout that time, but I finally landed another role! I would like to thank this sub for allowing me a place to vent and giving advice. \n\nHopefully this new job will not be a total s**t show, but only time will tell.",
            "spoiler": false,
            "stickied": false,
            "title": "Finally found another job after 3 years!",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/n0lkqy/finally_found_another_job_after_3_years/"
        }
    ],
    "subreddit_rules": {
        "rules": [
            {
                "created_utc": "02-23-2017 19:19:24",
                "description": "All posts in /r/cscareerquestions must be related to computer science careers or working in the tech industry. Non-career college-related questions like \"Which school should I go to?\" belong in /r/csmajors.",
                "kind": "link",
                "priority": 0,
                "short_name": "Posts must be related to careers in computer science or the tech industry.",
                "violation_reason": "Post is not related to career in computer science"
            },
            {
                "created_utc": "02-23-2017 19:23:04",
                "description": "Before posting, the post author should make an effort to do their own research, check our [FAQ](https://www.reddit.com/r/cscareerquestions/wiki/index), search the subreddit, and provide details as part of their question. Low effort questions or posts will be removed.",
                "kind": "link",
                "priority": 1,
                "short_name": "Posts must show thought, effort, and research.",
                "violation_reason": "Post is low-effort"
            },
            {
                "created_utc": "02-23-2017 19:25:52",
                "description": "Some topics in /r/cscareerquestions are restricted to rotating sticky threads. If you make a post about those topics, it may be removed and you may be redirected to the stickied thread. Full list of topics and sticky schedule can be found [here](https://www.reddit.com/r/cscareerquestions/wiki/index).",
                "kind": "link",
                "priority": 2,
                "short_name": "Some questions belong in daily stickied threads.",
                "violation_reason": "Post belongs in a daily stickied thread"
            },
            {
                "created_utc": "02-23-2017 19:28:08",
                "description": "Posts which attempt to collect a large amount of data (such as salary-sharing threads or \"homework assignments\" meant to learn about careers in CS) or links to off-site surveys are generally not allowed in /r/cscareerquestions. Please contact the mods for more information.",
                "kind": "link",
                "priority": 3,
                "short_name": "Survey or data-collecting posts require mod approval.",
                "violation_reason": "Post is a survey of some kind"
            },
            {
                "created_utc": "02-23-2017 19:29:12",
                "description": "Promotional or advertising content regarding a person, service, or website must go in the monthly stickied thread on the first Sunday of each month. All other promotional comments or posts will be removed.",
                "kind": "all",
                "priority": 4,
                "short_name": "Promotional or advertising threads are only allowed in the monthly stickied threads.",
                "violation_reason": "Promotional or ad content outside of the monthly thread stickied thread"
            },
            {
                "created_utc": "02-23-2017 19:30:41",
                "description": "Be human, don't be a jerk. All posts and comments should be polite and professional. Egregious offenses will get you banned.",
                "kind": "all",
                "priority": 5,
                "short_name": "Trolling or being a jerk is not allowed.",
                "violation_reason": "Post or comment is mean or trolly"
            },
            {
                "created_utc": "02-23-2017 19:33:06",
                "description": "Posts in /r/cscareerquestions should either contain a question, or contain substantial content worthy of discussion. No rants, stories, links without context, or one-liners are allowed.",
                "kind": "link",
                "priority": 6,
                "short_name": "Posts must contain a question or foster discussion.",
                "violation_reason": "Post is not a question or discussion"
            },
            {
                "created_utc": "02-23-2017 19:35:21",
                "description": "Comments in /r/cscareerquestions are required to be relevant to the post/discussion.",
                "kind": "comment",
                "priority": 7,
                "short_name": "Comments should be on-topic.",
                "violation_reason": "Comment is significantly off-topic"
            },
            {
                "created_utc": "02-23-2017 19:36:34",
                "description": "Comments in /r/cscareerquestions should be polite, professional, and helpful.",
                "kind": "comment",
                "priority": 8,
                "short_name": "Comments should be professional and helpful.",
                "violation_reason": "Comment is unprofessional"
            },
            {
                "created_utc": "05-21-2019 17:33:18",
                "description": "If you have questions relating to the subreddit, such as having your posts removed, use ModMail to contact the moderators. Do not directly PM any moderator. Messages sent to /r/cscareerquestions will be sent to ModMail.",
                "kind": "all",
                "priority": 9,
                "short_name": "Use ModMail instead of PMing moderators if you have issues.",
                "violation_reason": "Use ModMail instead of PMing moderators if you have issues."
            },
            {
                "created_utc": "03-17-2020 18:36:19",
                "description": "Name & Shames should be for corporate behavior that is blatantly dishonest/unethical, illegal, or exceptionally shitty. Non-exceptional Name & Shame posts will be removed and redirected to Glassdoor, the Daily Chat thread, or the Friday Rant thread.",
                "kind": "link",
                "priority": 10,
                "short_name": "Name & Shames are only for behavior that is blatantly unethical, illegal, or exceptionally shitty.",
                "violation_reason": "Name & Shames are only for behavior that is blatantly unethical, illegal, or exceptionally shitty."
            }
        ],
        "post_requirements": {
            "title_regexes": [],
            "body_blacklisted_strings": [],
            "title_blacklisted_strings": [],
            "body_text_max_length": null,
            "title_required_strings": [],
            "guidelines_text": "Posts in /r/cscareerquestions should be about careers in Computer Science/the tech industry, should be detailed, and should contain specific questions or content that fosters discussion. One-liners will be removed.",
            "gallery_min_items": null,
            "domain_blacklist": [],
            "domain_whitelist": [],
            "title_text_max_length": null,
            "body_restriction_policy": "required",
            "link_restriction_policy": "none",
            "guidelines_display_policy": null,
            "body_required_strings": [],
            "title_text_min_length": null,
            "gallery_captions_requirement": "none",
            "is_flair_required": false,
            "gallery_max_items": null,
            "gallery_urls_requirement": "none",
            "body_regexes": [],
            "link_repost_age": null,
            "body_text_min_length": null
        }
    }
}