{
    "scrape_settings": {
        "subreddit": "cscareerquestions",
        "category": "search",
        "n_results_or_keywords": "job",
        "time_filter": "year"
    },
    "data": [
        {
            "author": "u/smooth_ducky",
            "created_utc": "03-21-2021 18:05:49",
            "distinguished": null,
            "edited": false,
            "id": "ma7ejz",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ma7ejz",
            "num_comments": 482,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/ma7ejz/in_order_to_get_a_pulse_on_the_junior_03_yoe/",
            "score": 523,
            "selftext": "Has COVID actually affected anything, or is the market similar to what it was in 17-18-19?\n\nI'm landing interviews here and there, but I'm wondering how competitive a given position is right now. If you're interviewing with company A at the moment, is the competition for that spot tougher than it was a couple years ago?",
            "spoiler": false,
            "stickied": false,
            "title": "In order to get a pulse on the junior (0-3 YoE) level job market: How has job hunting been for y'all?",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ma7ejz/in_order_to_get_a_pulse_on_the_junior_03_yoe/"
        },
        {
            "author": "u/dafad_ddu",
            "created_utc": "03-17-2021 16:26:06",
            "distinguished": null,
            "edited": "03-18-2021 12:32:12",
            "id": "m79rj1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_m79rj1",
            "num_comments": 205,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m79rj1/i_finally_got_an_offer_for_a_real_software_dev_job/",
            "score": 1452,
            "selftext": "I can’t believe it, I’m so hyped... I hope this post is allowed. Just wanna vent it somewhere. \n\nI’m from a crappy town with no tech scene. I studied CS to get out of there, and latched onto the first real offer I got out of graduation, which took me to a massive company in Austin, TX. However, they lied about my responsibilities. They demanded a CS degree, interviewed me on my dev skills, and gave me the title “software developer,” but after I accepted the offer, they told me I would not be doing any dev work. I am doing basically glorified data entry. Haven’t written a single line of code, and I knew I couldn’t stay. This is a common complaint about this company, but I decided to roll the dice because I needed to leave. \n\nI brought up my concern extremely politely with my manager, but he turned it rude very fast, said something along the lines of “you’re 21, I don’t owe you shit.” I told HR about my concern, also very politely, but they said “oh wow, that sounds terrible, let’s organize a meeting...” and then ghosted my following 3 emails spread over 2 months. \n\nI was told that I MIGHT be switched to “something more dev focused” within TWO YEARS. That’s too long for me to let my skills rot, and when I asked if I could have it in writing, that’s when my manager turned rude to me. \n\nI’ve been using extra moments to interview with other companies, and I landed another offer at a company I already know about with a waaaay better culture, and I feel so relieved. They’re even covering my relocation expenses in the sign-on bonus. I have another final interview on Friday with another company that I wanna know my status about, but once I hear back from them, I’ll choose one of the offers and put in a two weeks’ notice. \n\nI will name and shame this company once I actually quit.",
            "spoiler": false,
            "stickied": false,
            "title": "I finally got an offer for a REAL software dev job",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m79rj1/i_finally_got_an_offer_for_a_real_software_dev_job/"
        },
        {
            "author": "u/lewkerie",
            "created_utc": "03-17-2021 09:55:56",
            "distinguished": null,
            "edited": false,
            "id": "m70yha",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m70yha",
            "num_comments": 279,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m70yha/how_much_of_a_salary_increase_would_it_take_for/",
            "score": 505,
            "selftext": "I'm in my first job out of college, and I've been here a little bit over year. I'm making around $71k a year, and I'm in the end of an interview process with a company that seems really cool. The type of work seems like it's exactly what I'm looking for, and it's got me thinking... How much of a salary increase would you need to take the new job if you were in my position? Since it's my first job out of college I'm not sure where the ballpark range should be.",
            "spoiler": false,
            "stickied": false,
            "title": "How much of a salary increase would it take for you to jump jobs?",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m70yha/how_much_of_a_salary_increase_would_it_take_for/"
        },
        {
            "author": "u/BakuraGorn",
            "created_utc": "03-09-2021 07:18:56",
            "distinguished": null,
            "edited": false,
            "id": "m158xp",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_m158xp",
            "num_comments": 296,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m158xp/my_manager_went_through_hell_to_get_me_a/",
            "score": 1445,
            "selftext": "\nA little more context from title: last month I got a job offer from another company a bit bigger than my current employer, and it would double my salary. I talked to my manager and she insisted I listen to a counter offer, she threw numbers at me but they didn’t hit at least equal to the other offer, so I declined. She then escalated it to her manager, we talked and while he got closer to what I wanted, it wasn’t enough, so I stood my ground and opted to go to the new company. Then, he escalated things to HIS manager which is basically second to the CEO himself, and his manager finally offered me the same amount from the job offer, so I decided to stay and declined the job offer. \n\n\nFast forward to last week, I get an email from Big A stating that I passed the virtual on-site and they want to hire me. The salary they offered is almost 3 times the one I have right now, which is a lot, and obviously working in big tech will look great on my resume. There’s no way I can decline this, but I feel bad for making my employers scrape the bottom of the barrel to pay me what I thought as deserving, so how do I go about telling them I’ll leave anyway without burning any bridges?",
            "spoiler": false,
            "stickied": false,
            "title": "My manager went through hell to get me a promotion a month ago, but now I got a job offer in the big leagues. How do I talk do her?",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m158xp/my_manager_went_through_hell_to_get_me_a/"
        },
        {
            "author": "u/Capable-Ad8332",
            "created_utc": "03-13-2021 12:55:29",
            "distinguished": null,
            "edited": false,
            "id": "m4bgeq",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m4bgeq",
            "num_comments": 305,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m4bgeq/other_than_not_having_income_is_something_wrong/",
            "score": 653,
            "selftext": "I see people post all the time that you should never quit a job without having another one lined up. The reasoning is usually sparse or nonexistent, and when present is usually \"why not keep earning income when you could be earning income!?\". \n\nWell, I've got enough in the bank to live without working for a few years. I'm no longer happy in my job and feel it's WAY more demanding and frustrating than it is worth. Whether or not that is true isn't my question, I've decided that it is true. So the \"stay to keep earning income\" thing just doesn't apply to me. I don't care about the income since I've decided it's a bad deal for me.\n\nAre there other solid reasons why I shouldn't just quit, take a couple months off to decompress, leetcode, and study and interview around?",
            "spoiler": false,
            "stickied": false,
            "title": "Other than not having income, is something wrong with quitting a job without having another one lined up?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m4bgeq/other_than_not_having_income_is_something_wrong/"
        },
        {
            "author": "u/AzusaNakajou",
            "created_utc": "03-05-2021 12:59:19",
            "distinguished": null,
            "edited": false,
            "id": "lyhsv6",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lyhsv6",
            "num_comments": 360,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lyhsv6/looking_for_a_new_job_this_is_the_most_ridiculous/",
            "score": 1313,
            "selftext": "- (For some reason I have to put all text in bullet points or else the text becomes tiny)\n\n- I'm only at 1.5 YoE so I haven't seen much, but this was a real *fuck that* moment. The job is for jr(wtf) full stack at an agency-esque company, and their initial assessment is as follows with 48 hours to complete everything:\n\n\n1. The frontend of an ecommerce website (15 pages), each component with very specific instructions such as how they are animated and other effects or else you won't get assessed.\n\n2. Create a complete backend for a Twitter clone and support things that even Twitter doesn't support, include unit tests for everything.\n\n3. Build a fully functional stock market tracking system\n\n* None of the intermediate dev places I've applied to have even come close to having something like this, do people actually bother with places like this?",
            "spoiler": false,
            "stickied": false,
            "title": "Looking for a new job, this is the most ridiculous take home assessment I've ever seen.",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lyhsv6/looking_for_a_new_job_this_is_the_most_ridiculous/"
        },
        {
            "author": "u/Kerak_Castle",
            "created_utc": "03-22-2021 11:10:15",
            "distinguished": null,
            "edited": false,
            "id": "mapu1z",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mapu1z",
            "num_comments": 207,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/mapu1z/is_this_sub_biased_towards_job_hunt_gloom_and/",
            "score": 243,
            "selftext": "I don’t want this to come off as a flex post but here goes: I and my friend circle graduated in May 2020. All but 1 of us is either working as a SWE or will be starting a SWE job soon. Just from talking to my friends, it doesn’t sound like any of them needed to send out the 200, 300, 400 applications many people on this sub claim. I like to think my friends and I are generally competent, but none of us are 4.0 GPA, multiple FAANG internship overachievers. 2 are URMs so maybe that helped a bit, but the others are straight white or Asian males and they didn’t have to send out 200 apps either. Are we all unicorns or is this sub biased?",
            "spoiler": false,
            "stickied": false,
            "title": "Is this sub biased towards job hunt “gloom and doom” or are most people really needing to send out 200+ applications to get 1 call back?",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mapu1z/is_this_sub_biased_towards_job_hunt_gloom_and/"
        },
        {
            "author": "u/tom2kk",
            "created_utc": "03-10-2021 03:50:02",
            "distinguished": null,
            "edited": false,
            "id": "m1t79y",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m1t79y",
            "num_comments": 379,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m1t79y/ukeu_devs_that_moved_to_the_us_for_a_job_what/",
            "score": 421,
            "selftext": "What realisations did you come across when you removed the rose-tinted glasses?",
            "spoiler": false,
            "stickied": false,
            "title": "UK/EU devs that moved to the US for a job. What unforseen negatives did you find once you got there and started work?",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m1t79y/ukeu_devs_that_moved_to_the_us_for_a_job_what/"
        },
        {
            "author": "u/jeesuscheesus",
            "created_utc": "03-19-2021 18:41:29",
            "distinguished": null,
            "edited": false,
            "id": "m8t6q3",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m8t6q3",
            "num_comments": 167,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m8t6q3/mathheavy_software_development_jobs_i_like_math/",
            "score": 413,
            "selftext": "Hello. I'm only a second year student in computer science, but I enjoy the mathematics so far. Alongside machine learning and graphics programming, what are some other niches in the industry that heavily involve mathematics? Thank you.",
            "spoiler": false,
            "stickied": false,
            "title": "Math-heavy software development jobs? I like math.",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m8t6q3/mathheavy_software_development_jobs_i_like_math/"
        },
        {
            "author": "u/MrReeseisDead",
            "created_utc": "03-23-2021 06:30:24",
            "distinguished": null,
            "edited": "03-23-2021 23:57:00",
            "id": "mbbp92",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_mbbp92",
            "num_comments": 69,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/mbbp92/finally_got_a_job_offer_and_accepted_it_after/",
            "score": 1293,
            "selftext": "I have like documented my entire journey from May 2019, So this may be long to read.\n\n&#x200B;\n\n**Little Background**\n\n* I graduated from a reputed college in India in Computer Science in May 2019. I hated coding during college and never tried to focus on it. I felt overwhelmed in college due to the competitive environment there.\n* After May 2019, I had no idea what to do after graduation. I never sat for campus placements even though my college had a very nice record. At that time I didn't want to end up in this area.\n* 3 months passed by, I did nothing (I live with my parents) and was just home. Fortunately I had some good friends during college, who suggested me that there's still a chance that I can try to get in the field, If I start fresh, as there's no college pressure now and assured me that I can do it.\n* I was already familiar with python and spent like 2 months (Sept-Oct 2019) doing easy level and then medium level leetcode questions, 1 problem daily. (Focused on only Basic Arrays, strings, linked list and Tree questions).\n* Then my friend suggested me to try Flask, which led me to enroll in a course named Web programming with Python and JS (CS50 WEB) by Harvard University.\n* This course entirely changed my perspective, and was like a direction that lead me deeper in the web development area. I spent (Oct 2019 - Dec 2019) 2-3 months trying to finish this course at my own pace. \n* I already knew HTML and CSS before. Some stuff I learned through this course were Git, basic db stuff, Flask, Basic JS concepts, Django, dom manipulation, and concepts related to scaling, security etc.\n* So with this course, I created like 4 projects from scratch, some using Flask, and some using django. And I hosted this apps on Heroku. And then started applying for jobs(Jan 2020 - )\n* So initially I felt overwhelmed while applying, as I never interviewed before. But eventually coped up with it and kept applying and interviewing. I got very less interviews.\n\n**COVID period** \n\n* Then COVID came around March 2020 first week and it added to my already demotivated journey of job hunting.\n* During that time I learned Angular. And tried to revamp my previous projects (which were just static sites) with angular and I integrated them. During this time I learnt many new things about JS, I deeply learnt about how Web works, how Internet works, Networking concepts, HTTP, REST, OOPs and all the basic stuff.\n* So I had a pretty good idea about what kind of questions I should expect from an interview and I would prepare accordingly.\n* Around August 2020 last week, one of a no name angel list startup offered me an internship role for 2 months with a joke of stipend. As I was desperate and had no prior internship, I accepted this opportunity and spend two months remotely doing this internship.\n\n**Internship (Sept - Nov 2020)**\n\n* Even though there were like literally 5-6 people in the company, and I knew that I'm just a cheap labor in name of an intern, I tried to make most out of it, and learned many new things there as well. I had no regrets.\n* They even offered me Full time role, again with joke of a salary. But this time I declined, as there was no proper structure, no testing, nothing. And I had a feeling that I would now get a new job quickly but it wasn't like so.\n\n**After Internship (Nov 2020 - March 2021)**\n\n* So again I started applying. Usually I'd try to apply like 20 companies on a single day. Or some weeks I'd apply daily to like 4-5 companies.\n* From when I started tracking (from July 2020) of which companies I've applied to in Google sheets file, I've applied to around 250+ companies. I know that's a huge number of companies. It has come down to how good your resume is, and whether your cover letter is good enough.\n* Mostly from these applications I had potentially like 15 companies where I had gone through at least one round of hiring process seriously.\n* I had many phone screens as well, where sometimes the company didn't considered me a good fit, while other times it was vice versa.\n* And also I've been ghosted by many after interviews.\n* During this period, I have encountered mostly take-home tasks and very few leet code style screenings.\n* I would only do the take-homes If I feel that I'm not being used as a free labor. Also I had learnt about Nodejs during intern, So I would try to learn new stuff, and also try to create new projects. But mostly I would try to revamp or improve my existing ones.\n\n**Breakthrough**\n\n* So I came across the company (which is a well known startup in India) from which I got the offer. I came to know about this company in Feb 2021 when I saw a tweet from someone on my TL related to the company. So I went on their website and applied from there.\n* So I had like 4 rounds with them which lasted for almost a month\n   * Basic Technical Discussion\n   * Take home task -> Code Review + A Live task was given, to make an improvement in the code that I submitted.\n   * Another technical round (DS, Algorithms and System design questions)\n   * Final round with CTO (technical discussion type, cultural fit check)\n* I knew that all of my rounds went well and I had cleared all the rounds as HR informed me that they have positive feedback.\n* I usually try to avoid initiating salary discussion from my end and try my best to not give a number from my side, during initial phases.\n* After all rounds were over they then asked me about the expected CTC. So I was prepared for that, I had already researched on glassdoor like what the company provides to same role in the same location. Now I had this range with me which I needed to mention when asked.\n* So I quoted for a salary range that I never would have even thought about an year before. I was undervaluing myself very much to like almost half of what I quoted.\n* They accepted my quoted range and offer me the lower bound one. I wanted to play safe as I had no other offers, but even though I tried asking if there's any room for increment. HR said they might need to discuss internally. When they shared the letter, it was more than what they initially offered and I was happy with that.\n\n**Some thoughts/ Approaches that I followed**\n\n* I am from India, so there might be some different approaches in reaching out to companies as this sub is mostly US based. Mostly I've applied through Indeed, Linked In, sometimes through angel list and through any leads I could get. I even try to get list of some good companies and would literally apply on their career section. Obviously I didn't aim for any FAANG. I just wanted to enter in the industry with average salary (that doesn't mean you aim low).\n* Although this approach has very less success. One advice I got was to get referrals from your network. But I didn't try getting referrals as I was kind of shy in asking (big mistake and setback for me). \n* I prepared a Google keep, where I stored all the links to blogs, concepts, articles which I could refer to before interview. My intern role was more frontend based, but I tried to learn backend as well and would apply for Full Stack roles. So this was kind of slow down factor, and I believed that I should have just focused on one of them. \n* Before an interview, I say this to myself that it's nothing but a discussion, and no one is gonna judge me.\n* Most difficult thing when an interview begins is to answer the question \"Tell Me about yourself?\". Your answer to this question would be like a foundation for how your rest of the interview is gonna be.\n   *  And I know when you have a gap and no prior experience, it kind of becomes awkward answering that.\n   * I would begin describing my graduation year and major.\n   * What I did after college, how would I utilize my time, which technologies I learnt.\n   * What's the most recent experience I had, If any.\n* I knew that I have drastically improved my communication skills over this period. And I added that to my advantage.\n* I would always try to be humble when interviewing, and would always speak softly. If I didn't know about something, I would simply say that I'm not aware about that and might have to look. Or I would politely ask them If they could tell me the answer (depends on situation).\n* Reverse interview questions are important and you definitely need to ask interviewer questions at the end, to standout from others. Questions should be interesting and should be framed in a way that can make the interviewer more attentive towards you.\n* After every interview,  I would note about which things I wasn't able to answer in a doc file, so I wouldn't miss that next time.\n* There were times were I felt burn out and demotivated. So it's okay to take a break and one should know when to take them.\n* I have been an active member on this subreddit since I started job searching, also I followed some cool people on tech twitter, which were helpful in some way or other.\n* At last, I'm satisfied with what I have presently, and the wait and journey was worth it.\n\n&#x200B;\n\n&#x200B;\n\n**TL;DR**\n\n\n* Began my job hunting journey from scratch after my graduation in CS.\n* No prior Internships.\n* Built projects during the time.\n* Landed an internship in a small startup. They offered full time, but I declined.\n* Started job search again.\n* 250+ applications.\n* Got an offer I never would have imagined one year before.\n\n**PS**\n\n\n* This post was meant for motivating others who are on the same boat. If someone like me could do this, you definitely can.\n* I won't mention the company name or my college name as I prefer to be anonymous on reddit.\n*  I don't want to directly reveal the CTC as well but for those people who are asking me, its closer to the lower bound of 10-15 LPA range",
            "spoiler": false,
            "stickied": false,
            "title": "Finally got a job offer and accepted it, after almost 1+ year of Job hunting!",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mbbp92/finally_got_a_job_offer_and_accepted_it_after/"
        },
        {
            "author": "u/newppcdude",
            "created_utc": "03-14-2021 10:09:13",
            "distinguished": null,
            "edited": false,
            "id": "m4vp3g",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m4vp3g",
            "num_comments": 197,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m4vp3g/i_have_had_zero_code_reviews_in_a_year_and/",
            "score": 523,
            "selftext": "My major concern is I have no degree.\n\nMy job pays too little.\n\nZero code reviews\n\nI've literally learned everything by myself.\n\nNo senior dev guidance.\n\nNew project with another junior dev.\n\nI feel like I'm wading through mountains of shit.\n\nI'm growing increasingly unhappy and want to quit.\n\nI'm learning nothing. My code is messy and shitty and nobody is helping me fix it.\n\nI have a year of expenses saved.\n\nI can hustle really hard so I figured... if I can even get a couple clients at $30 an hour i can replace my job and be making more.\n\nSo my plan:\n\n1. Quit\n2. Work on open source 4-6 hours a day\n3. Rest of time trying to get clients.\n\nIf I don't get any work/clients within 6 months ill start Looking for another job.\n\nI feel like id be better off in terms of career growth focusing on open source since I'm learning fuck all at my job.\n\nThoughts?",
            "spoiler": false,
            "stickied": false,
            "title": "I have had zero code reviews in a year and working with only 1 other Jr dev. Should I quit to do open source while looking for another job?",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m4vp3g/i_have_had_zero_code_reviews_in_a_year_and/"
        },
        {
            "author": "u/Stevenjgamble",
            "created_utc": "02-23-2021 07:33:49",
            "distinguished": null,
            "edited": false,
            "id": "lqhejo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_lqhejo",
            "num_comments": 497,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lqhejo/how_the_fuck_can_bootcamps_like_codesmth_openly/",
            "score": 836,
            "selftext": "I censored the name because every mention of that bootcamp on this site comes with multi paragraph positive experiences with grads somehow making 150k after 3 months of study.\n\nThis whole thing is super fishy, and if you look through the bootcamp grad accounts on reddit, many comment exclusively postive things about these bootcamps.\n\nI get that some \"elite\" camps will find people likely to succeed and also employ disingenuous means to bump up their numbers, but allegedly every grad is getting hired at some senior level position?\n\nIs this hogwash? What kind of unscrupulous company would be so careless in their hiring process as to hire someone into a senior role without actually verifying their work history? \n\nIf these stories are true then is the bar for senior level programmers really that low? Is 3 months enough to soak in all the intricacies of skilled software development?\n\nAm I supposed to believe his when their own website is such dog water?\nWhat the fuck is going on here?",
            "spoiler": false,
            "stickied": false,
            "title": "How the fuck can bootcamps like codesm!th openly claim that grads are getting jobs as mid-level or senior software engineers?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lqhejo/how_the_fuck_can_bootcamps_like_codesmth_openly/"
        },
        {
            "author": "u/weekendshiftjob",
            "created_utc": "03-07-2021 16:33:27",
            "distinguished": null,
            "edited": false,
            "id": "m008u8",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_m008u8",
            "num_comments": 178,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m008u8/ten_year_anniversary_of_a_enjoyable_job_with_a/",
            "score": 1088,
            "selftext": "This month marks the ten year anniversary of my job with a unique shift. I work as an on demand remote DBA who works Fri-Sun 7AM-7PM and I get the other four days off.  I also get great benefits like 7 weekends of vacation which amounts to 2 months of vacation if I take them separately with my shift. I picked up and explored many hobbies due to my shift giving me all the free time. I'm trying to ride this job out as long as I can.",
            "spoiler": false,
            "stickied": false,
            "title": "Ten year anniversary of a enjoyable job with a unique shift",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m008u8/ten_year_anniversary_of_a_enjoyable_job_with_a/"
        },
        {
            "author": "u/tatravels",
            "created_utc": "03-08-2021 10:34:57",
            "distinguished": null,
            "edited": "03-13-2021 12:07:20",
            "id": "m0i7w1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m0i7w1",
            "num_comments": 214,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m0i7w1/first_cs_job_starts_monday_tips_for_a_strong_start/",
            "score": 634,
            "selftext": "Finally locked in my first CS job (thank you for the help with my resume!). I also negotiated up my salary thanks to [content](https://haseebq.com/my-ten-rules-for-negotiating-a-job-offer/) shared here.\n\nI want to hit the ground running and I figured there may be certain questions I could ask, actions I could take/start, or items I should add to my to-do list.\n\nAny tips?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nEdit: Here are my key take-aways...\n\n&#x200B;\n\n* Document everything / take notes: Write down task processes, onboarding processes, Git flows, all items that required access/permissions (write down the access point of contact, as well), all software / dependencies / etc, all the jargon that doesn't make sense. Turn the onboarding process and access/permissions list into a document that they can use for the next hires.\n* Spend time meeting your co-workers and find the ones who are happy to help.\n* Expect to suck and don't be afraid to ask questions (only after spending 30-60 mins of trying to answer it yourself. And take notes on your attempts).\n* Ask for 3 and 6 months expectations.  Schedule a 30-60-90 day check in.\n* Put the extra effort in within the first month (AKA putting in more than 40 hours or studying more at home). I plan to ask if it's ok if I go over 40hrs/wk in the first month, then go back to aiming for \\~40 after that\n* Aim to make a commit within first week or two (can be to README or clarifying comment etc). Good to learn Git flow and good for first impression. Ask for a review of commit first.\n* Don't step on dogs and also punch a Senior dev in the face.",
            "spoiler": false,
            "stickied": false,
            "title": "First CS job starts Monday. Tips for a strong start?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m0i7w1/first_cs_job_starts_monday_tips_for_a_strong_start/"
        },
        {
            "author": "u/Cheesecake_Vast",
            "created_utc": "03-22-2021 00:29:44",
            "distinguished": null,
            "edited": "03-22-2021 03:08:42",
            "id": "maewb5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_maewb5",
            "num_comments": 102,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/maewb5/any_other_2020_cs_grads_without_jobs/",
            "score": 118,
            "selftext": "seeing if there’s any body out there in my boat. Graduated last year in cs, decent gpa, internship experience and no offers one year later.\n\nfeeling like a failure. but hey at least we made it through one year of the pandemic in one piece.",
            "spoiler": false,
            "stickied": false,
            "title": "any other 2020 cs grads without jobs ?",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/maewb5/any_other_2020_cs_grads_without_jobs/"
        },
        {
            "author": "u/oj-smith",
            "created_utc": "03-21-2021 08:36:09",
            "distinguished": null,
            "edited": "03-21-2021 08:39:30",
            "id": "m9vsai",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m9vsai",
            "num_comments": 106,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m9vsai/is_there_a_job_below_a_junior_developer/",
            "score": 103,
            "selftext": "I can't get a job. I'm hundreds of applications deep and I've only had one single interview, because of this I've had no feedback whatsoever. \n\nI've recently been putting 100% of my time into building my own market ready software, but I have nothing to fall back on. \n\nI'm applying to all junior jobs, typical titles are junior python dev, junior back end dev, junior DevOps engineer, junior it support, junior software engineer. \n\nI'd consider my main tech stack to be Python and Linux but I've got a pretty high level of skills across a range of areas. \n\nResults from my last interview; 'your skills and attitude are excellent, and you've done nothing wrong; however we will be moving forward with another applicant who has 5 years of experience - regardless of what salary you will be happy with'. \n\nI'm not sure what I'm supposed to apply to anymore. Clearly I'm somehow not applicable for junior dev roles. I'm 6 months into a voluntary unpaid software dev position. \n\nI have <2 months to get a job. If I can't find one, I'll be leaving my pursuit of a career in software behind. So I guess my questions are:\n\nWhat's a good place to find internships in the UK? \n\nIs there another line of work my skills in software could help me get into?\n\nAm I doing anything blatantly wrong?",
            "spoiler": false,
            "stickied": false,
            "title": "Is there a job below a junior developer?",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m9vsai/is_there_a_job_below_a_junior_developer/"
        },
        {
            "author": "u/Lost_in_Nullspace",
            "created_utc": "02-22-2021 00:01:09",
            "distinguished": null,
            "edited": "02-23-2021 06:44:23",
            "id": "lpflvj",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lpflvj",
            "num_comments": 268,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lpflvj/over_30_never_had_a_job_about_to_graduate_how/",
            "score": 666,
            "selftext": "So, the title kind of sums it up really; I've been sick all my life, but I recently was cured. and I'm only just finishing my degree now and look to be finishing with a first (4.0 GPA).\n\nBecause I was so ill, I haven't managed to have a job my entire adult life; I was pretty much asleep 18 hours a day and exhausted the other 6. Fortunately, I seem to pick thing up pretty fast, so I just about managed to cope with my studies, and will most likely finish with a first (4.0 GPA) and a final project based on a novel approach to analysing AI systems.\n\nI'm based in the UK at a low ranked University, and I'm worried that because of my non existent employment history and my lack of experience, I'm not even going to make it to the interview stage. It just looks like on paper, I have pretty much everything going against me.\n\nDoes anyone have any advice or guidance for me? What should I be expecting after graduation? Am I beyond screwed? Because I feel like I'm beyond screwed.\n\nEdit: Thanks to everyone for the support, it means so much to me to be able to get some perspective on this and it's been so incredibly helpful. I'm trying to finish building out a feature, so I've got to stop replying for now, but I will try my hardest to reply to anyone else when I have time.\n\nEdit: Thanks for everyone's help. I've tried replying to you all, but I'm bound to have missed a bunch. Anyway, I'm going to have to quit replying; It's been so insightful and everyone has been incredibly supportive, but I spent 2 hours replying as best as I can already, and it's starting to become difficult to keep up. Thank you once again to all you for your help, and I'll make sure to update in a few months time once I'm polishing up my CV and prepping for interviews. Cheers!",
            "spoiler": false,
            "stickied": false,
            "title": "Over 30, never had a job, about to graduate. How screwed am I?",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lpflvj/over_30_never_had_a_job_about_to_graduate_how/"
        },
        {
            "author": "u/hammerTIMEsmith",
            "created_utc": "02-27-2021 08:27:05",
            "distinguished": null,
            "edited": false,
            "id": "lto3uc",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lto3uc",
            "num_comments": 199,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lto3uc/new_job_will_not_be_what_was_advertised_but_have/",
            "score": 418,
            "selftext": "I’ve seen quite similar posts on here to this in the past, but I would really like some advice, and also I want to vent a bit…so thanks for reading if you do.\n\nI was offered a job advertised as using C# .Net Core, React, Azure, SQL Server. Modern tech which I’m competent in and have worked hard the last 3-5 years to learn this stack and been using in my previous job. During the application phase I asked multiple times what the project was (different people, at different phases of the interview process) and I was told my skills would be mapped to a project after I accepted.\n\nSo I accepted. Resigned from current job which I’ve now left.\n\nI asked to know what project I was mapped to.\n\nThe first one was Node.js which I haven’t used, although I’ve used Javascript with React. So I said it didn’t match what I’d applied for.\n\nThe next one was a 10+ years old tech stack, not in the cloud, that has not evolved to newer tech with no plan to. Again I said it wasn’t what I’d applied for.\n\nSo finally, they have offered me another project, that will use newer tech (.Net Core, Azure) in 7 months’ time when they do a rewrite. But for the first 6 months, they want me to write SQL to get data out of database for reporting…so just SELECT statements, for 6 months…\n\nI am surprised they could look at my CV and my skill set and map me to writing just SQL reports for 6 months, but if I don’t start the job, I will be unemployed.\n\nAnd if they do actually start the project rewrite in 6 months’ time, it could be quite interesting. They are offering a good Salary for my country and have a good reputation as a company.\n\nAny advice would be really appreciated. I haven’t started the new job yet but I’ve signed the contract. I wouldn’t go back to my old company as I burned out there and think my desperation to leave has put me in this situation.\n\nI can’t even begin to describe how stupid I feel.\n\nMy advice to anyone reading this, think really carefully about resigning from your current job if you don’t know exactly what the project and tech you’ll be using will be (unless you really just want to work for that company no matter what).",
            "spoiler": false,
            "stickied": false,
            "title": "New job will not be what was advertised but have left old job already",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lto3uc/new_job_will_not_be_what_was_advertised_but_have/"
        },
        {
            "author": "u/NotVector",
            "created_utc": "03-24-2021 07:05:44",
            "distinguished": null,
            "edited": false,
            "id": "mc305m",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_mc305m",
            "num_comments": 105,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/mc305m/what_is_the_future_for_cs_jobs_2030s/",
            "score": 41,
            "selftext": "Will jobs like software engineers or machine learning engineers still be in demand in 2030s?\n\nI'm a student that wants to study CS and primarily AI in college. I like coding and automating stuff and as a bonus the pay is very generous.\n\nI am worried that the tech boom is this decade and it will fade shortly. There are already so many software engineers and I feel like in the future there will be too much of them and the pay will also go down.\n\nWhat is the future for computer science jobs?",
            "spoiler": false,
            "stickied": false,
            "title": "What is the future for CS jobs (2030s)?",
            "upvote_ratio": 0.75,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mc305m/what_is_the_future_for_cs_jobs_2030s/"
        },
        {
            "author": "u/GrizzyLizz",
            "created_utc": "03-01-2021 08:32:44",
            "distinguished": null,
            "edited": false,
            "id": "lv9awn",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_lv9awn",
            "num_comments": 120,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lv9awn/what_canshould_be_expected_of_someone_with_one/",
            "score": 564,
            "selftext": "I'm coming up to six months of full time experience and I dont feel like I've really learnt anything of note or have improved my development skills. I was initially made to go through some generic trainings(AWS,Python,SQL) when I joined of which AWS was the only thing new to me. The last few months have gone in getting some understanding of the codebase, the product's functionality and the team's workflow (the whole agile process related stuff) . So at this moment, I know when a defect is assigned to me, what are the series of steps to go through although the codebase is so huge and covers so many functional areas that right now, every defect exposes me to something new about the product's working\n\n&#x200B;\n\nLooking ahead, I want to lay out a path for myself as to how to evaluate whether I'm progressing well or not. Also, I want to give a try to some of the bigger companies a few months down the line. I'm not sure what will be expected of me in the discussions when I get asked about my experience and contributions at my first company - if I say that I did not have ownership of any feature and simply worked on resolving the defects assigned to me, would that be a dealbreaker? I understand that the Leetcode questions are probably the biggest factor in getting an offer but I wanted to know whether that would offset a lack of 'great' experience which some others from startups might have.",
            "spoiler": false,
            "stickied": false,
            "title": "What can/should be expected of someone with one year of experience as an entry level SWE? How would you evaluate a person if they were applying for a job at your company with 1 YOE in the industry?",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lv9awn/what_canshould_be_expected_of_someone_with_one/"
        },
        {
            "author": "u/haxuc",
            "created_utc": "03-23-2021 18:56:43",
            "distinguished": null,
            "edited": "03-23-2021 23:38:14",
            "id": "mbr7jw",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mbr7jw",
            "num_comments": 84,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/mbr7jw/am_i_expected_to_program_8_hours_a_day_my_new_job/",
            "score": 41,
            "selftext": "I am given a task to complete (often requiring significant design, unit testing, testing, coding) and don't have meetings, emails to answer, etc. I just started a few months ago and I've completed a few big tasks already.\n\nAm I expected to program here 8 hours a day or something? I really only have a good 4 hours of work in me per day (unless I take drugs or force myself).\n\nWhat exactly am I supposed to do the rest of the day, while I'm on the clock?",
            "spoiler": false,
            "stickied": false,
            "title": "Am I expected to program 8 hours a day my new job?",
            "upvote_ratio": 0.65,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mbr7jw/am_i_expected_to_program_8_hours_a_day_my_new_job/"
        },
        {
            "author": "u/one_giant_weezle123",
            "created_utc": "03-10-2021 15:26:26",
            "distinguished": null,
            "edited": false,
            "id": "m27jte",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m27jte",
            "num_comments": 88,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m27jte/can_a_company_back_out_of_a_job_offer/",
            "score": 217,
            "selftext": "I received my first internship offer. The recruiter called and announced that I had been selected and that they would like to go forward with an offer. I accepted the offer. All these happened a few days ago. I still haven't received an official offer letter or any documentation. Can they back out after this? How long should I wait? I am just anxious because I had been looking for internships for more than a year and I finally got one. I hope there won't be a problem.",
            "spoiler": false,
            "stickied": false,
            "title": "Can a company back out of a job offer?",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m27jte/can_a_company_back_out_of_a_job_offer/"
        },
        {
            "author": "u/KeepOnTryingBuddy",
            "created_utc": "03-19-2021 14:55:08",
            "distinguished": null,
            "edited": false,
            "id": "m8o9kd",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m8o9kd",
            "num_comments": 79,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m8o9kd/new_grad_job_hunt_stress/",
            "score": 87,
            "selftext": "So i'm approaching the 100 application mark since Jan 17th and only have gotten 3 interviews(1 being amazon). Constantly getting rejection emails and just straight up no responses from companies. Each day closer to May the stress seems to pile up and honestly feeling depressed. I've gotten my resume reviewed several times, done side projects, and even gotten an internship last summer but still having an insanely hard time just getting a response back from applications. Even gone though 4 hours of interviews with one of the 3 companies and told I did great just to get rejected in the end which adds to the stress. Wondering if anyone can give me some advice on the job hunt. Don't graduate until may so still got time but this is a-lot more difficult than I imagined.",
            "spoiler": false,
            "stickied": false,
            "title": "New Grad Job Hunt Stress",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m8o9kd/new_grad_job_hunt_stress/"
        },
        {
            "author": "u/echoaj24",
            "created_utc": "02-13-2021 02:33:12",
            "distinguished": null,
            "edited": "02-13-2021 16:06:26",
            "id": "livy23",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_livy23",
            "num_comments": 221,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/livy23/finally_got_my_first_job_as_a_software_engineer/",
            "score": 986,
            "selftext": "Before Graduating in December 2019\n\n* Had a total of 3 interviews (1 internship, 2 full-time positions) -- All 3 of them I failed.\n* Never had internship experience.\n* Had a job teaching kids how to code. (over 1 year of experience)\n\nAfter Graduating in December 2019.\n\n* Continued teaching kids how to code.\n* Applied to around 20 - 50 different companies.\n* Only a few ever responded.\n* 1 Job Interview after graduation (The company that hired me).\n\nMy Resume: [https://drive.google.com/file/d/1tckrTpAlxdlsfRoiwOYO\\_E9CasdnqtTu/view?usp=sharing](https://drive.google.com/file/d/1tckrTpAlxdlsfRoiwOYO_E9CasdnqtTu/view?usp=sharing)\n\n**What I learned:**\n\n* After you graduate practice every day the concepts you learned in College.  DataStructures, Software Engineering Principles, Operating Systems, Linux, Web Programming, Git, Software Architecture ect.. That way you can answer any question the interviewer throws your way.  Become a master of these concepts.\n* Beyond that, Learn concepts that they didn't cover much in schools such as dynamic programming, Jira, AWS, Jenkins, test software, developer tools, and more.  (From my perspective we didn't learn much about this).\n* HUGE TIP: Simulate work experience as best as you can by Join an open-source project on GitHub.  I did some work on [https://github.com/TheAlgorithms/Python](https://github.com/TheAlgorithms/Python).  A project that tries to implement all algorithms in python.  I learned how to test code doing this and got more practice using git.\n* Do not make a fancy resume with your photo, columns, tables ect.. I did this and didn't get a reply for like 8 months, found out that Applicant Tracking Software can't read those too well so it is better to write a plane resume that is readable line by line.\n* Test your resume on one of these websites that give it ATS score.  My fancy resume got a score of 16% but once I changed it to look more plane and changed the wording I got a score of 46% then I started getting a lot more replies from companies. I used [https://resumeworded.com/resume-scanner](https://resumeworded.com/resume-scanner)\n* Solve one LeetCode question a day, create 4 solid advanced programming projects, and put them on GitHub and on your resume.  Make your LinkedIn stellar.\n* Study your ass off when you have an upcoming interview.\n* During the interview, speak loudly, ask a lot of questions, build off questions from the ones they ask you.  This makes it sounds like you know what you are talking about, that you are interested, and have some form of control during the interview.  Also be nice and grateful.\n\nFor those of you who get super nervous during interviews believe me, so do I.  I was so nervous before my interviews that my stomach physically hurt every day.  I would have diarrhea, and couldn't think of anything else besides the nervousness I felt.  The only thing that helped slightly was preparing to feel more confident, taking deep breaths, and going for walks.\n\nLastly, I am not a genius that went to a good university.  My GPA was average.  Yes, I was desperate, I thought I would never make it, worried about my future, stressed all the time, felt behind, but I still worked my ass off every day, kept applying, and never gave up.  I even demonstrated the hard work I put in during my interview to show them I care.\n\nI also believe some luck and opportunity is involved during this process but there's not much you can do about that so just focus on the hard work.\n\nKeep your head high and good luck on getting your foot in the door. :)\n\nAlso, I'm from San Diego, CA",
            "spoiler": false,
            "stickied": false,
            "title": "Finally got my first job as a Software Engineer after graduation a year ago. Here are my stats.",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/livy23/finally_got_my_first_job_as_a_software_engineer/"
        },
        {
            "author": "u/RedditStreamable",
            "created_utc": "02-15-2021 08:21:47",
            "distinguished": null,
            "edited": false,
            "id": "lkdk8g",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Meta",
            "locked": false,
            "name": "t3_lkdk8g",
            "num_comments": 143,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lkdk8g/i_collected_around_1081_jobs_from_companies_that/",
            "score": 1576,
            "selftext": "Hey everyone,\n\nEven as a mid level dev with several years of experience, I have always found it difficult to solve problems on the whiteboard. I'm more of a practical person who can come up with solutions in front of a screen and ever since I left college, it's only been even more difficult to get back into the Leetcode grind.\n\nI don't have much of an appetite for FAANG companies anyway. I figured I would start setting up a section for Hiring Without Whiteboards on my job board to categorise it.\n\nHere's the link: https://arbeitnow.com/hiring-without-whiteboard\n\nWould love to know what you think!",
            "spoiler": false,
            "stickied": false,
            "title": "I collected around 1081+ jobs from companies that hire without whiteboard questions",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lkdk8g/i_collected_around_1081_jobs_from_companies_that/"
        },
        {
            "author": "u/TheNewDevGuy24",
            "created_utc": "03-16-2021 15:24:26",
            "distinguished": null,
            "edited": "03-16-2021 23:29:34",
            "id": "m6h3rq",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m6h3rq",
            "num_comments": 63,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m6h3rq/i_finally_got_a_job_offer_today_story_of_an/",
            "score": 112,
            "selftext": "Hi everyone,\n\nI finally get my first entry job as a Mobile Engineer after graduate 3 months ago. I just want to share this story to encourage everyone to keep applying for jobs and you guys will get it.\n\nAbout me:\n\n* I'm a new grad from a small state college in the Midwest.\n* I only have 1 intern experience with a Mid-size local company.\n* I have about 2-3 different volunteer position that is related to CS.\n* I have about 4 -5 different projects on Github (Mobile app, IoT Application, Full-Stack web application)\n\nAs you can see, I don't have much experience, and I also require companies to sponsor me in the future if they want to take me in for a long term. I applied for about \\~ 500 different jobs around the U.S.\n\n* I got 1 offer.\n* I got 3 on-site.\n* I got about 12 interviews.\n* I got plenty of rejection and ghosted from companies, I think around 337 rejections and plenty of ghosted email. [https://imgur.com/gOkASBF](https://imgur.com/gOkASBF)\n\nI know that we are living in a scary time right now, I know that it's hard to get a job. I also understand the frustration, depression, and tiredness of this job searching process. There is plenty of time that I'm thinking about giving up. However, my family and friends are always there for me to support me. That's how I get through all of the burnout from applying for jobs.\n\nFinally, I just want to say that you guys will get through it.  The most important thing that you guys should do is taking care of your mental and health. After that keep applying for jobs, working on personal projects, practicing behavior questions, and leetcode. We will get through this together!\n\nIf you need someone to talk to, please leave a comment here. I know it may sound strange, but having people support you is one of the biggest things that help me on the journey of getting my job offer.  \n\n\nEdit 1: Thank everyone for the rewards. I'm really happy that I can help many people feel less stressed out about the job search process!",
            "spoiler": false,
            "stickied": false,
            "title": "I finally got a job offer today!! (Story of an International Student in the U.S)",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m6h3rq/i_finally_got_a_job_offer_today_story_of_an/"
        },
        {
            "author": "u/ryati",
            "created_utc": "02-24-2021 14:58:04",
            "distinguished": null,
            "edited": "02-24-2021 17:58:43",
            "id": "lrlw0b",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Meta",
            "locked": false,
            "name": "t3_lrlw0b",
            "num_comments": 93,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lrlw0b/psa_be_aware_of_fake_job_scams/",
            "score": 697,
            "selftext": "I just helped a friend identify that he was being recruited by a scammer. The way it went down was very similar to this article: https://www.howtogeek.com/410387/scam-alert-fake-job-recruiters-tried-to-catfish-us-here%E2%80%99s-what-happened/\n\nBasically they offered him a part time programming job that paid insane amounts of money. There was a fake interview process where they had him answer some behavioral type questions. There was no face to face meetings in person or over zoom. There was no technical interview. As part of the job he was going to get paid a good rate for \"training\" then would get his full rate a few days after that.\n\nThe scam came when he was told that he was going to be sent a company check that he could then use to pay for his company issued macbook and software. Never do this. Thankfully he felt like something was up and started asking people he knew before doing anything else.\n\nHe did send out his address, email and phone number. Hopefully this information won't be too bad...\n\nSome of the red flags to look for:\n1. a non cooperate email address (@gmail, @outlook, etc)\n2. urgency to finish everything quickly (Have you signed it yet?!)\n3. No in person meetings or video calls\n4. English is bad or off (not always bad, see below)\n\nThe article above recommends to report these scams to the FTC: https://reportfraud.ftc.gov/#/\n\nGood luck out there and stay vigilant!\n\nEdit:\nA note about #4 above. Many legit people have learned English as a second language. This may not alone be an indicator that there is a problem. However, many scams originate from non English speaking countries. Just because someone has bad English does not make it a scam, but be alert if things feel off or appear along with other red flags. If you feel funny about a job, its better to be safe about it.\n\nNever send money to anyone you don't know.",
            "spoiler": false,
            "stickied": false,
            "title": "PSA: be aware of fake job scams",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lrlw0b/psa_be_aware_of_fake_job_scams/"
        },
        {
            "author": "u/cscq_throwaway_hlx",
            "created_utc": "03-18-2021 09:32:57",
            "distinguished": null,
            "edited": false,
            "id": "m7qw11",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m7qw11",
            "num_comments": 59,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m7qw11/should_i_finish_my_cs_degree_if_i_already_have_a/",
            "score": 30,
            "selftext": "Here's the situation. I have some pretty solid experience up to this point (4x Shopify internships + 1x Microsoft internship) and my current fulltime job. I went fulltime because of COVID and decided that it was more worth it to get more experience than online school. I have exactly 10 classes left to get my degree (4 CS classes and 6 electives). Another alternative is getting a general BA which I would qualify for now. The question is should I leave my job to finish the CS degree?\n\nNote: the 4 CS classes would need to be done in person.\n\nMy concerns about not finishing my degree:\n\n\\- US visa (I'm Canadian and would like the option to work in the US).\n\n\\- Job eligibility (I know some/most companies require a relevant degree).\n\n\\- Regret. I feel like I've given up on something I've already committed so much time and energy.\n\nMy concerns about leaving my job:\n\n\\- Not being able to find a job after I'm done school.\n\n\\- Lost time (4 - 8 months depending if I do some classes part time).\n\nI'm leaning towards getting the degree, but would love to hear if anyone in a similar situation has an opinion",
            "spoiler": false,
            "stickied": false,
            "title": "Should I finish my CS degree if I already have a good job?",
            "upvote_ratio": 0.81,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m7qw11/should_i_finish_my_cs_degree_if_i_already_have_a/"
        },
        {
            "author": "u/dalekman1234",
            "created_utc": "03-05-2021 07:24:54",
            "distinguished": null,
            "edited": false,
            "id": "lyapyw",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lyapyw",
            "num_comments": 72,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lyapyw/job_lied_about_actual_responsibilities/",
            "score": 123,
            "selftext": "Hey all, got a quick question that I didn't see asked earlier on thus sub, so was wondering if anyone had some advice.\n\nLast year (before graduation) I did everything a good CS student should, I applied early and often to full time positions and had plenty of offers. I eventually accepted one, and have been working there for 6 months now.\n\nHowever, it became clear very early on that - although the position was advertised as a Junior Software Developer, it was really just a production support role. (Really big company that you've probably heard of by the way)\n\nSo I've spent the last 6 months learning nothing, and not advancing my software career in any meaningful way. It just feels really disappointing to see all my other friends/colleagues grow their software skills, while I'm already stuck.\n\nHas anybody experience this \"job wasn't what it said on the tin\" before? Would quitting after 6 months be a detrimental move (look really bad on resume). Should I try to stick it out until the one year mark? \n\nAny advice big or small would be appreciated.",
            "spoiler": false,
            "stickied": false,
            "title": "Job Lied About Actual Responsibilities",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lyapyw/job_lied_about_actual_responsibilities/"
        },
        {
            "author": "u/StarksTwins",
            "created_utc": "03-20-2021 09:46:53",
            "distinguished": null,
            "edited": false,
            "id": "m97dfe",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m97dfe",
            "num_comments": 44,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m97dfe/its_often_said_that_to_work_in_tech_be_prepared/",
            "score": 35,
            "selftext": "I’m interning at Big F this summer, and I’m vying for their return offer.  I often see that if you’re working in tech, you should be prepared to constantly job switch, or else you won’t be making what you deserve. Does that apply if your job is already at a “prestigious” company? It’d be my first job, and I know it’s common knowledge to never be attached to your first job. I just don’t know if it applies to a place like Big F or any of the other FANGs",
            "spoiler": false,
            "stickied": false,
            "title": "It’s often said that to work in tech, be prepared to continuously job hunt, because it’s cheaper for employers to hire new talent than keep old talent. Does this apply if you’re already working for a prestigious company?",
            "upvote_ratio": 0.88,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m97dfe/its_often_said_that_to_work_in_tech_be_prepared/"
        },
        {
            "author": "u/HenesysMSEast",
            "created_utc": "03-01-2021 15:57:57",
            "distinguished": null,
            "edited": false,
            "id": "lvkc7v",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_lvkc7v",
            "num_comments": 101,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lvkc7v/do_you_guys_actually_push_code_daily_at_your_job/",
            "score": 85,
            "selftext": "I’ve only had one job in the actual industry, but there’s so much going on and sometimes such intense issues (going through 1000s of lines of logs) that sometimes I won’t push any code for an entire week. And there’s never been a complaint about my output. \n\nMeanwhile, I come on here and I’ve seen countless posts of guys who are PIP’d or at odds with their manager, yet they claim they’re pushing code daily and that the commit history does the talking for them. \n\nIs there development jobs out there in which people are actually pushing code daily, and that it’s an expectation? Where I work, I’ve come across issues that have involved me analyzing logs for over a week before making any change.",
            "spoiler": false,
            "stickied": false,
            "title": "Do you guys actually push code daily at your job?",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lvkc7v/do_you_guys_actually_push_code_daily_at_your_job/"
        },
        {
            "author": "u/tinmanshrugged",
            "created_utc": "02-03-2021 18:32:34",
            "distinguished": null,
            "edited": "02-04-2021 20:27:01",
            "id": "lc1lnl",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_lc1lnl",
            "num_comments": 178,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lc1lnl/my_mom_was_fired_last_july_and_still_hasnt_been/",
            "score": 558,
            "selftext": "My mom’s company let go all of the older software engineers who were working from home last July. My mom had worked there for over 20 years. Their reasoning was that they wanted people to work in-person at their new office headquarters across the country. But probably the real reason was to replace the higher income people with new grads who will work at a lower salary.\n\nShe’s been applying for as many jobs as possible this whole time, even low salary jobs that aren’t programming related. She’s also been taking online training courses  in C# I think and maybe some others. She hasn’t been able to find a new programming job or even a secretary type position somewhere.\n\nDoes anyone have advice for a programmer experienced in XSLT, PL1, or JCL? They only gave her 4 months severance and things are getting kind of hard. My mom would prefer another work from home position but is willing to work somewhere within a 4 hour drive from Indianapolis, Indiana. Thank you for any help you can give :)\n\nEdit: thank you guys so much! I expected to get a few replies at most and I’m shocked at how kind and helpful this sub is. I told my mom about a lot of your comments and it made her happy. I told her I saw a few comments saying that she must be pretty smart to know XSLT so well, which made her feel good.\n\nMy mom’s still in touch with her former coworkers who were also laid off - they have a video call every couple weeks or so. As far as I know, no one else has found a job yet either, however I don’t know how hard the others are looking. My mom always says those meetings are so depressing because her old coworkers just complain a bunch.\n\nShe’s on LinkedIn and it’s updated. She gets calls and messages from recruiters all the time honestly, but the jobs they suggest for her are usually looking for different languages. So if she gets an interview, it doesn’t usually go very well. \n\nI’m not offended by comments saying she should’ve kept her skills more current. I agree. And I appreciate other comments reminding people that she’s from a different generation where people could count on working for one company for their whole career. I graduated from engineering school a few years ago and we had a required seminar class where industry people would come speak and basically tell us how important it is to continue educating yourself throughout your career. I’m sure my mom didn’t have that benefit. And, yes she did have to take stacks of code cards down to the single big basement computer at Indiana University. I think she graduated in the late 80’s, possibly very early 90’s. She didn’t go to college until her late 20’s though, so she’s in her early 60’s now. She might prefer to work longer, but she really just needs a job for like 5 years so she can get the higher retirement amount.\n\nAnyway thank you all so much!! I’ll post this to r/mainframe and r/experienceddevs as well.\n\nEdit 2: forgot to say that she is on unemployment right now, but it’s nowhere near enough for her bills. My siblings and I are helping out as much as we can, but it’s still not sustainable. Plus she’s kind of a workaholic (requirement for programmers?) and is going crazy lol.\n\nEdit 3: the reason I posted this is because I could tell my mom has started to get really discouraged. It seems like she’s only looking for secretary type jobs lately and doesn’t talk much about software jobs anymore. After so many rejections, I can understand. But I want her to be able to do what she loves and it just seems like there has to be a market for her skills somewhere. I took screenshots of some of the comments here, especially the people saying that she must be pretty smart to have worked on XSLT. I showed them to her and she was so happy. She said it was what she needed to be re-inspired to look for programming jobs. So again, thank you all so much for your kindness!",
            "spoiler": false,
            "stickied": false,
            "title": "My mom was fired last July and still hasn’t been able to find a job. She knows XSLT, PL1, and JCL well. Any advice?",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lc1lnl/my_mom_was_fired_last_july_and_still_hasnt_been/"
        },
        {
            "author": "u/daffid",
            "created_utc": "02-25-2021 10:57:48",
            "distinguished": null,
            "edited": "02-25-2021 11:00:54",
            "id": "ls9qn4",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ls9qn4",
            "num_comments": 65,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/ls9qn4/no_previous_swe_experience_but_recently_landed_a/",
            "score": 203,
            "selftext": "Hey, long time lurker here, can find my background in this post: [https://www.reddit.com/r/cscareerquestions/comments/jaevpq/switching\\_to\\_swe\\_am\\_i\\_ready/](https://www.reddit.com/r/cscareerquestions/comments/jaevpq/switching_to_swe_am_i_ready/). I posted this about 4 months ago when I was ready to take LeetCode seriously and try to better understand the interview. I recently received an offer at FAANG for an entry level software engineering role and would love to share my experiences in regards to the process.\n\nI've seen a lot of posts on here overly negative about the interview process, and I'd agree that the process is really grueling, but I do think there's productive ways on iterating through the coding interview. I've seen people talk about how much they've worked (8-10 hour days for multiple months on end), and honestly, **I think that's really big overkill/probably not the best use of your time.** Preparation for these interviews felt mostly on understanding big picture, not about grinding every minute detail of particular coding problems. (i.e., I probably would not worry too much about topological sort when dealing with graph problems in LeetCode).\n\nPrior to that post, I didn't know 90% of data structures, mostly just dealing with hashmaps and arrays. And to be honest, self teaching this type of material is pretty unintuitive; while I knew how to code because I'd self taught some of it postgrad, without schooling, I lacked hard CS fundamentals. I had to learn a lot of the basic concepts from scratch (recursion i.e., was something I didn't get to even learn until a few months in). Two Sum would literally take me over an hour to complete when I first started.\n\nIn these last 4 months of prepping, I studied about 10-15 hours a week (reading CTCI and doing LeetCode, and AlgoExpert) on average tried to keep my life balance still enjoyable. I think it's incredibly hard to learn well when one is always stressed with the coding interview and recruiting process, so find what works. **I really don't think grinding more hours means a more effective use of your time, and planning out my study sessions as to what I was going to accomplish helped a lot more than just dedicating a ton of time.**\n\nThat aside though, the single most important thing that helped me get up to speed with LeetCode and coding in general was **having people around me.** This might be a strange tip, but you don't really quite know what you don't know/can tunnel very easily when learning LeetCode/CTCI. My group of friends I play video games with are predominantly software engineers, and what was most helpful by far was just having people to bounce ideas off of when doing a problem. **It's much easier to become good at LeetCode if when you practice, you're able to simulate pair programming/how an interview would actually go. For this, it's best to have people around you to talk you through how you're thinking. Doing practice interviews with people will be infinitely more helpful than you pressing run and getting a syntax error on LeetCode.**\n\nThis is where I think LeetCode can be a lot of luck. I don't think I'm talented at interviewing at all, easy LeetCode problems used to take me literally 2 hours of frustration. **However, having a mentor or someone just willing to point out where I could improve my code made me improve much more quickly than if I were to just bang my head against the wall and grind questions. Above all else, I think this is the most \"lucky\" part of the interview, but also makes it much easier to improve.**\n\nI completed about a total of 200 LeetCode problems over a 4 month period, doing maybe a few a day until I was able to become much faster. I can't stress how important it is that when you're doing the problems, for you to learn how to talk through your code while you practice. **In most my interview experiences, I did not finish all the problems given, but rather focused on making sure what I did have on paper was both clear and well-communicated. There's a misconception that you have to be very, very good at those problems; you have to be very, very good at explaining your thoughts in code, not necessarily learning every particular algorithm.**\n\nFor recruiting? Just cold email people. Express interest, build a narrative for yourself. You'll be surprised how many people are willing to give you a chance if you aren't just a name on a resume. I didn't apply to a bunch of places, but I found that most my successes to companies I wouldn't have been qualified on paper for came through me emailing people and talking about my situation. **People drastically underestimate how important it is to have a story to stand out; yes, coding expertise is important, but people really just want to find other people that will be good at the job and fun to work with.**\n\nAlso, just have fun with it. A lot of interviewing is luck, whether you get a good interviewer, a good interview question, whether you pass the resume screen. The process is stressful, you got this. Take all the time you need lol, this process just takes time after all. **I'm really happy I was able to find a job this quickly in the midst of COVID, but honestly, a lot of it was luck. Luck in having people around me to help me learn and iterate on the interview process, luck in passing, etc. Don't be too results oriented, and don't just grind endlessly without purpose. 100-150 really well done and practiced LeetCode problems are way better than 500 endlessly grinded ones. I've maybe done <5 hard questions.**\n\nAnyway my formatting probably sucks",
            "spoiler": false,
            "stickied": false,
            "title": "No previous SWE experience, but recently landed a job and wanted to share some tips!",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ls9qn4/no_previous_swe_experience_but_recently_landed_a/"
        },
        {
            "author": "u/cyanidequ33n",
            "created_utc": "03-19-2021 21:36:14",
            "distinguished": null,
            "edited": false,
            "id": "m8wkci",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m8wkci",
            "num_comments": 33,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m8wkci/when_the_vaccines_are_widely_distributed_will_the/",
            "score": 28,
            "selftext": "especially for new grads?",
            "spoiler": false,
            "stickied": false,
            "title": "when the vaccines are widely distributed, will the job market go back to what it was before covid?",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m8wkci/when_the_vaccines_are_widely_distributed_will_the/"
        },
        {
            "author": "u/AdditionalOrdinary23",
            "created_utc": "03-23-2021 16:31:17",
            "distinguished": null,
            "edited": false,
            "id": "mbo29p",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mbo29p",
            "num_comments": 13,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/mbo29p/i_had_my_first_major_screw_up_at_my_first_job_how/",
            "score": 64,
            "selftext": "For a background, I'm a greenhorn tech writer at a somewhat large manufacturing company. I started last fall, and the team I was placed on was designing a major refresh of a screen our employees use.\n\nDesign is far from my specialty, and the system is extremely complicated. I took a hands-off approach to the design doc and tried to learn, follow, and help where I could on it. It went through months of feature creep, constant changes, and dozens of approvals. Still, everyone approves it, and no one brings up any documentation issues.\n\nFast forward to pre-release testing, and it is a shitstorm. The testing is a week behind, the document apparently horribly inadequate and has had over a dozen changes logged to it, bugs are everywhere, and I've someone ended up being the point of contact for our team despite clearly not knowing what the fuck I'm doing. I'm messing up and pissing off our devs since my managers didn't assign the lead BSA to help with me until it was far too late.\n\nHow do I deal with this? I'm trying my best, and I am fucking horrified that I'll be blamed for the documentation errors since I was the main point of contact despite being on the job for less than 6 months right out of college. Any advice would be great.",
            "spoiler": false,
            "stickied": false,
            "title": "I had my first major screw up at my first job. How do I learn from it and deal with the aftermath?",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mbo29p/i_had_my_first_major_screw_up_at_my_first_job_how/"
        },
        {
            "author": "u/mocaxs",
            "created_utc": "01-30-2021 08:11:15",
            "distinguished": null,
            "edited": "01-30-2021 08:27:25",
            "id": "l8lej6",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_l8lej6",
            "num_comments": 109,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/l8lej6/is_anyone_else_looking_for_a_remote_dev_job_with/",
            "score": 1125,
            "selftext": "I've put them on  [remoteimpact.io](https://www.remoteimpact.io/) \\- a free list of remote dev jobs that are transforming the world with their social impact. I'm hoping this site will support my applications!\n\nJobs can be filtered by the [UN's Sustainable Development Goals](https://sdgs.un.org/goals) which list 17 global goals to tackle the worlds most pressing problems.\n\nNew jobs are automatically added daily and if it's useful to others I'd be more than happy to spend more time finding and adding more companies. I've been coding for about a year now and would welcome any ideas on how to improve the site for my portfolio, or any features you would like to see.",
            "spoiler": false,
            "stickied": false,
            "title": "Is anyone else looking for a remote dev job with social impact? I've been searching for the last few months and compiled all the companies I have found into a free list I hope will help others. You can filter jobs by the UN's Sustainable Development Goals!",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l8lej6/is_anyone_else_looking_for_a_remote_dev_job_with/"
        },
        {
            "author": "u/lifeInShamblesCS2019",
            "created_utc": "02-21-2021 13:14:00",
            "distinguished": null,
            "edited": false,
            "id": "lp2xff",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lp2xff",
            "num_comments": 73,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lp2xff/started_a_new_job_2_months_ago_hate_it_and_dont/",
            "score": 130,
            "selftext": "Title sums up the post. This is basically an update to [a post](https://www.reddit.com/r/cscareerquestions/comments/kpr2iu/spent_2_years_unemployed_after_graduation_finally/) I made on this board in early January about a job offer I signed in late December. TL;DR on that post just for context: I work for the U.S. branch of a European company whose flagship product is written in an old language called Smalltalk... sort of (I'll explain later). In my first post, I expressed my concern that working for this company might be bad for my career due to the relative obscurity of Smalltalk in the SWE job market, and I got lots of great answers from all sorts of perspectives. Of course, I ultimately decided to take the job, since I had no other prospects other than remaining unemployed.\n\nI've now been working for around 2 months, and I'm starting to realize that there's a lot of things I **really** don't like about this job, and it seems like every day I find something new to dislike about it.\n\n**First**, the language. See, it turns out that while I was told I'd be using Smalltalk on the job, the way it actually works is that the company actually uses a *proprietary framework* that is coded in Smalltalk. Basically, my first month on the job included some basic Smalltalk training, along with training in how to use the company's flagship product, and everything from then on involves using the proprietary framework.\n\nThis comes with all the negatives people on this board usually cite when talking about proprietary frameworks:\n\n\\- **Lack of Documentation.** This one explains itself. According to my team's lead developer, the company's philosophy is to \"document\" their code by using \"descriptive names\" for their methods and variables. This isn't done well. Methods are obscure and convoluted, not at all self explanatory, company-specific terminology and jargon is rampant, and the most common way to understand what a method does is to look at how other devs have used it and just copy them.\n\n\\- **Can't Google anything.** Because the framework is proprietary, it's closed-source and therefore no one on Google (or, for that matter, outside of the company) will know anything about the software. So if and when you get stuck, your only recourse is to ask a more senior developer, and if they don't know what to do, then they ask **their** seniors, and so on all the way up to a pair of allegedly-genius-tier \"gurus\" at the European branch who wrote the framework and have been with the company for decades.\n\n\\- **Non-transferrable experience.** If and when you want to leave this company, it's basically impossible to market your skills and experience, because all you know how to do is maintain and expand the company's framework. To this day, the only transferrable skill I've learned at this company is how to use a debugger, and maybe the basics of Smalltalk, assuming I ever run into another company who uses this language again.\n\n**Second**, my pay. I don't believe I mentioned this in my old post, but my TC at this company is $60k. I live in Miami, FL, which is a high COL area. At first, I was happy just to have found a job, but now that I'm actually getting paid I can't help but notice how little I'm making for my area. Rent here is $1.7k+ for a **studio** (not even a full apartment) in any halfway decent area. Once you factor in bills, gas, groceries, student loan payments, and other necessities, I'm basically living paycheck to paycheck. I'm **not** a big spender by any means. At most I'll treat myself to dinner at a Cheesecake Factory on a Friday afternoon or something, but with the money I'm making now I have to think twice about doing even that, and I often end up just forgoing it altogether so I can continue to build up my meager emergency fund.\n\n**Third**, the company culture. At least I think that's what this is called. There are huge numbers of meetings, plus \"team activities\" like playing Pictionary together or \"hanging out\" after work, the kind of \"team-building\" stuff that isn't technically mandatory, but if you refuse you'll be viewed as not being a \"team player\" or whatever and probably end up getting replaced at some point. Also, I'm not really sure how to word this, but at this company, developers are expected to debug code in front of representatives of client companies (!!!). I've never heard of this practice before and have no idea how common it is, but this is an extremely stressful prospect for someone like me with performance anxiety. I had a hard enough time doing whiteboard problems with a job offer on the line... imagine trying to fix a bug with production code in real time in front of some corporate representative, with *my livelihood* (i.e. survival) potentially on the line. I've heard from more senior developers at this company that this is actually really stressful, as many of the client company representatives are very impatient and demanding. I'm trying to drag out my training period for as long as possible to put off having to do this because I just don't know how I'm going to manage it.\n\nI just feel like such an idiot. I slaved away in college, graduated with a 3.83 GPA, all just to end up living a life where I basically can't afford to treat myself to any kind of leisure or fun on my time off. My day is basically I'm really depressed and unhappy, and it's only getting worse every day. I don't know what to do. I feel so exhausted, drained and demotivated after a work day that I don't even want to look at an IDE, let alone grind Leetcode or build portfolio projects like I did before I got this job.\n\nI want to try to apply to other jobs, but I don't know how to go about it in my situation.\n\n1. Should I update my CV and include my current job, even though I've only been there for two months and I haven't really done anything but \"training\"?\n2. Do I have to stay here for some number of months before leaving so that it won't look bad on my CV? If so, how long do I have to stay?\n3. How necessary is Leetcode? Do I have to grind it to make a good enough salary that I can afford some leisure activities without living paycheck to paycheck? I just don't think I have it in me to do this anymore.\n4. What's the best strategy for an entry level developer to look for a full-time remote position? Should I be trying to connect with random recruiters on LinkedIn? Spamming applications like I did before I got this job? I'd like a job in something mainstream like JavaScript/React or Java or something where the experience I accrue on the job will actually open doors without me having to grind Leetcode forever.\n\nSorry if this post is all over the place. I'm very tired and kind of in a daze at the moment. Sunday depression is setting in. I'm literally staring at my clock, begging it to go slower so it won't be Monday again.",
            "spoiler": false,
            "stickied": false,
            "title": "Started a new job 2 months ago, hate it and don't know what to do",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lp2xff/started_a_new_job_2_months_ago_hate_it_and_dont/"
        },
        {
            "author": "u/xavierelon",
            "created_utc": "03-08-2021 19:36:14",
            "distinguished": null,
            "edited": false,
            "id": "m0uir5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_m0uir5",
            "num_comments": 62,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m0uir5/i_got_piped_today_for_something_i_did_a_month_ago/",
            "score": 31,
            "selftext": "I started working at this smaller company 5 months ago as a DevOps level 1. When they interviewed me I told them the truth about how much experience I have and they hired me anyways. So I started at the company and school did close to nothing to prepare me for a real job but my DevOps team kind of just expected me to know all the practice norms immediately and did very little to explain how things work at the company. \n\nMy team is only one other engineer above me and then my manager. Both have this kind of elitist mentality where it is very hard to approach them for help because of answers/attitude like “how do you not know this already”. And funny thing is one of the things on my PIP is not asking enough questions... yeah okay anytime I ask questions they make me feel like shit. I’ve told my manager this too but I guess they still have to have that on the pip list.\n\nSo basically the main reason for my PIP is because I messed up on a deploy a month ago. Someone reverted their PR and I didn’t catch that and merged the empty PR and ran the post deploy command. The next day I was waiting for our team to meet at our usual time and nobody said anything about meeting  so 15 minutes after our meet time I hopped in the shower for 10 minutes. I get out the shower and my computer is being blown up by them about the bad deploy I did and I explain we didn’t meet at our usual time so I took a quick shower. Of course this showed up on my PIP too that I was “unavailable during work hours”.\n\nI really just feel like they do not like me and treat me like shit. They have 8-11 years of experience on me and I feel like they expect way too much from me despite me learning a lot these past 5 months and putting in lots of work (most days I don’t even take a break). \n\nMy manager said if I don’t improve he will have to let me go which I feel like is what he wants but he said he doesn’t want that. I’m becoming depressed more everyday. I’ve never had people make me feel so stupid when I can’t figure something out. I’m honestly pretty close to quitting but worried how it will look when I look for another job. I really hope the CS field is a lot better than this. I really enjoyed it in school but my first job has just been so unpleasant it’s taking away all my passion. \n\nIt’s also worth noting that the guy whose position I replaced had quit for what seems like similar reasons to me. I heard from others he got really toxic and started to hate the job so he just up and left. I have a feeling he is experiencing what I am going through right now with the team I’m on. \n\nWhat should I do in this scenario? I hope I’m not the bad engineer in this situation but they sure do make me feel incompetent",
            "spoiler": false,
            "stickied": false,
            "title": "I got PIPed today for something I did a month ago and I’m really starting to hate my toxic job. What to do?",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m0uir5/i_got_piped_today_for_something_i_did_a_month_ago/"
        },
        {
            "author": "u/palendrome298",
            "created_utc": "03-09-2021 08:57:33",
            "distinguished": null,
            "edited": "03-09-2021 09:22:24",
            "id": "m16wi3",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m16wi3",
            "num_comments": 23,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m16wi3/colorado_salary_law_official_salary_information/",
            "score": 164,
            "selftext": "Due to Colorado new salary law (sb19-085) all companies are required  to post the salary of the role with their description. \n\nIf you go on LinkedIn top companies like Google, Facebook, and Apple are posting salary information with the job postings. \n\nWhat does this mean?\n This is an official salary tool to know you’re worth when going into negotiations at big tech companies. In most cases if you’re looking at higher cost of living situations like Seattle, California or NY you can expect a little bit more than what Colorado is receiving. So use this as your advantage and know your worth!\n\nEdit: some companies may present salary ranges which may be a tad bit harder to negotiate higher salaries and could still present pay disparities between workers.",
            "spoiler": false,
            "stickied": false,
            "title": "Colorado Salary Law! Official salary information on LinkedIn job postings!",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m16wi3/colorado_salary_law_official_salary_information/"
        },
        {
            "author": "u/uber_______tiny",
            "created_utc": "02-27-2021 09:06:42",
            "distinguished": null,
            "edited": false,
            "id": "ltotoq",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ltotoq",
            "num_comments": 63,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/ltotoq/how_difficult_is_it_to_get_a_job_outside_of_the_us/",
            "score": 93,
            "selftext": "I currently live in the US, and am a US citizen. I’m interested in relocating permanently to Canada or the UK in the future, and am wondering how difficult it would be to find a position. I realize the pay will likely be less, but I have a child with a lifelong medical condition, and would like to live in a country where he won’t have to worry about healthcare costs when he reaches adulthood. \n\nI tried to do a bit of searching on my own, but most posts I saw were in regards to moving TO the US.",
            "spoiler": false,
            "stickied": false,
            "title": "How difficult is it to get a job outside of the US?",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ltotoq/how_difficult_is_it_to_get_a_job_outside_of_the_us/"
        },
        {
            "author": "u/Khuzah",
            "created_utc": "03-11-2021 12:28:12",
            "distinguished": null,
            "edited": false,
            "id": "m2vmm1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m2vmm1",
            "num_comments": 52,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m2vmm1/the_game_is_on_6_months_to_get_a_job_or_bust_any/",
            "score": 20,
            "selftext": "TLDR;\n\n* 30 years old\n* Been wanting to switch to tech so I am going for it or bust\n* Mechanical Engineer work history and degree\n* Sophomore in CS\n* Android dev skills in Java\n* Immense backlog of udemy courses that I will hit hard\n* Asking for advice from the reddit CSCQ gods\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThe long version;\n\nSo I have been working a manual labor job for the past year after covid annihilated the chemical industry in my state. I lost a boring but cushy job I had been at for a year while I was in online CS classes (still am too).\n\nI have been wanting to switch to being a dev badly, I have been coding for fun for years and finally got a game on the google play store.\n\nRecently, my GF of 7 years (licensed professional mechanical engineer) got a stupidly good job offer in Austin... She would be dumb not to take it. So we are planning to move in the next few months. This is the perfect time it seems to finally go for that first tech role, either internship or Jr... or hell even freelance and indie dev.\n\nBasically, I have 12 months or straight up cash I have saved up, and 12 more if I have to liquidate my brokerage account. Goal is to find something in 6 months. **The game is:** next job is to get paid to code so I am pretty open to all possibilities.\n\nI have planned out my weekdays as\n\nWake up when GF gets up\n\n1 hour gym\n\n5 hours Udemy / indie dev projects / leet code (possibly more depending on the day)\n\n2 hours applying to jobs (maybe less if I am waiting for new postings)\n\n0.5-1 hour house work (GF hasn't asked for this, but she will be taking on more bills so its only fair I do dishes and such)\n\nOver the past few months, I have collected udemy courses on sale in Web Dev, iOS dev, Flutter Dart dev, VR dev, Kotlin dev, Agile methods.\n\nI am 30 years old with a work history that may throw employers off given I have a degree in Mechanical Engineering, worked at a plant that shut down after 3.5 years. Had a super shit job I ran from after 6 months, had a ME job for a year before covid screwed me.. and am about to leave an automation tech (maintenance) role after about a year.\n\nI am terrified and super pumped at the same time. Any advice you have to offer me as I enter this quest is super appreciated.",
            "spoiler": false,
            "stickied": false,
            "title": "The game is on! 6 Months to get a job or bust. Any advice is appreciated",
            "upvote_ratio": 0.74,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m2vmm1/the_game_is_on_6_months_to_get_a_job_or_bust_any/"
        },
        {
            "author": "u/Fabulous_Jack",
            "created_utc": "01-13-2021 21:46:19",
            "distinguished": null,
            "edited": false,
            "id": "kwwjbc",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_kwwjbc",
            "num_comments": 216,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/kwwjbc/looking_for_a_job_feels_like_a_perpetually/",
            "score": 1451,
            "selftext": "It's just a never-ending session of studying, working on projects, eating, and sleeping. On the off chance I give myself some free time, I feel super guilty and I can never really enjoy myself.",
            "spoiler": false,
            "stickied": false,
            "title": "Looking for a job feels like a perpetually unending finals week",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kwwjbc/looking_for_a_job_feels_like_a_perpetually/"
        },
        {
            "author": "u/SnooPaintings5866",
            "created_utc": "02-02-2021 03:29:45",
            "distinguished": null,
            "edited": "02-02-2021 18:34:29",
            "id": "lar2us",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_lar2us",
            "num_comments": 85,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lar2us/the_ultimate_blueprint_to_getting_a_job_in_data/",
            "score": 920,
            "selftext": "EDIT: I’m on discord to answer your questions: \nhttps://discord.gg/raQ5NjHy\n\nIt’s pretty late in the UK (11.30pm, but I’ll stay up as long as you guys want me to)\n\nOrganisation is Key\n\nI’ve interviewed at Google (and DeepMind), Uber, Facebook, Amazon for roles that lie under the “Data Scientist” umbrella and this is the typical interview construction theme I’ve observed:\n\nSoftware Engineering\nApplied Statistics\nMachine Learning\nData Wrangling, Manipulation and Visualisation\n\nNow nobody is expecting some super graduate level competency in all of these topics, but you need to know enough to convince your interviewer that you’re capable of delivering if they offered you the job. How much you need to know depends on the job spec, but in this increasingly competitive market, no knowledge is lost.\n\nI recommend using Notion to organise your job prep. It’s extremely versatile, and enables you to utilise the Spaced Repetition and Active Recall principles to nail down learning and deploying key topics that come up time and time again in a Data Scientist interview. Ali Abdaal has a great tutorial on note taking with Notion to maximise your learning potential during the interview process.\n\nI used to run through my Notion notes over and over, but in particular, right before my interview. This ensured that key topics and definitions were loaded into my working memory and I didn’t waste precious \ntime “ummmmmm”ing when hit with some question.\n\n2. Software Engineering\nNot all Data Scientist roles will grill you on the time complexity of an algorithm, but all of these roles will expect you to write code. Data Science isn’t one job, but a collection of jobs that attracts talent from a variety of industries, including the software engineering world. As such you’re competing with guys that know the ins and outs of writing efficient code and I would recommend spending at least 1–2 hours a day in the lead-up to your interview practicing the following concepts:\n\nArrays\nHash Tables\nLinked Lists\nTwo-Pointer based algorithms\nString algorithms (interviewers LOVE these)\nBinary Search\nDivide and Conquer Algorithms\nSorting Algorithms\nDynamic Programming\nRecursion\n\nDO NOT LEARN THE ALGORITHMS OFF BY HEART. This approach is useless, because the interviewer can question you on any variation of the algorithm and you will be lost. Instead learn the strategy behind how each algorithm works. Learn what computational and spatial complexity are, and learn why they are so fundamental to building efficient code.\n\nLeetCode was my best friend during interview preparation and is well worth the $35 per month in my opinion. Your interviewers only have so many algorithm questions to sample from, and this website covers a host of algorithm concepts including companies that are likely or are known to have asked these questions in the past. There’s also a great community who discuss each problem in detail, and helped me during the myriad of “stuck” moments I encountered. LeetCode has a “lite” version with a smaller question bank if the $35 price tag is too steep, as do HackerRank and geeksforgeeks which are other great resources.\n\nWhat you should do is attempt each question, even if it’s a brute force approach that takes ages to run. Then look at the model solution, and try to figure out what the optimal strategy is. Then read up what the optimal strategy is and try to understand why this is the optimal strategy. Ask yourself questions like “why is Quicksort O(n²) average time complexity?”, why do two pointers and one for loop make more sense than three for loops?\n\n3. Applied Statistics\nData science has an implicit dependence on applied statistics, and how implicit that will be depends on the role you’ve applied for. Where do we use applied statistics? It pops up just about anywhere where we need to organise, interpret and derive insights from data.\n\nI studied the following topics intensely during my interviews, and you bet your bottom dollar that I was grilled about each topic:\n\nDescriptive statistics (What distribution does my data follow, what are the modes of the distribution, the expectation, the variance)\nProbability theory (Given my data follows a Binomial distribution, what is the probability of observing 5 paying customers in 10 click-through events)\n\nHypothesis testing (forming the basis of any question on A/B testing, T-tests, anova, chi-squared tests, etc).\n\nRegression (Is the relationship between my variables linear, what are potential sources of bias, what are the assumptions behind the ordinary least squares solution)\n\nBayesian Inference (What are some advantages/disadvantages vs frequentist methods)\n\nIf you think this is a lot of material you are not alone, I was massively overwhelmed with the volume of knowledge expected in these kinds of interviews and the plethora of information on the internet that could help me. Two invaluable resources come to mind when I was revising for interviews.\n\nIntroduction to Probability and Statistics, an open course on everything listed above including questions and an exam to help you test your knowledge.\n\nMachine Learning: A Bayesian and Optimization Perspective by Sergios Theodoridis. This is more a machine learning text than a specific primer on applied statistics, but the linear algebra approaches outlined here really help drive home the key statistical concepts on regression.\n\nThe way you’re going to remember this stuff isn’t through memorisation, you need to solve as many problems as you can get your hands on. Glassdoor is a great repo for the sorts of applied stats questions typically asked in interviews. The most challenging interview I had by far was with G-Research, but I really enjoyed studying for the exam, and their sample exam papers were fantastic resources when it came to testing how far I was getting in my applied statistics revision.\n\n4. Machine Learning\nNow we come to the beast, the buzzword of our millennial era, and a topic so broad that it can be easy to get so lost in revision that you want to give up.\nThe applied statistics part of this study guide will give you a very very strong foundation to get started with machine learning (which is basically just applied applied statistics written in fancy linear algebra), but there are certain key concepts that came up over and over again during my interviews. Here is a (by no means exhaustive) set of concepts organised by topic:\n\nMetrics — Classification\nConfusion Matrices, Accuracy, Precision, Recall, Sensitivity\nF1 Score\nTPR, TNR, FPR, FNR\nType I and Type II errors\nAUC-ROC Curves\n\nMetrics — Regression\nTotal sum of squares, explained sum of squares, residual sum of squares\nCoefficient of determination and its adjusted form\nAIC and BIC\nAdvantages and disadvantages of RMSE, MSE, MAE, MAPE\n\nBias-Variance Tradeoff, Over/Under-Fitting\nK Nearest Neighbours algorithm and the choice of k in bias-variance trade-off\nRandom Forests\nThe asymptotic property\nCurse of dimensionality\nModel Selection\nK-Fold Cross Validation\nL1 and L2 Regularisation\nBayesian Optimization\n\nSampling\nDealing with class imbalance when training classification models\nSMOTE for generating pseudo observations for an underrepresented class\nClass imbalance in the independent variables\nSampling methods\nSources of sampling bias\nMeasuring Sampling Error\n\nHypothesis Testing\nThis really comes under under applied statistics, but I cannot stress enough the importance of learning about statistical power. It’s enormously important in A/B testing.\n\nRegression Models\nOrdinary Linear Regression, its assumptions, estimator derivation and limitations are covered in significant detail in the sources cited in the applied statistics section. Other regression models you should be familiar with are:\nDeep Neural Networks for Regression\nRandom Forest Regression\nXGBoost Regression\nTime Series Regression (ARIMA/SARIMA)\nBayesian Linear Regression\nGaussian Process Regression\n\nClustering Algorithms\nK-Means\nHierarchical Clustering\nDirichlet Process Mixture Models\n\nClassification Models\nLogistic Regression (Most important one, revise well)\nMultiple Regression\nXGBoost Classification\nSupport Vector Machines\n\nIt’s a lot, but much of the content will be trivial if your applied statistics foundation is strong enough. I would recommend knowing the ins and outs of at least three different classification/regression/clustering methods, because the interviewer could always (and has previously) asked “what other methods could we have used, what are some advantages/disadvantages”? This is a small subset of the machine learning knowledge in the world, but if you know these important examples, the interviews will flow a lot more smoothly.\n\n5. Data Manipulation and Visualisation\n“What are some of the steps for data wrangling and data cleaning before applying machine learning algorithms”?\n\nWe are given a new dataset, the first thing you’ll need to prove is that you can perform an exploratory data analysis (EDA). Before you learn anything realise that there is one path to success in data wrangling: Pandas. The Pandas IDE, when used correctly, is the most powerful tool in a data scientists toolbox. The best way to learn how to use Pandas for data manipulation is to download many, many datasets and learn how to do the following set of tasks as confidently as you making your morning cup of coffee.\n\nOne of my interviews involved downloading a dataset, cleaning it, visualising it, performing feature selection, building and evaluating a model all in one hour. It was a crazy hard task, and I felt overwhelmed at times, but I made sure I had practiced building model pipelines for weeks before actually attempting the interview, so I knew I could find my way if I got lost.\n\nAdvice: The only way to get good at all this is to practice, and the Kaggle community has an incredible wealth of knowledge on mastering EDAs and model pipeline building. I would check out some of the top ranking notebooks on some of the projects out there. Download some example datasets and build your own notebooks, get familiar with the Pandas syntax.\n\nData Organisation\nThere are three sure things in life: death, taxes and getting asked to merge datasets, and perform groupby and apply tasks on said merged datasets. Pandas is INCREDIBLY versatile at this, so please practice practice practice.\n\nData Profiling\nThis involves getting a feel for the “meta” characteristics of the dataset, such as the shape and description of numerical, categorical and date-time features in the data. You should always be seeking to address a set of questions like “how many observations do I have”, “what does the distribution of each feature look like”, “what do the features mean”. This kind of profiling early on can help you reject non-relevant features from the outset, such as categorical features with thousands of levels (names, unique identifiers) and mean less work for you and your machine later on (work smart, not hard, or something woke like that).\n\nData Visualisation\nHere you are asking yourself “what does the distribution of my features even look like?”. A word of advice, if you didn’t learn about boxplots in the applied statistics part of the study guide, then here is where I stress you learn about them, because you need to learn how to identify outliers visually and we can discuss how to deal with them later on. Histograms and kernel density estimation plots are extremely useful tools when looking at properties of the distributions of each feature.\nWe can then ask “what does the relationship between my features look like”, in which case Python has a package called seaborn containing very nifty tools like pairplot and a visually satisfying heatmap for correlation plots.\nHandling Null Values, Syntax Errors and Duplicate Rows/Columns\nMissing values are a sure thing in any dataset, and arise due to a multitude of different factors, each contributing to bias in their own unique way. There is a whole field of study on how best to deal with missing values (and I once had an interview where I was expected to know individual methods for missing value imputation in much detail). Check out this primer on ways of handling null values.\n\nSyntax errors typically arise when our dataset contains information that has been manually input, such as through a form. This could lead us to erroneously conclude that a categorical feature has many more levels than are actually present, because “Hot”, ‘hOt”, “hot/n” are all considered unique levels. Check out this primer on handling dirty text data.\nFinally, duplicate columns are of no use to anyone, and having duplicate rows could lead to overrepresentation bias, so it’s worth dealing with them early on.\n\nStandardisation or Normalisation\nDepending on the dataset you’re working with and the machine learning method you decide to use, it may be useful to standardize or normalize your data so that different scales of different variables don’t negatively impact the performance of your model.\nThere’s a lot here to go through, but honestly it wasn’t as much the “memorise everything” mentality that helped me insofar as it was the confidence building that learning as much as I could instilled in me. I must have failed so many interviews before the formula “clicked” and I realised that all of these things aren’t esoteric concepts that only the elite can master, they’re just tools that you use to build incredible models and derive insights from data.\n\nBest of luck on your job quest guys, if you need any help at all please let me know and I will answer emails/questions when I can.",
            "spoiler": false,
            "stickied": false,
            "title": "The ultimate blueprint to getting a job in data science",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lar2us/the_ultimate_blueprint_to_getting_a_job_in_data/"
        },
        {
            "author": "u/acertenay",
            "created_utc": "03-11-2021 14:31:32",
            "distinguished": null,
            "edited": false,
            "id": "m2yn5l",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m2yn5l",
            "num_comments": 44,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m2yn5l/what_type_of_jobs_should_i_look_for_if_i_want_an/",
            "score": 27,
            "selftext": "I am almost burnt out making embedded software in C++. Its exhausting and challenging. I am looking for a change. I dont mind learning new technologies. \n\nI feel the happiest when I am working on something easy. Where I know exactly what to change and I can do it with plenty of time to spare. I had some of those days at my current job and I really loved those days. However most other days are shuffling through million+ lines of code to make embedded software for a large real time embedded system. I am exhausted.\n\nI am looking for a boring, easy job. I dont mind if have to churn out crud applications. Or make very si.ilar changes everyday.\n\nI am a senior engineer with C++ experience but I am open to working with c sharp. I am also open to working with databases.\n\nThe pay should be decent because I wanna live in london. \n\nHow do I start my job search? What type of companies should I look for? How should I filter job listing on LinkedIn? Currently I search for C++ or embedded software engineer.\n\nI know what I want but dont know how to search for it.",
            "spoiler": false,
            "stickied": false,
            "title": "What type of jobs should I look for if I want an \"easy\" programming job?",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m2yn5l/what_type_of_jobs_should_i_look_for_if_i_want_an/"
        },
        {
            "author": "u/bears_arms",
            "created_utc": "03-15-2021 22:29:54",
            "distinguished": null,
            "edited": false,
            "id": "m5ywk6",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m5ywk6",
            "num_comments": 35,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m5ywk6/unethical_to_leave_job_shortly_after_former/",
            "score": 23,
            "selftext": "A fellow coworker quit a few weeks ago--he was one of the 2 most senior engineers on our team. We're still looking for his replacement, but have no potential candidates at the moment.\n\nThe thing is, before he left I was already casually looking at other jobs, but had only had one phone screen. However this week things have ramped up and I have a few more phone screens scheduled.\n\nWe're a pretty small team, only 6 engineers at the moment including myself. If anyone else left I think the company would really be in a pickle. It already feels like we have a skeleton crew. In a way I feel like my company did this to themselves by letting other engineers leave without replacing them. Our team used to be almost twice as large.\n\nIf I quit I would give them notice of course, but is it unethical to leave while we're already down a person?\n\nIf I am offered a new position, should I ask my boss if he can match the offer? Or is it unethical to leverage an offer like that?\n\nI am thinking none of this is unethical, but curious what others think.",
            "spoiler": false,
            "stickied": false,
            "title": "Unethical to leave job shortly after former coworker?",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m5ywk6/unethical_to_leave_job_shortly_after_former/"
        },
        {
            "author": "u/GarudaSmash",
            "created_utc": "03-13-2021 18:58:31",
            "distinguished": null,
            "edited": "03-15-2021 23:33:27",
            "id": "m4ixuo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_m4ixuo",
            "num_comments": 16,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m4ixuo/recent_cs_bachelors_graduate_no_job_experience/",
            "score": 82,
            "selftext": "I know this isn't uncommon, but there are some specific things I want to note if they matter:\n\n* In my late-20's, graduated from the CS Online program at CSU Monterey Bay in August 2020, and I have an AS in Computer Science at Cuesta College.\n* Ideally, would develop video games and self-publish them as a career. I'm aware this isn't particularly feasible, though.\n* No job experience, just volunteer work at humane societies years ago.\n* Didn't make any worthwhile projects on the side while in school. Currently, I'm trying to come up with projects to put on GitHub.\n* On the autism spectrum, high-functioning. I'm often prone to sensory overload, but it's improved greatly. I also don't live independently, and I rely on subsidized income.\n* Dealing with poor self-esteem and lack of confidence. Anxiety and depression can often be very overwhelming. I am medicated, though.\n* Although I worked with a great group throughout my university program, I prefer working alone. I feel like I think and work too slowly no matter how hard I try, which raises my anxiety immensely. Generally, I'm not a very social person.\n* I enjoy programming and learning about data structures. That was my favorite part. Databases never really clicked for me, but maybe that could change.\n* Proficient in Java, actively learning C++ and sometimes Python. Working on a text-based adventure game in C++. I'm also learning to develop C++ projects in Unreal.\n* I believe my greatest strength is perseverance even when things feel utterly hopeless. I'm often told that I'm logical and creative, even though I don't really see it. My grades were good, but not amazing.\n* This is slightly off-subject, but it's important to me: I've been in a long-distance relationship for several years, and we've visited many times. She lives in Ontario, Canada, I live in California. We badly want to live together and marry. She doesn't have her own place yet, either.\n\n&#x200B;\n\nSorry if the details are excessive or too personal. I just want to paint a clear picture before I ask the following:\n\n1. Do you have any ideas for what kind of job positions I should seek? If I can avoid unpaid internships, that'd be preferable, but I understand if that's not feasible. Remote is preferred, even if the pandemic passes.\n2. What do you suggest for someone who isn't comfortable working in groups? How can I improve? Can I do something more independent?\n3. How should I go about making a portfolio? Would it be worthwhile to make my own website with some nice CSS or just stick with GitHub?\n4. After covid-related restrictions can be lifted (hopefully), I want to move to Ontario with my girlfriend. Could a tech position somehow ease the immigration process?\n\n&#x200B;\n\nI know this post is long, but I thank you very much for your time. Please let me know if this violates the subreddit rules in any way, sometimes I miss very obvious details. I'll try to answer any questions.\n\nEDIT: Thanks for your thoughtful feedback. It looks like I'm on the right track, I just need to take any position I can and see where it leads me. The prospect of neurodiversity hiring is especially interesting, though I understand how joining a sporting team would magically solve all my problems.",
            "spoiler": false,
            "stickied": false,
            "title": "Recent CS bachelor's graduate, no job experience, feeling lost",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m4ixuo/recent_cs_bachelors_graduate_no_job_experience/"
        },
        {
            "author": "u/lordenippls",
            "created_utc": "12-28-2020 16:02:03",
            "distinguished": null,
            "edited": false,
            "id": "klyxns",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_klyxns",
            "num_comments": 387,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/klyxns/new_grads_dont_worry_too_much_about_the_perfect/",
            "score": 1433,
            "selftext": "I am an ex-big 4 worker, and I must say, that place was hell. As a new grad coming from a mediocre school and only a couple small internships, getting a job at \\[biggest cloud company in the world\\] was a dream! I worked extremely hard preparing for interviews my whole senior year and I thought I was going to be set for the rest of my life.\n\nLuckily, when I got to Seattle, I came to an org that was in the middle of being disassembled from the top to the bottom. I had an extremely incompetent manager who was just looking out for himself, a team of engineers who preferred to speak in Mandarin over English, and not a single piece of documentation for our code base.\n\nThe cherry on top was my first conversation with my manager was \"we can hire SDE1's at anytime, so you are not that useful until you can get to SDE2\".\n\nAfter not having a single day of vacation for over a year (yes I worked on Christmas thanks to the company's oncall 24/7 policy!), half my team moving to other companies, and a manager change, I was put on the bottom of my team's ranking list because I had the least amount of experience. At the end of the day, you are worth as much as the years on your resume, how else is a manager that doesn't know you suppose to rank you amongst everyone else at a company that requires rankings? It was devastating to me that after working so hard work (at an estimated average of 50 to 60 hours a week), that it didn't matter.\n\nThis was all almost a year ago now, but I have been at my new company and, even though the work is not as difficult, I am not having constant panic attacks to get stressful, mismanaged work done.\n\nThis work force will chew you up, and I see a lot of new grad peers constantly stressing out about getting that perfect job. The only thing that matters is working somewhere that is not bad for your health. Literally just being in this industry for multiple years will get you more than enough money, you don't need to be a \"rockstar\", that is all just marketing/recruiter BS.",
            "spoiler": false,
            "stickied": false,
            "title": "New Grads: don't worry too much about the perfect first job",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/klyxns/new_grads_dont_worry_too_much_about_the_perfect/"
        },
        {
            "author": "u/throwaway081569420",
            "created_utc": "01-25-2021 08:19:45",
            "distinguished": null,
            "edited": false,
            "id": "l4npdw",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_l4npdw",
            "num_comments": 120,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/l4npdw/started_job_school_at_28_graduated_at_30_now_32/",
            "score": 681,
            "selftext": "Warning, this is kinda long, I'm trying to give an overview of my current situation:\n\nAfter a somewhat problematic life that wasn't exactly going according to plan (depression, just barely graduated from school etc.),\nI managed to finally do job training and get a formal career going.\nBack then, I was hired by my current employer through a\nstate subsidy where the company only had to pay a couple bucks per month for me, while the rest came from the gov, so they had little risk in hiring me.\n\nThe IT situation in the company back then was:\n\n* 1 freelancer who was my job trainer \"on paper\" but he's 100s of km away and only visited in-house like once a month before corona.\n\n* 1 super hyper nerd just a bit younger than me who was more on the admin side, he was here around 2 days a week - he set up most of the virtualized environment here with VMware, different windows and unix servers, all of our IT is currently hosted in-house. It's pretty old and outdated by now, too expensive to replace, too spaghetti to migrate...\n\n\nWell, fast-forward 4 years, I finished job training 2 years later (with an A), got hired full-time, the super nerd left the company 1.5ish years ago to study IT at uni full-time and he won't be coming back.\n\nSo basically, I'm THE IT GUY in my company now, my \"job trainer\" can assist in case of emergency, but I'm mostly managing everything alone, doing both admin and programming work.\n\nThere are multiple areas of concern for me now:\n\n* I'm pretty sure I'm horribly underpaid\n\n* All the responsibility is on my shoulders, I'm the de-facto IT lead due to being the only IT guy, but at the same time, bosses treat me like just another paper-pusher\n\n* Both bosses have little understanding for IT, don't know how much effort it takes to keep everything running while not screwing up (on the plus side, they rarely put deadlines) - they only care about results\n\n* What if the inhouse system fails? It feels like being on a sinking boat, constantly plugging holes.\n\n* I'm not getting any outside input to develop my skills. Everything is self-taught, I maintain and extend super old (e.g. PHP5) legacy code, no frameworks etc.\n\n* I feel like getting a new position \"in the industry\" will be impossible? Every job offer wants a billion different frameworks, I applied to one job that wanted exactly what I know, wasn't even invited to an interview. Disheartening. Probably because of the gappy CV (did this-n-that from 21 to 28).\n\n\nI managed to pick up the following skills by myself in the past 4 years (very loosely ordered by skill): HTML, CSS, JS, PHP, mySQL/PostgreSQL, regex, vim, Python, Windows administration, Webhosting (Apache), Exchange, VMware, Linux administration, Firewalls\n\nPlus of course I solve user problems all day.\n\nI feel like it's an okay skillset, but job offers always seem to want so much more. On the other hand, I feel lacking in other areas:\n\nWe don't have a version control system, I don't know a lot about typical CS theory questions like algorithms and data structures, as I've never needed them so far...then there's the whole teamwork aspect, I've never coded in a team since I'm alone. No \"unit tests\", QA, scrum, agile, all of this stuff.\n\nOn the plus side, I managed to \"not screw up production\" for these 4 years.\n\n\nBasically, I don't know what to do at this point. The responsibility is a bit much, the pay not adequate considering it. And there's not much to do (programming-wise) for the past year or so. I mostly browse reddit or learn more about programming. But time doesn't fly for sure, I feel a bit bored sitting around here 8h every day. At the same time, I feel like I'm getting less and less employable by other companies. Most of my worth here is company-knowledge...\n\nStarting at another company would probably offer me considerably more benefits in vacation and money - but it'll also mean losing a relatively safe job and becoming a \"replaceable little guy\". My constant flip-flopping between delusions of grandeur and impostor syndrome doesn't help matters at all :(\n\n\nAnyone can offer me some advice? Thank you.",
            "spoiler": false,
            "stickied": false,
            "title": "Started job school at 28, graduated at 30, now 32, have become \"the guy who shouldn't be hit by a bus\" at my company. Scared I won't find anything else... Advice?",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l4npdw/started_job_school_at_28_graduated_at_30_now_32/"
        },
        {
            "author": "u/cognitivelycongested",
            "created_utc": "03-18-2021 11:26:45",
            "distinguished": null,
            "edited": false,
            "id": "m7t9cv",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m7t9cv",
            "num_comments": 17,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m7t9cv/im_a_student_who_got_a_job_as_a_part_time_web/",
            "score": 30,
            "selftext": "Hello everyone!\n\nI got a kickass job working for my University's social science research center helping them update their site, among other things. I work under their department's full time developer.\n\nThis is my third week working here, and I'm kind of lost. The first two weeks was just catching me up, setting up Docker and Drupal, and navigating Drupal. I was honest with my boss during the interview when I said I was still learning Javascript, but had spent the past year learning a lot about web development.\n\nHow do I go about working a job where the learning curve is steep? Especially when it's a part time one? Anyone have anecdotes or advice?",
            "spoiler": false,
            "stickied": false,
            "title": "I'm a student who got a job as a part time web developer at my University, and I feel like I know nothing.",
            "upvote_ratio": 0.87,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m7t9cv/im_a_student_who_got_a_job_as_a_part_time_web/"
        },
        {
            "author": "u/hijinked",
            "created_utc": "01-12-2021 13:27:30",
            "distinguished": null,
            "edited": false,
            "id": "kvxeoa",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_kvxeoa",
            "num_comments": 177,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/kvxeoa/opinion_its_okay_to_take_the_job_that_pays_more/",
            "score": 1235,
            "selftext": "I just read a post that criticized employees who focus on salary over job satisfaction and I wanted to offer a rebuttal.  You can read the tl;dr at the bottom but I have a story that explains my opinion.\n\nAt the very beginning of 2019 I was faced with a choice. I could stick with a job that I enjoyed with a team of amazing engineers where I was learning a lot and meaningfully contributing to a worthwhile project.  Or I could take a job offer I received for about 50% increased total compensation with great benefits doing more boring work.  I took the new job. It wasn't that I was underpaid by my previous employer, it's just that the offer was for a contracting job in a particularly lucrative niche.\n\nAfter giving two weeks notice to my boss I made a comment in passing to the effect of \"I'm sure I won't like the new job as much but I need to do what's best for my family.\" Well he latched on to that and we had a conversation where he said \"you shouldn't just take a job for the money.\"  He said it in a way that wasn't attacking my decision but was just giving career advice and it really made me question my choice.\n\nWell about a month and a half into the new job my state announced its COVID stay-at-home order.  My wife and I did some last minute grocery shopping and as we are walking from the car to our front door we are mugged at gunpoint by two men.  They take our wallets, phones, and even my car (which was thankfully recovered but needed repairs). My wife's little sister was staying with us at the time so we made the decision to immediately relocate to a safer area.\n\nBetween replacing our phones, the mechanic bill, early lease termination, and relocating costs this was a very expensive ordeal.  We have been living paycheck-to-paycheck since then while our finances stabilize.  If I hadn't taken the higher paying job then I wouldn't have been able to move to a safer neighborhood and I would have to live knowing that my wife and our family could be looking at a gun any time we walked out the door. \n\nSo the beliefs that I now hold, and **here's the tl;dr:**\n\n* Money is *safety*\n* More money means the ability to:\n   * live in a safe area\n   * pay for medical costs (we are in the US)\n   * purchase security equipment (home security cameras, etc)\n   * respond to unforeseen expenses like car problems\n\nI will never fault a coworker or employee for switching jobs to earn more money.  It may sound dramatic, but quite literally their life could depend on it.",
            "spoiler": false,
            "stickied": false,
            "title": "Opinion: It's okay to take the job that pays more",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kvxeoa/opinion_its_okay_to_take_the_job_that_pays_more/"
        },
        {
            "author": "u/cheeseyams",
            "created_utc": "02-24-2021 20:17:09",
            "distinguished": null,
            "edited": false,
            "id": "lrt76u",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lrt76u",
            "num_comments": 43,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lrt76u/applied_for_a_job_went_through_a_coding_exam_that/",
            "score": 104,
            "selftext": "My SO applied for a Front End Dev position at a super startup   and went through 3 (unnecessary) total behavioral interviews and 1 technical interview that basically had him build a portion of their web app. It was a three day build, over 25 hours long and he sent it to the company with flying colors. After another behavioral, they offered him the position but as an unpaid internship, with a verbal offer of a paid contract (they didn't want to put it in writing) after 3 months and maybe equity.\nThe people who interviewed him was a 30 something dude from SF  but originally from Turkey and called himself the CEO and a 20 something recent CS grad who was the \"CTO\" from the Midwest. When my SO asked for seed money information etc and where they are at, the CEO responded that he is in the middle of getting funding and can't pay people until then. CEO also expected the interns to work at least 50 hours per week until launch of their product. His last email before my SO declined was, \"let me know if you have any questions that I can answer to put you at ease.\"\n\nLinkedin says the company has about 10-14 employees, all with the suffix of intern in their roles \"Social Media Intern\", \"Software Engineer Intern\", and they lived double lives as college students and baristas, minus the CEO and CTO. \n\nThe weird part was that they seemed legit from the start with a couple of articles about them on MarketWatch.\n\nAnyone else went through this type of shitfest on interviews for tech roles? \n\nTo add some context on my SO- he has about 1.5 years of Front end Dev experience working as a contractor on multiple projects and was looking for the full time experience.",
            "spoiler": false,
            "stickied": false,
            "title": "Applied for a job, went through a coding exam that built a portion of their software, only to be offered an unpaid internship and expected to work 50+ hours a week.",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lrt76u/applied_for_a_job_went_through_a_coding_exam_that/"
        },
        {
            "author": "u/NastyNas0",
            "created_utc": "03-22-2021 16:08:09",
            "distinguished": null,
            "edited": false,
            "id": "mawp33",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mawp33",
            "num_comments": 16,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/mawp33/i_hate_my_current_software_developer_job_even/",
            "score": 15,
            "selftext": "I'm a Software Developer at an average company. I never have to work more than 40 hours a week, and the pay is average. If working at a grocery store paid the same as this, I think I would rather do that than work as a developer. Being a developer stresses me out way more, and I constantly feel like I'm in over my head, and that I won't be able to do this for a whole career. Last year's performance review was bad, so it's not impostor syndrome. I've been a dev for about 2 years, and was in QA for a year before that (being a dev is marginally less terrible than QA).\n\nI can't tell if I'm just not smart enough for this job or what. Where do I find a career that isn't so miserable all the time? I just don't care about my job or my company at all. How am I supposed to enjoy being a cog in the machine at some random company?",
            "spoiler": false,
            "stickied": false,
            "title": "I hate my current Software Developer job even more than I hated working at a grocery store in high school. What's wrong with me?",
            "upvote_ratio": 0.72,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mawp33/i_hate_my_current_software_developer_job_even/"
        },
        {
            "author": "u/RainMan214",
            "created_utc": "03-17-2021 21:50:08",
            "distinguished": null,
            "edited": false,
            "id": "m7gbrf",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m7gbrf",
            "num_comments": 34,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m7gbrf/how_many_applications_did_it_take_before_you_got/",
            "score": 9,
            "selftext": "At this point I’ve built up a decent enough portfolio and I’m applying to literally anything that remotely matches my skill set while I practice algorithmic problems. \n\nIts been about 2 weeks since I resumed applying and I think I might be somewhere between 2-300 applications in.\n\nGoldman Sachs sent the hackerrank and I failed it, but I’m not even mad because I actually did end up solving one of the questions on my own. It just took me another hour additional hour after the hackerrank had already ended 😂  If anything that’s just proof the hours I’ve spent learning JavaScript & grinding algos weren’t a waste. Plus if they saw my portfolio & sent the hackerrank that means my portfolio is actually might be worth a shit. All that’s left to do now is improve. \n\nI’m mentally prepared to do this shit everyday until something shakes. It’s job offer or bust and I’m not about to bust.",
            "spoiler": false,
            "stickied": false,
            "title": "How many applications did it take before you got your first job?",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m7gbrf/how_many_applications_did_it_take_before_you_got/"
        },
        {
            "author": "u/no_gpu",
            "created_utc": "02-16-2021 10:29:17",
            "distinguished": null,
            "edited": false,
            "id": "ll668i",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_ll668i",
            "num_comments": 62,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/ll668i/how_are_people_with_6_months_2_years_of/",
            "score": 139,
            "selftext": "I'm a software/data engineer with 2 years of experience. I am lucky to still be employed, but I really want to move closer to my family and friends from college.\n\n\n\n\nI'm not having a great time with the job market, as I am noticing that I am in this position where a lot of senior developers are applying for mid-level roles and I am not eligible for new grad roles either.\n\n\n\n\nShould I even bother looking for a new job in this economy? Should I just relax after work hours instead and find ways to learn more through online classes, instead of applying for jobs that will reject me.",
            "spoiler": false,
            "stickied": false,
            "title": "How are people with 6 months - 2 years of experience navigating the job market?",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ll668i/how_are_people_with_6_months_2_years_of/"
        },
        {
            "author": "u/i_am_old_mold",
            "created_utc": "03-15-2021 10:01:47",
            "distinguished": null,
            "edited": "03-16-2021 07:28:57",
            "id": "m5lcgw",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m5lcgw",
            "num_comments": 20,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m5lcgw/which_cs_jobs_are_repetitive_and_dont_give_you/",
            "score": 23,
            "selftext": "Hi, I'm a senior in college majoring in CS.  Through experience I found out that I don't do well when given too much freedom on a project, and that I am better at following directions and doing repetitive work.  What kind of programming jobs/fields could I look into?\n\n&#x200B;\n\nedit - Thank you all for your input.  I have a better understanding of what direction I should go to now.",
            "spoiler": false,
            "stickied": false,
            "title": "Which CS jobs are repetitive and don't give you freedom?",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m5lcgw/which_cs_jobs_are_repetitive_and_dont_give_you/"
        },
        {
            "author": "u/mrdeadsoul",
            "created_utc": "03-05-2021 03:23:56",
            "distinguished": null,
            "edited": false,
            "id": "ly7feg",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_ly7feg",
            "num_comments": 46,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/ly7feg/is_it_actually_that_hard_to_find_a_job_as_a_cs/",
            "score": 29,
            "selftext": "I thought its a in-demand job? Studying CS isn't easy and obviously not everyone can take it, yet it's that hard to find a job as a CS graduate then shouldn't other easier careers be even worse off?",
            "spoiler": false,
            "stickied": false,
            "title": "Is it actually that hard to find a job as a CS graduate?",
            "upvote_ratio": 0.81,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ly7feg/is_it_actually_that_hard_to_find_a_job_as_a_cs/"
        },
        {
            "author": "u/billygoat7777",
            "created_utc": "03-17-2021 20:09:51",
            "distinguished": null,
            "edited": false,
            "id": "m7egwy",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m7egwy",
            "num_comments": 14,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m7egwy/landed_my_first_job/",
            "score": 31,
            "selftext": "I’ve been lurking here for a few months now as I’ve been job hunting the last several months and I finally landed a SWE position after a couple hundred applications. I’m super excited about it and I wanted to let those that are still hunting know that there is light at the end of the tunnel! \n\nA little bit about me, I graduated in May 2020 with a B.S. in CS and having just completed a 9 month internship at a large company. Due to the pandemic I was unable to convert that internship to a full time position and had little luck with other applications/ was so burnt out from remote school and my internship. So I took a small break and did some seasonal work for the summer while I slowly applied to more positions. Fall rolled around, the seasonal work ended and Since I have probably applied to close to 300+ jobs. After a handful of failed tech screens and a couple of different interviews,  I made it through 4 rounds for the position I accepted today. If at all possible leverage connections at the places you’re applying. friends, classmates, and alumni were all super helpful answering questions, or referring me to the recruiters. And ultimately just being myself and showing my passion and excitement for the field is what got me the offer. \n\nSo for those still on the grind, you’ve got it, don’t give up, and keep on trying! You’ll get it!",
            "spoiler": false,
            "stickied": false,
            "title": "Landed my first job!",
            "upvote_ratio": 0.81,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m7egwy/landed_my_first_job/"
        },
        {
            "author": "u/Lost-Possibility-702",
            "created_utc": "03-15-2021 12:51:42",
            "distinguished": null,
            "edited": false,
            "id": "m5p373",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_m5p373",
            "num_comments": 20,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m5p373/leaving_a_job_i_just_started/",
            "score": 23,
            "selftext": "I was interviewing and I took a position with Company A. During Company A's background screening I was still interviewing with other companies.\n\nI got a much better offer at Company B but their background screening took so long bc there was complications with verification of past employment so I didnt wanna renege my offer at Company A bc I am unemployed and didnt wanna lose it.\n\nUnfortunately it took so long that I started at Company A already, when the background check went through for Company B and I was offically given the OK for my start date at Company B.\n\nIs there anyway to quit gracefully or is this a badly burned bridge?",
            "spoiler": false,
            "stickied": false,
            "title": "Leaving a job I just started...",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m5p373/leaving_a_job_i_just_started/"
        },
        {
            "author": "u/unknowndeveloper1",
            "created_utc": "03-17-2021 17:28:24",
            "distinguished": null,
            "edited": "03-18-2021 11:34:55",
            "id": "m7b5zk",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m7b5zk",
            "num_comments": 11,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m7b5zk/i_got_a_job/",
            "score": 41,
            "selftext": "3 months of searching and applying to hundreds of applications has finally paid off. I feel like I owe this community a huge thank you, since what kept me going are posts like what I'm doing right now! \n\nI suggest all of you that are still searching to, again, stick with it! It is a really, really tough market. And even me with nearly 10 years of experience, it still took nearly 3 solid months. \n\n\nI'm on mobile right now, but there was a post on reddit I came across that helped me a ton with my resume. I'll update my post later when I find it but it was from a small business owner and they posted a really good template.\n\nI really feel for anyone just starting their career right now, which from the posts I've seen on here, are a ton of you. I hope luck finds you.\n\nUPDATE:\nLink to the resume post that helped me:\nhttps://www.reddit.com/r/jobs/comments/7y8k6p/im_an_exrecruiter_for_some_of_the_top_companies/\n\nUPDATE AGAIN:\n\nAnother thing I wanted to add that helped me to a degree. I typically take Glassdoor reviews with a grain of salt, but reading through them can give you an idea of what the company values and maybe help you just a little more on your interview prep. One thing that I found helpful for bigger companies I interviewed for was to look at the \"Interviews\" section in GlassDoor. Search by \"Job Titles\" and hopefully you can at least get a few of the questions they might be asking you in your interview.",
            "spoiler": false,
            "stickied": false,
            "title": "I got a job!",
            "upvote_ratio": 0.81,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m7b5zk/i_got_a_job/"
        },
        {
            "author": "u/Sendmebobs",
            "created_utc": "03-06-2021 17:21:48",
            "distinguished": null,
            "edited": false,
            "id": "lzcnhu",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_lzcnhu",
            "num_comments": 69,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lzcnhu/what_do_you_find_hardest_a_job_or_college/",
            "score": 7,
            "selftext": "I'm on my last semester and because of covid my teachers have gone insane. I have 3 new 30h projects every single week and I'm stressing out. I feel like if a job is going to be as demanding as this semester I can't really continue.\nI don't even get taught anything, I just get redirected to existing online courses and tutorials.\nBeing home all the time isn't helping either.",
            "spoiler": false,
            "stickied": false,
            "title": "What do you find hardest, a job or college?",
            "upvote_ratio": 0.74,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lzcnhu/what_do_you_find_hardest_a_job_or_college/"
        },
        {
            "author": "u/sir-codesalot",
            "created_utc": "03-21-2021 18:57:18",
            "distinguished": null,
            "edited": false,
            "id": "ma8gqo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ma8gqo",
            "num_comments": 15,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/ma8gqo/best_way_to_prepare_for_java_backend_engineer_job/",
            "score": 12,
            "selftext": "Hi,  \n\n\nI recently landed a job at an internet startup as a Java backend engineer. This is somewhat of a career pivot for me since I have been working as a data scientist who's been using C++ and python.  \n\n\nCan someone please recommend me best materials to prepare myself for a soft landing on the job? Any recommendations such as books or online courses would be appreciated.\n\n&#x200B;\n\nFor context, I have 4 YOE, and I'm not very familiar with internet system infra like databases and web servers. I just have a high level understanding by studying through books and youtube. That being said, I will be working less on the infra side and more on the application side.",
            "spoiler": false,
            "stickied": false,
            "title": "Best way to prepare for Java backend engineer job?",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ma8gqo/best_way_to_prepare_for_java_backend_engineer_job/"
        },
        {
            "author": "u/parrotttttyay",
            "created_utc": "03-10-2021 15:56:05",
            "distinguished": null,
            "edited": false,
            "id": "m289ci",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m289ci",
            "num_comments": 22,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m289ci/how_can_i_demonstrate_that_i_can_work_in_an_agile/",
            "score": 32,
            "selftext": "As someone that is shifting careers with a library of unique personal projects... I'm not entirely sure how to demonstrate that I can work in an AGILE environment.\n\nAll help is appreciated!",
            "spoiler": false,
            "stickied": false,
            "title": "How can I demonstrate that I can work in an AGILE environment without ever working a CS job previously.",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m289ci/how_can_i_demonstrate_that_i_can_work_in_an_agile/"
        },
        {
            "author": "u/Hembhorg",
            "created_utc": "03-12-2021 13:04:52",
            "distinguished": null,
            "edited": false,
            "id": "m3naa6",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m3naa6",
            "num_comments": 25,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m3naa6/job_recommendations_for_the_nonpassionate/",
            "score": 14,
            "selftext": "I've worked as a software developer for a consumer electronics company for a couple years. Overall, I can't say I've really enjoyed the experience. I'm not very excited for either the work I'm doing or the products we're making. And I feel a bit out of place considering that most people in the company are passionate about the work they do. \n\nI'm looking for a new job, and most software openings talk about being passionate about certain technologies or thriving in a fast-paced environment. To be honest, I don't really care all that much about any of that stuff. I just want to do my job, have a good work/life balance, make money, and be surrounded by decent people at work. \n\nAre there are sorts of software jobs that are geared more toward what I'm looking for than others? I'm getting the  feeling that working for a startup may not be so promising (a greater need for passionate people willing to work long hours). \n\nThanks in advance!",
            "spoiler": false,
            "stickied": false,
            "title": "Job recommendations for the non-passionate software developer?",
            "upvote_ratio": 0.86,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m3naa6/job_recommendations_for_the_nonpassionate/"
        },
        {
            "author": "u/avocadoroom",
            "created_utc": "03-11-2021 02:21:44",
            "distinguished": null,
            "edited": false,
            "id": "m2kiez",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_m2kiez",
            "num_comments": 31,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m2kiez/my_dad_is_getting_laidoff_from_a_job_hes_worked/",
            "score": 17,
            "selftext": "My dad has been in software longer than I've been alive, today he got the message that his job is being shipped off overseas and that he'll be laid off. He's almost 60\n  \nHe has so much experience with software (not too sure of the language). I've told him to apply to places like Amazon/Microsoft etc but he's reluctant and says \"you think it's so easy huh\"..... I just want him to apply.\n  \nHe says he needs a job ASAP but doesn't want to work software again, I tell him that software is your best bet.\n  \nWhat advice can you recommend and where do we go from here?",
            "spoiler": false,
            "stickied": false,
            "title": "My dad is getting laid-off from a job he's worked at his entire life, what tips can you give him?",
            "upvote_ratio": 0.78,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m2kiez/my_dad_is_getting_laidoff_from_a_job_hes_worked/"
        },
        {
            "author": "u/Offintotheworld",
            "created_utc": "02-15-2021 17:28:09",
            "distinguished": null,
            "edited": false,
            "id": "lkox2s",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Meta",
            "locked": false,
            "name": "t3_lkox2s",
            "num_comments": 78,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lkox2s/how_did_life_change_for_you_when_you_got_your/",
            "score": 51,
            "selftext": "Currently pursuing my CS degree and am very stressed. I love coding and I am making the right choice, but am having all sorts of existential angst right now. I don't know if this is appropriate for this subreddit, but I'd like to hear stories of what it was like when you \"made it\" so to speak, when you went from being a broke student or working a shit job, to getting hired somewhere that paid you a  livable salary. I could use some motivation haha.",
            "spoiler": false,
            "stickied": false,
            "title": "How did life change for you when you got your first well-paying job?",
            "upvote_ratio": 0.86,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lkox2s/how_did_life_change_for_you_when_you_got_your/"
        },
        {
            "author": "u/HousePappas",
            "created_utc": "03-19-2021 22:54:06",
            "distinguished": null,
            "edited": false,
            "id": "m8xxdh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_m8xxdh",
            "num_comments": 20,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m8xxdh/how_much_base_knowledge_for_an_entry_level_job/",
            "score": 7,
            "selftext": "I'm got a real good grasp on classes and structures and other aspects of OOP in c++. Is this enough to start applying for entry level jobs? I know there's a wealth more of knowledge to learn I was just wondering what is the base for entry level developers?",
            "spoiler": false,
            "stickied": false,
            "title": "How much base knowledge for an entry level job?",
            "upvote_ratio": 0.67,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m8xxdh/how_much_base_knowledge_for_an_entry_level_job/"
        },
        {
            "author": "u/Trick-Code-7823",
            "created_utc": "03-16-2021 08:33:47",
            "distinguished": null,
            "edited": false,
            "id": "m6814z",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m6814z",
            "num_comments": 19,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m6814z/do_i_really_need_to_switch_jobs_all_the_time/",
            "score": 15,
            "selftext": "I work at a smallish startup. Well funded, and it has grown tremendously since I started working their a little over 2 years ago. Despite some COVID troubles we're still going strong and future outlook is good.  I started in a pretty junior position but in that time my skillset and responsibilities has grown a ton. \n\n&#x200B;\n\nPart of me is super stressed out about this seeming imperative that devs should change companies every 2 years in order to progress in their career, bump their salary, and not be seen as a \"hanger-on\" afraid of change. I also think that while I still have some upward mobility, my growth is leveling out at this company.\n\n&#x200B;\n\nAnother part of me is very happy with my job. I adore my coworkers, great leadership, I enjoy the work, the company culture, and I have a vested interest in seeing the company succeed (i.e., options), which I think is a strong possibility.\n\n&#x200B;\n\nFor record, I am making 115k/yr in Canada, with a bump expected in the next month or so. I started my job with this company at 90k. I've been a software dev for a little under 4 years professionally in total.\n\n&#x200B;\n\nCan anyone offer me some sagely advice? This has been a huge source of anxiety for me. I am just so torn between not wanting to take what I have for granted and wondering if I am screwing myself. If not leaving outright, do you have advice on how to better position myself within my current company? Thanks for reading.",
            "spoiler": false,
            "stickied": false,
            "title": "Do I really need to switch jobs all the time?",
            "upvote_ratio": 0.86,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m6814z/do_i_really_need_to_switch_jobs_all_the_time/"
        },
        {
            "author": "u/Happens_2u",
            "created_utc": "03-19-2021 17:35:29",
            "distinguished": null,
            "edited": false,
            "id": "m8rqdd",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_m8rqdd",
            "num_comments": 21,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m8rqdd/about_to_graduate_with_computational_chemistry/",
            "score": 6,
            "selftext": "I posted something similar about 6 months ago and got no responses.\n\nI have been programming python for 4 years (with a smattering of other languages) and have taken a number of scientific computing classes, and I also have a CS minor.\n\nI am about to graduate from UT Austin and I got into the masters programs at UT Dallas and A&M (potentially more to come). I could also do a second bachelors in CS at UT Dallas. \n\nThe only thing I can say I definitely don’t want to do is web development. Which it seems is what most bootcamps target.\n\nAny advice?",
            "spoiler": false,
            "stickied": false,
            "title": "About to graduate with computational chemistry degree and CS minor, do I do a CS Masters, 2nd bachelor’s, or apply to jobs as-is?",
            "upvote_ratio": 0.68,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m8rqdd/about_to_graduate_with_computational_chemistry/"
        },
        {
            "author": "u/2006Scaper",
            "created_utc": "01-05-2021 11:39:14",
            "distinguished": null,
            "edited": false,
            "id": "kr20es",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_kr20es",
            "num_comments": 252,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/kr20es/how_unique_is_my_job_situation/",
            "score": 556,
            "selftext": "Hi all. I work for an all remote team as a web dev doing mostly front end work. I've been at my current company for 2 years and I'm ready to search for something new in hopes of a higher salary, however I'm not sure if what I'm giving up is 'rare' or not as I've only worked for two companies so far in my career.\n\nTo be specific, the pros/cons of my job situation are:\n\nPros\n\n1. In a typical week I spend only around 28-30 hrs at my computer. The extra 10-12 hours are spent working out, eating lunch, etc\n2. Work is almost always no pressure, I often do all of the time estimation for my tickets and can decide how long I think it will take to get something done. I have never been told to work faster, or had my performance criticized\n3. It is very rare for me to have to be in any meetings other than 30 minutes of a daily standup call in which I rarely have to participate\n4. I’ve never been contacted outside of work hours or asked to work over time, and I’m not required to be on call\n5. When doing front end work, I make design choices almost entirely on my own\n6. I work with modern technologies\n7. I never have any issues with my coworkers or team lead. I can go to anyone for help and they will do their best to tackle whatever problem I’m having with me\n8. I’m never asked to do anything out of my job description\n\nCons\n\n1. I make $80k/yr, changing companies would likely make me quite a bit more than a raise ever could (but for the hours I'm *actually working,* could I even consider myself underpaid? I'm not sure)\n2. Neither the benefits nor the 401k match are very good\n3. I live in a high cost of living area due to my S/O's schooling, and won't be moving for a few years. I like to save as much as possible every month, and my salary being lower than the area's average pay doesn't do me any favors\n\n**TLDR**: I feel I have a good work/life balance that I am afraid to give up in exchange for more money, which won't even make me happier. Has anyone been in a similar situation? How did you handle it? How unique is my current work situation?\n\nAlso, it might be worth noting that I am only interested in working for all remote companies\n\nThank you",
            "spoiler": false,
            "stickied": false,
            "title": "How unique is my job situation?",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kr20es/how_unique_is_my_job_situation/"
        },
        {
            "author": "u/redalenti",
            "created_utc": "02-21-2021 14:25:16",
            "distinguished": null,
            "edited": false,
            "id": "lp4gl5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lp4gl5",
            "num_comments": 49,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lp4gl5/what_are_the_best_career_pathsjobsare_of/",
            "score": 54,
            "selftext": "Like python is clearly for AI, Javascript for web, what's the best best programming areas for C/C++?",
            "spoiler": false,
            "stickied": false,
            "title": "What are the best career paths/jobs/are of expertise for C/C++?",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lp4gl5/what_are_the_best_career_pathsjobsare_of/"
        },
        {
            "author": "u/ScrappyHaxor",
            "created_utc": "01-06-2021 15:06:36",
            "distinguished": null,
            "edited": false,
            "id": "krw044",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_krw044",
            "num_comments": 183,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/krw044/are_you_more_willing_to_apply_to_a_job_if_the/",
            "score": 923,
            "selftext": "I find myself basically skipping over jobs that don’t even imply what the range would be.\n\nI went through a job interview process a few months back that lasted 2 weeks, only for them to offer $30k less than my salary I asked for on the first day, because they didn’t publicly list their salaries.\n\nIs that normal? What do y’all think?",
            "spoiler": false,
            "stickied": false,
            "title": "Are you more willing to apply to a job if the company publicly lists the salary range?",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/krw044/are_you_more_willing_to_apply_to_a_job_if_the/"
        },
        {
            "author": "u/setdelmar",
            "created_utc": "03-17-2021 19:52:38",
            "distinguished": null,
            "edited": false,
            "id": "m7e51f",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m7e51f",
            "num_comments": 26,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m7e51f/how_good_is_the_web_dev_job_market/",
            "score": 4,
            "selftext": "Howdy Everybody,\n\nIt Seems that most noobs like myself and others are going for web dev routes (I have not committed to web dev exactly yet). But since wordpress and wix are used in like 40% of websites now and so many people want to go the web dev route, how long does it look like supply/demand will be good for going into web dev? Any opinions.\n\n&#x200B;\n\nThanks",
            "spoiler": false,
            "stickied": false,
            "title": "How good is the web dev job market?",
            "upvote_ratio": 0.71,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m7e51f/how_good_is_the_web_dev_job_market/"
        },
        {
            "author": "u/pangea24",
            "created_utc": "01-15-2021 14:22:02",
            "distinguished": null,
            "edited": false,
            "id": "ky1ozi",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ky1ozi",
            "num_comments": 173,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/ky1ozi/how_did_you_get_your_second_job_out_of_college/",
            "score": 363,
            "selftext": "I’m currently almost 2 years into my career at a very large corporation. I graduated in the spring of 2019 and am now looking to move on to a new job with a different company, but within the same space that I currently work. My question is, what advice do you guys have in the search for the second job out of college? \n\nI haven’t been working for 2 years quite yet. Would I still be looking for more “entry level” positions? Associate? Junior? I feel like I am too qualified for entry level since all the postings I see are looking for people that haven’t graduated yet. And when I find job postings mentioning “associate” or “junior”, most of them are still looking for at least 3-5 years of experience. \n\nSo to the people that worked at a company for 2 years or less after college and were able to find another job, how did you do it? I’ve been applying but have still been under qualified and rejected. I just don’t really know what I’m qualified for at this point. Surprisingly, finding a job while in college seemed much easier. \n\nAny advice is greatly appreciate. Thanks!!",
            "spoiler": false,
            "stickied": false,
            "title": "How did you get your SECOND job out of college?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ky1ozi/how_did_you_get_your_second_job_out_of_college/"
        },
        {
            "author": "u/Maw0fTheVoid",
            "created_utc": "01-01-2021 09:03:13",
            "distinguished": null,
            "edited": false,
            "id": "kobr3g",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_kobr3g",
            "num_comments": 280,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/kobr3g/cs_jobs_which_dont_require_sitting_in_front_of/",
            "score": 601,
            "selftext": "Hey guys!\n\nI'm currently in university studying CS and sustained an injury last semester which impedes me from working on a PC for a long time (especially typing which is kinda essential to programming). I'm working on fixing it also look for alternatives like programming with my voice and so on but it got me thinking. Programming in and of itself was never something I truly enjoyed, it was always more a mean to an end since I enjoy planning and seeing my creation way more than the act of typing itself. Furthermore I'm not sure anymore if I want to sit all day in front of a PC because nowadays I don't feel as comfortable sitting in front of screen all day like I used to but I would still very much like to work with my brain but in the 21 century I don't see that working outside a very computerized environment.\n\nSo I wanted to ask you know some other CS related jobs which don't require an excessive amount of time in front of a PC since I don't see myself becoming a programmer anymore and don't what I want to become anymore.\n\nAnyways, I hope y'all stay safe!",
            "spoiler": false,
            "stickied": false,
            "title": "CS jobs which don't require sitting in front of the PC all day.",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kobr3g/cs_jobs_which_dont_require_sitting_in_front_of/"
        },
        {
            "author": "u/cloud_computer",
            "created_utc": "02-12-2021 11:05:53",
            "distinguished": null,
            "edited": false,
            "id": "lie33x",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_lie33x",
            "num_comments": 67,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lie33x/software_engineers_with_13_years_of_experience/",
            "score": 82,
            "selftext": "As a new grad 2 years ago, I applied to about 100 jobs, I was in the interview process with 6 companies, and I got 2 offers.\n\n\n\n\n\nI'm currently working as a software engineer now.  Since November, I applied to about 150 jobs.  I have had about 10 calls with recruiters after applying for jobs.  Half of them went on to more technical rounds.  Despite doing well in the later rounds, I got rejected in favor of the hiring manager wanting to pursue other job candidates, who are probably more experienced.\n\n\n\n\n\nI doubt it's because I am a bad interviewer, because I had no problem interviewing as a new grad.",
            "spoiler": false,
            "stickied": false,
            "title": "Software engineers with 1-3 years of experience, how does the pandemic job market compare to your new grad job market?",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lie33x/software_engineers_with_13_years_of_experience/"
        },
        {
            "author": "u/lifeInShamblesCS2019",
            "created_utc": "01-03-2021 14:28:02",
            "distinguished": null,
            "edited": false,
            "id": "kpr2iu",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_kpr2iu",
            "num_comments": 197,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/kpr2iu/spent_2_years_unemployed_after_graduation_finally/",
            "score": 772,
            "selftext": "Title basically sums up this entire post. I'll quickly go over a bit of background info about me just for context: I graduated from a mid-tier (I think?) college in Summer of 2019. Immediately after graduating, I spent some time preparing for interviews and building personal projects using JavaScript and the MERN stack just to pad my resume, all while applying for jobs (albeit casually). I wasn't able to find anything until around late February 2020, when I finally received an offer from a local company. \n\nThe pay wasn't great and it didn't offer any benefits (it was a contract-to-hire role), but I was already around 7 or 8 months out from graduation so I was just glad to have finally found a job. Then the COVID lockdown hit my state and that offer got rescinded. I spent the rest of 2020 building more personal projects (again w/ JavaScript and MERN, even picked up GraphQL) frantically applying to basically any software engineer position I could find on LinkedIn, Glassdoor, Indeed, you name it.\n\nFinally, in early December of 2020, I got a call from a recruiter who was trying to fill a position for a mid-size-ish European company. After a short conversation, I was told that they were looking for someone with experience (I spent all of 2020 hearing lines to this effect, so I basically assumed this was gonna be another rejection), but that they would try to convince the company to give me an interview anyway. In the interest of brevity I won't bore anyone with in-depth info about the process. Suffice it to say I found it pretty grueling for a company of its size and value. The process included something approximating an IQ test, and then 5 interviews (2 HR, 2 technical, then a final interview w/ some execs). \n\nLong story short, I did really well on the interviews (according to my recruiter, who I had frequent communications with). I got an offer, and like my first offer, it isn't great (though it is a bit higher than the offer I got in early 2020), but at least I wouldn't starve, and this company actually offers benefits, so I've got health insurance too. I accepted the offer and they sent me a laptop and a bunch of other equipment. I start in a few days.\n\nThere's just one problem. The company's flagship product/service (what I'd be working on) is coded in what seems to be a very obscure programming language called Smalltalk. I did some research on it during the interview process and it's ancient (1972), though I'm pretty sure it has some modern implementations (I think the company I got hired by uses a platform called Pharo or something). Smalltalk doesn't look anything like any modern mainstream language I know of, certainly nothing like JavaScript, Java or Python. The syntax is pretty alien compared to those languages. Documentation, learning materials and forums/communities for it are sparse.\n\nI'm a regular lurker on this board and I've seen lot of concerns raised about companies that use proprietary languages and such. While Smalltalk isn't proprietary to this company, it's obscure enough that I feel like it might as well be a proprietary language.\n\nWhile I'm glad to finally have a job (again... fingers crossed), I'm kind of feeling a little depressed because I feel like the experience I'll get is going to be worthless, since it's in a language that is so alien relative to more modern, mainstream ones. I know that a lot of people say that what matters most is knowledge of the fundamentals or whatever, but throughout 2020 literally every job posting I saw wanted 3+ years of experience with specific languages or tools, be it JavaScript, React, Python,  Java, Spring, C#, or whatever. I really don't want to be pidgeonholed into having to look for basically nonexistent Smalltalk positions if I lose this job or want to switch jobs for whatever other reason in the future.\n\nIs the language/framework you work with important enough to warrant trying to switch jobs as soon as I possibly can? If so, what's the shortest amount of time I can stay with this company before switching jobs without having it look bad on my resume? Will working this job for any extended period at all negatively affect my future prospects in jobs that involve mainstream, in-demand tools?\n\nThanks in advance.",
            "spoiler": false,
            "stickied": false,
            "title": "Spent 2 years unemployed after graduation. Finally got my first job in late Dec. of 2020, but it's in an obscure language. How bad is this for my career?",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kpr2iu/spent_2_years_unemployed_after_graduation_finally/"
        },
        {
            "author": "u/8754378543a",
            "created_utc": "01-14-2021 16:02:45",
            "distinguished": null,
            "edited": "01-14-2021 16:06:52",
            "id": "kxepoo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_kxepoo",
            "num_comments": 99,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/kxepoo/how_an_average_student_with_no_internships_landed/",
            "score": 868,
            "selftext": "TL:DR at bottom.\n\n**Background:**\n\nCall me Mister Average. I had a 2.84 GPA coming out from my B.S. in CompSci that I finished in May 2020, as well as no internships during schooling. I didn't take schooling in general very seriously, and would receive B's and C's in many of the courses. I didn't realize how important it was to have a internship until my first semester into senior year.\n\n\n\n**The Plan:**\n\nOh no! I'm out of time to get an internship! \"what ever will I do????\" is what you're asking. Well this is not the time for should've/could've mindset. We progress only forward now. There is nothing back there, look forward and keep marching.\n\nI knew it was going to be a tough journey, especially during 'Rona season so it was going to be extremely difficult for me to land anything. So I had to come up with a plan:\n\n1. Wake up early every morning and begin applying to Indeed, Glassdoor and then Linkedin.\n2. Work on personal projects\n3. Leetcode\n\n**The Process:**\n\n\nSo every single morning, I would get up and immediately take myself to the PC and begin applying. At first, I didn't know which jobs to apply to so I applied to all of them. 100 or so rejection emails later all saying \"Unfortunately we have decided to pursue other candidates at this time\", and then I got my first phone interview. It was a recruiting agency that worked with government contracting for the most part. She begin asking me questions that would be on the interview such as:\n\n1. Why do you want to work at X?\n\n2. Where do you see yourself in 5-10 years?\n\n3. What challenges have you faced?\n\n4. Describe yourself.\n\n5. Why should we hire you?\n\n6. Do you want to ask us any questions\n\n\n\nYou are probably thinking I was demolishing these questions, getting every single one perfect for how the recruiter would have wanted it right? \n\n**You're Wrong**\n\nI was stammering, nervous, mumbling, and often times throughout these questions I would just say \"I don't know.\" Did I get past the first phone interview? No, but guess what? \n\n**I just figured out some questions that would be asked in the next interview I take. The only way to truly succeed in this world is to fail.**\n\nThese questions should be **ingrained in your skull**. If you have a SO, roommate, brother, sister, mother, father, etc. to practice these questions on, then it will be better. And if you're on the boat as me, you don't so guess what? We are going to practice these questions before every single interview BY YOURSELF and say them all meticulously.\n\nB-b-but 8754378543a, which one of those questions are the most important?\n\nWell son, I would personally say that the final one is, and here is the reason I think it really helps: It shows how interested you are in the position. Should you fire 10-20 questions at them, and extend the interview by 30 minutes? \n\nNo.\n\nWhat you want to do with this is simply ask questions that if you were in the shoes of the employer, you would think to yourself \"Great Question\". Do you know how many times I have failed an interview but the dopamine hit of having the employer say \"Great Question\" when it came time for the questions to the interviewer? \n\nA lot.\n\nUnderstand what the business does, and use your questions based on that research. Also hit them with general questions such as \"What do you like about working at X?\", \"How is the WLB\", \"How has X Company been affected by 'Rona?\" as well. \n\nOn the same boat, speak about your personal projects as though they are your own children. Speak about the complexities of the problems that you faced were, **AND THEN HOW YOU SOLVED THEM**, speak about the tech stack you used, **AND WHY YOU USED THEM**, and finally give any important tidbits of information to show them how hard you worked on the application.\n\nNow finally, it's time to speak about the elephant in the room:\n\n**LEETCODE**\n\nThis sub likes to jump on the importance on leetcode, and to practice it every day. Now, don't get me wrong. It is in fact quite important to pass the coding part of the technical interview, but that is only half the battle. Remember that the questions discussed in the last section are the other half. But let's get started with the leetcode discussion. \n\nWhat to study?\n\nI would personally go with something like the blind 75:\n\nhttps://www.teamblind.com/post/New-Year-Gift---Curated-List-of-Top-75-LeetCode-Questions-to-Save-Your-Time-OaM1orEU\n\nB-b-b-but 8754378543a, is that it? \n\nWell not only are you finishing each of these questions, but EVERY SINGLE TIME:\n\n1. You describe the code to yourself.\n\n2. Describe your thought process as you are writing it.\n\n3. What are some of the optimizations that can be made to it? \n\n4. What is the Space/Time Complexity now, and with further optimizations, what can it be taken to?\n\nAnd here is a final question before I get to the end of the post with the conclusion.\n\nWith just the blind 75 and leetcode daily you must have destroyed the technical part?\n\n**Once again, it's a resounding NO**\n\nI was once again, a stammering mess with voice cracks, chocking up, and general spaghetti coming out of my pockets. But guess what? I didn't give up, every single time I fell, I got myself back up and kept doing more and more technical interviews until I was proficient. And with 600 applications, 10 technical interviews under my belt. I finally received a SWE offer and I couldn't be more proud of myself and the journey it took to get here. More than half a year of constant fighting to get to where I am now. The me that existed months ago would be happy to know I finally got to my destination. I don't care if 1 or 2 people actually view this post, as long as I can lend a hand to those of you can't see the peak of the mountain and are discouraged ready to turn back. Allow me to lend a hand, and tell you that a mindset of moving forward, taking hits and getting back up, and you will see yourself at the top of that mountain. When you do however, I want you to lend a hand to those that can't see the peak.\n\nTL:DR: Fall, and then get up. Fail, and then succeed. Wake up, apply, work on personal projects, and leetcode. And most importantly, ask questions in your interviews.",
            "spoiler": false,
            "stickied": false,
            "title": "How an average student with no internships landed a SWE job after 600 job applications",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kxepoo/how_an_average_student_with_no_internships_landed/"
        },
        {
            "author": "u/DjAbella",
            "created_utc": "03-15-2021 13:56:15",
            "distinguished": null,
            "edited": false,
            "id": "m5ql4r",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m5ql4r",
            "num_comments": 12,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m5ql4r/feeling_worse_and_worse_with_every_denial_from/",
            "score": 18,
            "selftext": "Title. The more interviews I do and getting rejected the more I lose confidence in the next interview. Looking for help haha",
            "spoiler": false,
            "stickied": false,
            "title": "Feeling worse and worse with every denial from jobs listings. How do/did y'all cope?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m5ql4r/feeling_worse_and_worse_with_every_denial_from/"
        },
        {
            "author": "u/neslef",
            "created_utc": "03-01-2021 23:38:40",
            "distinguished": null,
            "edited": false,
            "id": "lvtzce",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Meta",
            "locked": false,
            "name": "t3_lvtzce",
            "num_comments": 32,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lvtzce/how_do_you_stay_healthy_while_working_at_a_desk/",
            "score": 19,
            "selftext": "Sorry if this doesn’t belong here, but I think the general public could gain from everyone’s insights in how we each maintain health/sanity/productivity working in front of a screen for hours on end. Whether it be from home or in the office it’s still taxing. \n\nEven if you love what you do, staring at a screen for hours on end leaves a toll on the body (both physically and emotionally). \n\nCovid made us extra sensitive to this topic, but it should not be limited to just during covid. \n\nSo what are some of the  things that you do that has the most positive effect on your general well being?",
            "spoiler": false,
            "stickied": false,
            "title": "How do you stay healthy while working at a desk job in front of a computer for hours on end?",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lvtzce/how_do_you_stay_healthy_while_working_at_a_desk/"
        },
        {
            "author": "u/guyinhisroom",
            "created_utc": "02-24-2021 10:36:42",
            "distinguished": null,
            "edited": false,
            "id": "lrfnur",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_lrfnur",
            "num_comments": 29,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lrfnur/anyone_here_worked_a_remote_software_dev_job_and/",
            "score": 50,
            "selftext": "Also, whats the tax situation like?",
            "spoiler": false,
            "stickied": false,
            "title": "Anyone here worked a remote software dev job and travelled around the US? What was your experience like and what tips do you have?",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lrfnur/anyone_here_worked_a_remote_software_dev_job_and/"
        },
        {
            "author": "u/enterthroughthefront",
            "created_utc": "02-04-2021 15:45:33",
            "distinguished": null,
            "edited": false,
            "id": "lcpmyw",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Experienced",
            "locked": false,
            "name": "t3_lcpmyw",
            "num_comments": 69,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lcpmyw/quitting_my_job_tomorrow_this_is_how_i_intend_to/",
            "score": 115,
            "selftext": "Due to feeling unappreciated by upper management and HR at my company for the past year I made the decision to find a new job after working at my company for 3 years. (This is also my first job out of college). \n\nI accepted an offer two days ago, filled out the background check, and am now in the process of getting my equipment shipped to me to work from home. \n\nMy intention is to talk to my manager over video tomorrow and give him my two week notice. After the meeting is over email him my official resignation. Once this is done I intend to tell my team if my manager has no qualms about it. \n\nI kind of feel weird for leaving. This is the best thing for my career (I believe at this time) but I still find it hard to say goodbye. \n\nI never talked about my grievances with the company with my direct team (just my manager), I love my team but never mentioned it. I feel like I'm blind siding them with this because I didn't ever mention I was thinking of leaving, but I really couldn't because my company has laid people off and I didn't want to be put in the awkward situation of saying I want to leave while lay offs are possible. \n\nPlus this job hunt hasn't been super easy for me as multiple companies have reviewed me up until the on-site and rejected me, said they're not hiring, or just never said anything. So nothing has ever been guaranteed, even my current offer could be pulled if they felt like it. So that's why I never wanted to say anything to anyone.\n\nAny advice? Should I do anything different?",
            "spoiler": false,
            "stickied": false,
            "title": "Quitting my job tomorrow, this is how I intend to go about it. Any advice?",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lcpmyw/quitting_my_job_tomorrow_this_is_how_i_intend_to/"
        },
        {
            "author": "u/DTW_to_TBD",
            "created_utc": "02-25-2021 00:55:36",
            "distinguished": null,
            "edited": false,
            "id": "lrzkqk",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lrzkqk",
            "num_comments": 49,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lrzkqk/do_you_guys_keep_up_with_leetcode_while_youre_not/",
            "score": 29,
            "selftext": "I'm looking after six years at my job, and having to get back into the leetcode mindset kind of blows. Between practicing questions and working on a side project using languages outside of my job's languages, I don't have any time to myself during the week. Do you guys keep up with leetcode type questions when you're not looking? If so, how often do you try to practice so that the mindset stays fresh?",
            "spoiler": false,
            "stickied": false,
            "title": "Do you guys keep up with leetcode while you're not looking for a job?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lrzkqk/do_you_guys_keep_up_with_leetcode_while_youre_not/"
        },
        {
            "author": "u/LongTermExplanation",
            "created_utc": "03-16-2021 08:41:59",
            "distinguished": null,
            "edited": false,
            "id": "m686b2",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m686b2",
            "num_comments": 12,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m686b2/cs_grad_stuck_in_a_job_where_i_barely_need_to/",
            "score": 11,
            "selftext": "I graduated with a degree in Computer Science two years ago and straight away I got a job in a big consumer electronics company who hired me for a software role but didn't specify which team I'd work in. For some reason I ended up in their mobile networks team so I've been working on Telecom technologies (4G & 5G) for almost two years.\n\nWhile I was initially excited it quickly became clear that most of my job involves understanding how LTE works so I can debug any issues and to occasionally add new functionalities, all of which requires very minimal coding in C++ - this has lead to me picking up barely any skills since I graduated and I'm considering quitting so that I have time to hone my other skills - is this a good idea? or is there anything more I can do?",
            "spoiler": false,
            "stickied": false,
            "title": "CS grad - stuck in a job where I barely need to code. Need advice",
            "upvote_ratio": 0.87,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m686b2/cs_grad_stuck_in_a_job_where_i_barely_need_to/"
        },
        {
            "author": "u/FailureEngineer",
            "created_utc": "03-23-2021 23:05:43",
            "distinguished": null,
            "edited": false,
            "id": "mbw193",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_mbw193",
            "num_comments": 7,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/mbw193/concerned_that_i_am_not_learning_enough_at_my/",
            "score": 13,
            "selftext": "So I graduated last year with an engineering degree and a minor in computer science. I spent a few months applying and finally landed a position at a very small organization that only has 2 other software developers.  \n\nInitially, I was thrilled that I got a job, but now I am concerned now that the skills I am learning are not very valuable. The main piece of software that the organization essentially revolves around is written entirely in Python. There is no tech stack, it's just a massive Python application. It isn't deployed as a web application, and it is only used internally. Many \"best practices\" are disregarded. I am learning exactly one thing and one thing only — Python (which I already knew). It is basically a massive data crunching program that generates analysis. So think a lot of Python, pandas, numpy, etc.\n\nI guess I got better at git, which I kind of sucked at before. But I just don't think I will be very hire-able at other places if my only skill is Python. There aren't many positions where \"Python\" is the only technology you need to know. \n\nAre my fears overblown? Do I need to start building side projects in other languages? I did a lot of C++ in school, and I have played around with JavaScript, React, and MongoDB before. Feeling trapped!",
            "spoiler": false,
            "stickied": false,
            "title": "Concerned that I am not learning enough at my first job (No Tech stack, just one language)",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mbw193/concerned_that_i_am_not_learning_enough_at_my/"
        },
        {
            "author": "u/throwaway_jsdev",
            "created_utc": "03-17-2021 06:16:46",
            "distinguished": null,
            "edited": "03-17-2021 06:20:16",
            "id": "m6x7vp",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m6x7vp",
            "num_comments": 14,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m6x7vp/stuck_at_a_job_for_4_years_learning_no_new_things/",
            "score": 7,
            "selftext": "Hey All,\n\nSo I did my Masters in a good university with good grades, met few contacts while graduating and got the job at my very first interview in a very small company. The pay was good, so I didnt think much and didnt apply anywhere and joined the work, and everytime I felt like applying for a new job, my laziness stopped me and I felt comfortable at my workplace, 4 years down the lane, I literally feel I havent learned any new technologies as my company works mainly with old technologies which people wont even hear nowadays! \n\nI feel like a stupid when I talk to my other friends from university who are working in other companies. I regret about my choices in the past, and I feel I have wasted my prime in this dead end job. I am thinking of applying for jobs now, and the companies would expect a lot more from a 4-years experienced developer. \n\nHow do I approach this? I am thinking of even taking a break from my work and to prepare for the interviews, I feel I am a quick learner, but how do I convince the employers about this? and How do I prepare myself for the new offers? Any suggestions are welcome :)\n\nFor the context, I am in EU.",
            "spoiler": false,
            "stickied": false,
            "title": "Stuck at a job for 4 years learning no new things!",
            "upvote_ratio": 0.74,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m6x7vp/stuck_at_a_job_for_4_years_learning_no_new_things/"
        },
        {
            "author": "u/SharpenedStinger",
            "created_utc": "03-08-2021 17:45:04",
            "distinguished": null,
            "edited": false,
            "id": "m0sanl",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_m0sanl",
            "num_comments": 18,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m0sanl/wanting_to_get_a_job_in_the_field_and/",
            "score": 16,
            "selftext": "Hello all.\n\nI graduated may 2020 and since then i went to work on a tech startup company that i was and am still passionate about. It will be fully realized in less than a few weeks. \n\nDuring that time, i only applied to one job but was ghosted. That was a few months ago, no big deal.\n\n\n\nAbout me (keeping it completely real): I have no real work experience that could count towards CS experience.\n\nI have several projects where i worked with a team in university such as an 8 month project for graduation and a full stack big website project.\n\nBut the most important thing about my resume is my startup. It is a social media platform for code sharing that I created alone. It has fully functioning features of any big site: private messages, notifications, tags, payment system and much more. \n\nAlso spent months learning linux administration and IaC and configuration tools for scaling servers and maintaining security down the line.\n\n\nI figure this site will be the biggest (if not the only selling point I have - no internships, terrible GPA).\n\nIdeally I want to launch the company and after the initial launch rush dies down a bit I start working in the industry as a full stack, front end, backend, or devops, among other relevant roles and preferably remote. Like strongly prefer remote where i’d take a $50k remote job over a $80k in person job.\n\n\nWhen is a good time to start applying, given my situation?\n\nWhat kind of jobs should I aim for?\n\nWhat roles specifically?\n\nAnything you would caution or advise against given everything I said?\n\nThank you and God bless!",
            "spoiler": false,
            "stickied": false,
            "title": "wanting to get a job in the field and simultaneously work on my startup?",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m0sanl/wanting_to_get_a_job_in_the_field_and/"
        },
        {
            "author": "u/cognitivelycongested",
            "created_utc": "03-22-2021 21:43:10",
            "distinguished": null,
            "edited": false,
            "id": "mb3kw4",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_mb3kw4",
            "num_comments": 14,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/mb3kw4/when_applying_for_jobs_should_i_omit_my_partisan/",
            "score": 3,
            "selftext": "Hi all,\n\nI am an informatics student who took a year off last year to work for the Democratic Party and a US Senate Campaign. I'm still applying for internships and wondering if future employers in the tech world will be turned off by including those groups on my resume? I did some tech stuff on both of those campaigns, but that wasn't my central role. \n\nSomeone recommended making it vague, instead of saying \"Nevada Democratic Party\" I should say \"Nevada Political Party\" or instead of \"\\[Name\\] for US Senate\" it should be \"US Senate Campaign\" but would that seem too vague and shifty? \n\nAny advice is appreciated!",
            "spoiler": false,
            "stickied": false,
            "title": "When applying for jobs, should I omit my partisan political experience?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mb3kw4/when_applying_for_jobs_should_i_omit_my_partisan/"
        },
        {
            "author": "u/6668917555",
            "created_utc": "03-04-2021 15:07:53",
            "distinguished": null,
            "edited": "03-04-2021 16:21:56",
            "id": "lxtw40",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lxtw40",
            "num_comments": 25,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lxtw40/accepted_job_offer_but_lots_of_red_flags_going_off/",
            "score": 15,
            "selftext": "Recently I was contacted by a company to take a screening test/interview questions. I filled out the questions and emailed back the form. A couple days later, the recruiter reached out saying I got the software engineer position and received an employment offer. I haven't actually spoken with anyone on the phone, only emails. I accepted the offer (I'm pretty desperate for a job) and they said they would send me a check so that I can buy equipment to work remote. I have received the check via FedEx, but haven't deposited it. I've been suspicious from the beginning, but thought I was just being paranoid. I've only been in contact with the recruiter and he seems like a bot. I tried to call HR to verify employment, but either it disconnects or is a dead end. I asked for the recruiter's phone number and he asked what do I need and doesn't respond with a number for a while.\n\nDo I send an email to rescind my acceptance of the job offer?Not sure what to do here.\n\n&#x200B;\n\nEDIT: Thanks everyone! Will file a report and will continue my job hunt!",
            "spoiler": false,
            "stickied": false,
            "title": "Accepted job offer but lots of red flags going off",
            "upvote_ratio": 0.86,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lxtw40/accepted_job_offer_but_lots_of_red_flags_going_off/"
        },
        {
            "author": "u/therottenworld",
            "created_utc": "03-07-2021 09:14:47",
            "distinguished": null,
            "edited": false,
            "id": "lzrh64",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Student",
            "locked": false,
            "name": "t3_lzrh64",
            "num_comments": 14,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lzrh64/constant_anxiety_and_feeling_of_toxic/",
            "score": 29,
            "selftext": "I am in my 3rd year in university but I've basically fucked up 2 semesters now within the span of the last 2 years meaning that I'm behind by about a year now. I'm doing a catch-up semester now following a mobile semester and another catch-up semester before that. Which means I'd be finishing the year with about 2 years worth of european credit points..\n\nNow I think I'm pretty decent at programming, I have front-end framework experience (Angular, React and good control of the 3 basic technologies of the front-end) as well as back-end experience (NodeJS and Spring Framework) and I've passed my algorithms course and can do some decently efficient programming. I also did a mobile development semester and have made a small application as well as working on a React Native application for a real company in a team project and am definitely ready to work on something bigger. Basically I think I am hireable as a junior already, but with university I don't think I can go job seeking for a part-time job and do my university courses at the same time unless either is the sole thing I am focusing on.\n\nThe good news is I have an internship upcoming in about 3 months (or well I am supposed to find one, but my university helps with this through an internship market that they organize every semester so I am waiting for that and then I'll have one lined up hopefully). This is required as part of the degree. I think I'll be fine with this as this will absolutely give me a semester of experience that will prove my abilities afterwards for future employers together with my degree when I get it.\n\nBut I am basically constantly in this anxious state as if I am in competition with everyone else in trying to prove my abilities. I know a lot of people are better than me at software engineering and cs for sure, but I still feel like there's this constant anxiety about that I don't want new people to enter the field and that I want everyone to bluntly fuck off. I know it's completely irrational. I also constantly feel like I need to prove myself and make things that will impress people or be better than others.\n\nI have several sideprojects I am trying to do purely to satisfy that desperate feeling of being able to prove that I have the ability to be a junior developer or be hired.\n\nI'm studying things daily with the goal of building my foundation in the field so that I can be ahead of others and be more hireable than other people. But the toxic feeling of competitiveness and pressure I feel on myself to perform better than others is really driving me crazy. I feel almost manic about it and also stress over things like the field growing or random ass people being like \"I wanna be a programmer\" because I don't want more competition. I know it's entirely out of my control and a really toxic way to think but it just fucks with my head really hard and gives me stress.\n\nWhat can I do about this? Do I need therapy? Do I need to calm down? I know my worries aren't unfounded, people are getting more technologically savvy and in turn more people WILL enter cs and programming jobs.",
            "spoiler": false,
            "stickied": false,
            "title": "Constant anxiety and feeling of toxic competitiveness about job availibility and being \"good enough\" as a 2nd year university student",
            "upvote_ratio": 0.8,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lzrh64/constant_anxiety_and_feeling_of_toxic/"
        },
        {
            "author": "u/gotoline1",
            "created_utc": "03-04-2021 22:21:38",
            "distinguished": null,
            "edited": false,
            "id": "ly2sz5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_ly2sz5",
            "num_comments": 50,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/ly2sz5/im_36_finishing_up_a_cs_degree_is_it_worth/",
            "score": 2,
            "selftext": "So a little background, I'm a general engineer right now working at a defence contractor. I kinda like my work, but it really is more PowerPoints than actual technical work. All the technical lab work I can do requires day trips to another city, which is fine but has worn me down. \n\nI'm finishing my BSCS to finally be paid as an engineer and I'm remembering how much I love to code, which I hadn't done for about 10 years. \n\n I look around and we have a dev department who is usually looking for people to it's tempting to go look into that, but I'm afraid of ... Basically I'm afraid of feeling like I'm starting over when I'm almost 40. I'm not interested in super high pay, or management. I just want to go to work, solve technical problems and get paid for it. \n\nBasically I would be walking in with lots of experience in the product from a different perspective..  but not 10 years of coding experience. \n\nIs it worth thinking about? Or did I basically miss the boat?🤷",
            "spoiler": false,
            "stickied": false,
            "title": "I'm 36 finishing up a CS degree, is it worth switching to a CS job?",
            "upvote_ratio": 0.6,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ly2sz5/im_36_finishing_up_a_cs_degree_is_it_worth/"
        },
        {
            "author": "u/Stickybuns11",
            "created_utc": "01-17-2021 07:04:31",
            "distinguished": null,
            "edited": false,
            "id": "kz5avn",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_kz5avn",
            "num_comments": 136,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/kz5avn/they_cant_move_out_fast_enough_what_will_this/",
            "score": 143,
            "selftext": "https://www.nytimes.com/2021/01/14/technology/san-francisco-covid-work-moving.html?action=click&module=Editors%20Picks&pgtype=Homepage\n\nInteresting story on companies moving out of NoCal.\n\n\"That’s where the story of the Bay Area’s latest tech era is ending for a growing crowd of tech workers and their companies. They have suddenly movable jobs and money in the bank — money that will go plenty further somewhere else.\"",
            "spoiler": false,
            "stickied": false,
            "title": "\"They can't move out fast enough\". What will this mean for the new grad job market in San Fran?",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kz5avn/they_cant_move_out_fast_enough_what_will_this/"
        },
        {
            "author": "u/UnbalancedRoses",
            "created_utc": "02-09-2021 11:39:09",
            "distinguished": null,
            "edited": "02-10-2021 10:54:09",
            "id": "lg7a47",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_lg7a47",
            "num_comments": 60,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lg7a47/feeling_down_about_my_job_search/",
            "score": 49,
            "selftext": "I graduated in dec 2020 with a math and com sci degree and have yet to find a job. I turned down an offer from HCL back in December and now I am regretting it, hard. I felt like since I had a job offer right out of college that finding another would not be too difficult. WRONG. I went through a coding boot camp that had a job offer at the end and I was not chosen. My coding skills are basic at best but I know if given a chance I would fucking kill it and learn fast. I have applied to over 100 places I’m sure. I know it’s only February but fuck why does it feel like the end? I literally feel like I should change my career aspirations bc I can’t find a damn job. I suffer from depression and  bipolar 2 so I’m sure all these feelings are just feelings and not facts. But fuck it’s hard to get out of that mindset when my life is a cluster fuck and I know getting a job would change that. I guess I’m here to vent and to hear anyone else’s experience trying to find a job as a new grad in the middle of a fucking pandemic. Thanks for reading.\n\n\nEdit: I truly appreciate everyone giving their input on how the job search is going for them. \n\nI’d also like to reply to the people who think I’m entitled to a job, lol. I truly don’t feel that way I was only setting the scene of who I was and what I was going through. I grew up on tough love so I have some empathy for you on why you would feel that way. So even to those people, thanks for your reply!\n\nAlso btw I’m a woman so she/her.",
            "spoiler": false,
            "stickied": false,
            "title": "Feeling down about my job search",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lg7a47/feeling_down_about_my_job_search/"
        },
        {
            "author": "u/DuckFan_87",
            "created_utc": "03-09-2021 19:13:00",
            "distinguished": null,
            "edited": false,
            "id": "m1kdrb",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m1kdrb",
            "num_comments": 15,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m1kdrb/i_feel_weird_about_leaving_my_job_after_less_than/",
            "score": 12,
            "selftext": "I've been a software developer for about 10 years now. I've changed positions a handful of times. Mostly due to relocating and contract changes. I got laid off in the Spring of 2020 due to COVID-19. It was unexpected but I made a big effort to bounce back quickly. I landed a job after about 6 weeks with the biggest software company in my area. It was pretty hard to go from a small, start-up style company to a large corporation. The beginning was particularly hard, the tech stack at the new job was a lot different than what I was used to. It was a php backend and React JS  front end. I come from a Java background with minimal front end experience. I tried to view it as a chance to broaden my skillset and learn something new. \n\nAfter almost a year, I feel like I'm slowly making progress. The php is coming pretty easily but learning React has been a challenge. A recruiter contacted me out of the blue and I eventually got an offer for a back end Java developer position with a much smaller company. This offer seems like it's better suited to my skillset and it pays more than I currently make. \n\nI've already accepted the new position but I haven't given my 2 weeks notice yet. I'm probably in my head too much but I'm struggling with feeling like a quitter. I feel like I was about to get into a rhythm with my current job and I'm bailing before I was able to really contribute.\n\nIf you made it this far, thanks for reading my rambling nonsense. Any advice?",
            "spoiler": false,
            "stickied": false,
            "title": "I feel weird about leaving my job after less than a year.",
            "upvote_ratio": 0.76,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m1kdrb/i_feel_weird_about_leaving_my_job_after_less_than/"
        },
        {
            "author": "u/Fuckmydeaddad",
            "created_utc": "03-10-2021 13:37:34",
            "distinguished": null,
            "edited": "03-10-2021 13:45:40",
            "id": "m24wwd",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m24wwd",
            "num_comments": 8,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m24wwd/scam_torch_technologies_job_posting/",
            "score": 41,
            "selftext": "I recently received a false job offer from a scammer claiming to be an employee of Torch Technologies. I haven't found any information about this scam on the internet, so I thought I'd post about it.\n\nThe job posting was for a part time software engineer position on Indeed.com.\n\nThe email correspondence was primarily with a Mr. Mark Edwards, using the email addresses torchtechnologies@engineer.com, interview.torchtechnologies@gmail.com, and torchtechnologies.careers@gmail.com. All of these are fake and not affiliated with the company as confirmed by calling the office using the number provided on the Torch Technologies website. The company has their own company email: @torchtechnologies.com.\n\nTorch Technologies is a legit company and has a very good review rating on Glassdoor. This party impersonating this company is using a sophisticated series of canned responses and pre-designed forms that seem almost legitimate. \n\nBut there are a few obvious red flags, which together combined to make me suspicious enough to learn the truth. These included, but we're not limited to: bountiful spelling and grammatical errors; mismatches in font and size / styling in the correspondence; unprofessional communication; lack of signatures or contact information given; inability to answer basic questions about the company and its goals; a rushed hiring process involving only an online email based interview, with no phone calls or face time -- nor any technical questions; they hired me on the spot; a \"too good to be true\" \"salary\" of $60/hr plus benefits for an entry level position; they rushed me to make a decision on the job offer, giving me a deadline of until the end of the business day; poor formatting of copied/pasted info; unprofessional scheduling of the interview (they said to basically just contact them when I'm available within the next 2 days); declining to provide any way to contact the development team until \"after training\" (possibly the hugest red flag).\n\nFinally, after declining the offer on the grounds that I would not accept any offer in which I could not first speak to the dev team, I have yet to hear back from this Mr. Mark Edwards, nor his \"HR department\" with whom I was also in contact. My guess is that this wing of the operation is run by one person, who controls all the email accounts and has the same sloppy writing style.\n\nBut despite all of these red flags, I still say this scam was sophisticated. They went to a huge amount of effort to make this ruse. They have a lot of legit-sounding information, but they fail to glue it all together. Still I have to give them credit.\n\nAnyways, I just wanted to bring this to the attention of you all, in hopes that it just might save some poor soul from getting their bank account robbed clean. I honestly might have fallen for this scam because I just wanted to believe it was true.\n\nI thought, why would they pray on college students who are in debt (read: not wealthy) and educated enough to notice a scam when it pops up? I don't know, but obviously it works or they wouldn't do it.\n\nApologies for any grammatical / spelling errors as I'm on mobile. Apologies too if this isn't the right place to post this. If not, please direct me to a better place to get this information out. Thanks for reading.",
            "spoiler": false,
            "stickied": false,
            "title": "SCAM - \"Torch Technologies\" job posting",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m24wwd/scam_torch_technologies_job_posting/"
        },
        {
            "author": "u/Odd_Vanilla_1329",
            "created_utc": "12-21-2020 17:23:52",
            "distinguished": null,
            "edited": "12-22-2020 17:00:28",
            "id": "khrsw5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_khrsw5",
            "num_comments": 144,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/khrsw5/im_a_liberal_arts_major_who_received_a_fulltime/",
            "score": 1796,
            "selftext": "I was starting my last year of completing my liberal arts degree when I decided to teach myself how to code in Python. I took my first CS class later that year and fell in love with it, and decided I wanted to pursue software engineering.\n\nI had a lot of cards stacked against me, I was a recently homeless woman of color in a low-income, single-parent household, and it was too late for me to pursue a CS degree. I decided to take as many CS classes as possible and decided to teach myself everything else along the way. I knew my tech skills weren't the strongest, but I had professional work experience and always excelled at soft-skills. I was able to find a tech-adjacent job and that job helped me land more formal CS experience. I took a lot of advice from this subreddit; I went to hackathons, did Leetcode, and contributed to open-source projects. Unfortunately I ended up graduating into a COVID recession, but after 3 months of applying aggressively (close to 800 applications), screwing up technical interviews, etc. I finally landed \\*one\\* full-time software engineering job offer. It's not FAANG or a tech company for that matter, and the location is not ideal, but the salary is great and I know it will open a lot of doors for me.\n\nI wanted to share my experience to show that you can succeed in this field with an unconventional background. Tech skills are important but your soft skills are indispensable - I'm certain that my soft skills are what helped me land this job. I'm happy to answer any questions or hear from other people with a similar background/experience.\n\nEdit: Wow thank you for all the awards and positive comments! I noticed there is some confusion about my timeline in the comments, so I wanted to clarify that I ended up taking another year of college to take as many CS classes as possible. I have a little over 2 years of programming experience now.",
            "spoiler": false,
            "stickied": false,
            "title": "I'm a liberal arts major who received a full-time SWE job offer, my experience breaking into tech",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/khrsw5/im_a_liberal_arts_major_who_received_a_fulltime/"
        },
        {
            "author": "u/awonderfullove",
            "created_utc": "03-15-2021 00:05:13",
            "distinguished": null,
            "edited": false,
            "id": "m5cb7r",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_m5cb7r",
            "num_comments": 13,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/m5cb7r/got_my_first_job_as_a_cloud_engineer/",
            "score": 9,
            "selftext": "I am a college student in my final year and have got a job as a Cloud Engineer with a fairly large organisation. I have been informed that these would be my general responsibilities.\n\n* Ensure service availability as per the SLA set.\n* Interact with end users for request and incident management.\n* Monitor and optimize performance using AWS Dashboards.\n* Manage the overall cloud infrastructure including Network, Storage, and Backup.\n* Automate processes with the help of AWS developer tools or scripting skills\n* Develop and maintain a culture of continuous enhancement for Cloud Operations.\n* Deliver proof-of-concepts to support new requirements.\n* Be accountable from the stage of inception of an application to its on-going production\n* support.Troubleshoot Production and Nonproduction server/application/cloud issues.\n\nI am not sure if these are the expected roles for people working as cloud engineers, I have been told that they align more with Cloud Support Engineer role. Is this good position to start out with? Thank you for taking your time to read this.",
            "spoiler": false,
            "stickied": false,
            "title": "Got my first job as a Cloud Engineer.",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/m5cb7r/got_my_first_job_as_a_cloud_engineer/"
        },
        {
            "author": "u/QuietCauliflower4371",
            "created_utc": "01-28-2021 21:43:12",
            "distinguished": null,
            "edited": "01-28-2021 21:51:36",
            "id": "l7gv6s",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_l7gv6s",
            "num_comments": 40,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/l7gv6s/got_a_job_offer_for_a_lower_salary_than_what_was/",
            "score": 313,
            "selftext": "This is in Louisiana for a DBA role. I got an offer for $86k, but was told twice before and after the interview that the range was $91k - $95k. The job listed only 3-5 years experience, but I have 6+ years experience. They said the reason they had to pay lower was because I didn't have a bachelors in CS so they had to waive it. The degree wasn't mandatory as the job description said Bachelors or revelant experience. I have all the skills and also have the experience in the same industry as the company. Im also a US citizen if that matters.\n\nBefore I made a counter, I asked the HR guy if there was a possibility of the offer being rescinded and he said 100 percent they will not do that and at most they would  decline the counter. When I got the offer, I asked if I could take 1 day to think it over and he said he can submit a counter offer if I wanted so I did. I was very polite and also apologetic to the HR guy because I felt bad he had to do extra work. \n\nShould I be worried of it getting rescinded? I believe I'm their first pick but I'm worried right now that they are trying to get someone else with a degree and have me on the back burner. I did notice they removed their job listen for there role. It has been 2 days since I made the counter.\n\n What are your thoughts?\n\nEDIT: Sorry, I forgot to mentioned I countered to have the salary increased to $95k, which is still a bit lower than market rate and lower than what I had previously made in my past jobs.\n\nEDIT 2: Not sure if this matters, but normally a candidate had to go to a 3rd round to meet with the CTO, but the hiring managers I guess liked me enough to have me bypass the 3rd round.",
            "spoiler": false,
            "stickied": false,
            "title": "Got a job offer for a lower salary than what was mentioned due to not have a certain credential. Still waiting to hear back. Should I be worried?",
            "upvote_ratio": 0.98,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l7gv6s/got_a_job_offer_for_a_lower_salary_than_what_was/"
        },
        {
            "author": "u/alienkidxnzm",
            "created_utc": "02-09-2021 07:12:00",
            "distinguished": null,
            "edited": false,
            "id": "lg232r",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_lg232r",
            "num_comments": 53,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lg232r/indians_who_went_to_the_us_for_masters_in_cs_what/",
            "score": 56,
            "selftext": "What should someone, who is coming for Masters in fall 2021, expect?\n\nI know the salaries are pretty high but the competitiveness is even higher. But apart from that, how is the course different from what we already know?\nAnd most importantly, are you happy with the career choice you made?",
            "spoiler": false,
            "stickied": false,
            "title": "Indians who went to the US for Masters in CS, what major differences you found in the curriculum and job hunt ecosystem?",
            "upvote_ratio": 0.73,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lg232r/indians_who_went_to_the_us_for_masters_in_cs_what/"
        },
        {
            "author": "u/Nemo_shark",
            "created_utc": "03-05-2021 19:42:55",
            "distinguished": null,
            "edited": false,
            "id": "lyq4n5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "New Grad",
            "locked": false,
            "name": "t3_lyq4n5",
            "num_comments": 24,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/lyq4n5/im_about_to_be_a_new_masters_of_computer_science/",
            "score": 9,
            "selftext": "Hi, the title says it and I don’t really know where to start. I have about 3 months to find something or else I will have to go back to China. \n\nI have a few years of work experience through my school. I am currently a TA. My GPA is about 3.5. \nMy English isn’t really good but I can communicate at a basic level and can get tasks done. \n\nI was referred for an Amazon position but didn’t pass the third interview.  \n\nI’d like advice on finding a job, where to look, and information on how the working visa works and all. \n\nPlease and thank you!",
            "spoiler": false,
            "stickied": false,
            "title": "I’m about to be a new masters of computer science international graduate. I’m trying to find a job. Advice please?",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lyq4n5/im_about_to_be_a_new_masters_of_computer_science/"
        },
        {
            "author": "u/sealer9",
            "created_utc": "03-24-2021 11:46:17",
            "distinguished": null,
            "edited": false,
            "id": "mc9125",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_mc9125",
            "num_comments": 8,
            "nsfw": false,
            "permalink": "/r/cscareerquestions/comments/mc9125/leaving_first_job_after_810_months/",
            "score": 4,
            "selftext": "Hey guys!\n\nI got my first job out of college June 2020. I enjoy the job, good starting pay, good benefits. It is a city government job so it is pretty stable. My girlfriend and I's lease is up soon. We don't like the location we are in right now and are thinking of moving to a different area. A job has opened up, the same exact position as mine for another city which is much closer to where we want to live. It also would be about a 5-6% increase in pay. I wouldn't leave this job until I secured the other job. Would this be a bad decision? Leaving my first \"real\" job after 8-10 months of getting it?",
            "spoiler": false,
            "stickied": false,
            "title": "Leaving first job after 8-10 months?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/mc9125/leaving_first_job_after_810_months/"
        }
    ]
}