{
    "scrape_settings": {
        "subreddit": "cscareerquestions",
        "category": "search",
        "n_results_or_keywords": "job",
        "time_filter": "year"
    },
    "data": [
        {
            "title": "How the fuck can bootcamps like codesm!th openly claim that grads are getting jobs as mid-level or senior software engineers?",
            "flair": "Student",
            "date_created": "02-23-2021 15:33:49",
            "upvotes": 817,
            "upvote_ratio": 0.96,
            "id": "lqhejo",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lqhejo/how_the_fuck_can_bootcamps_like_codesmth_openly/",
            "comment_count": 495,
            "text": "I censored the name because every mention of that bootcamp on this site comes with multi paragraph positive experiences with grads somehow making 150k after 3 months of study.\n\nThis whole thing is super fishy, and if you look through the bootcamp grad accounts on reddit, many comment exclusively postive things about these bootcamps.\n\nI get that some \"elite\" camps will find people likely to succeed and also employ disingenuous means to bump up their numbers, but allegedly every grad is getting hired at some senior level position?\n\nIs this hogwash? What kind of unscrupulous company would be so careless in their hiring process as to hire someone into a senior role without actually verifying their work history? \n\nIf these stories are true then is the bar for senior level programmers really that low? Is 3 months enough to soak in all the intricacies of skilled software development?\n\nAm I supposed to believe his when their own website is such dog water?\nWhat the fuck is going on here?"
        },
        {
            "title": "Over 30, never had a job, about to graduate. How screwed am I?",
            "flair": null,
            "date_created": "02-22-2021 08:01:09",
            "upvotes": 661,
            "upvote_ratio": 0.93,
            "id": "lpflvj",
            "edited": "02-23-2021 06:44:23",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lpflvj/over_30_never_had_a_job_about_to_graduate_how/",
            "comment_count": 270,
            "text": "So, the title kind of sums it up really; I've been sick all my life, but I recently was cured. and I'm only just finishing my degree now and look to be finishing with a first (4.0 GPA).\n\nBecause I was so ill, I haven't managed to have a job my entire adult life; I was pretty much asleep 18 hours a day and exhausted the other 6. Fortunately, I seem to pick thing up pretty fast, so I just about managed to cope with my studies, and will most likely finish with a first (4.0 GPA) and a final project based on a novel approach to analysing AI systems.\n\nI'm based in the UK at a low ranked University, and I'm worried that because of my non existent employment history and my lack of experience, I'm not even going to make it to the interview stage. It just looks like on paper, I have pretty much everything going against me.\n\nDoes anyone have any advice or guidance for me? What should I be expecting after graduation? Am I beyond screwed? Because I feel like I'm beyond screwed.\n\nEdit: Thanks to everyone for the support, it means so much to me to be able to get some perspective on this and it's been so incredibly helpful. I'm trying to finish building out a feature, so I've got to stop replying for now, but I will try my hardest to reply to anyone else when I have time.\n\nEdit: Thanks for everyone's help. I've tried replying to you all, but I'm bound to have missed a bunch. Anyway, I'm going to have to quit replying; It's been so insightful and everyone has been incredibly supportive, but I spent 2 hours replying as best as I can already, and it's starting to become difficult to keep up. Thank you once again to all you for your help, and I'll make sure to update in a few months time once I'm polishing up my CV and prepping for interviews. Cheers!"
        },
        {
            "title": "Are there union jobs in software engineering? What are they like?",
            "flair": "New Grad",
            "date_created": "02-10-2021 19:18:08",
            "upvotes": 643,
            "upvote_ratio": 0.93,
            "id": "lgx48u",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lgx48u/are_there_union_jobs_in_software_engineering_what/",
            "comment_count": 563,
            "text": "Curious about what kind of a union presence there exists in the software industry"
        },
        {
            "title": "Finally got my first job as a Software Engineer after graduation a year ago. Here are my stats.",
            "flair": null,
            "date_created": "02-13-2021 10:33:12",
            "upvotes": 962,
            "upvote_ratio": 0.96,
            "id": "livy23",
            "edited": "02-13-2021 16:06:26",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/livy23/finally_got_my_first_job_as_a_software_engineer/",
            "comment_count": 224,
            "text": "Before Graduating in December 2019\n\n* Had a total of 3 interviews (1 internship, 2 full-time positions) -- All 3 of them I failed.\n* Never had internship experience.\n* Had a job teaching kids how to code. (over 1 year of experience)\n\nAfter Graduating in December 2019.\n\n* Continued teaching kids how to code.\n* Applied to around 20 - 50 different companies.\n* Only a few ever responded.\n* 1 Job Interview after graduation (The company that hired me).\n\nMy Resume: [https://drive.google.com/file/d/1tckrTpAlxdlsfRoiwOYO\\_E9CasdnqtTu/view?usp=sharing](https://drive.google.com/file/d/1tckrTpAlxdlsfRoiwOYO_E9CasdnqtTu/view?usp=sharing)\n\n**What I learned:**\n\n* After you graduate practice every day the concepts you learned in College.  DataStructures, Software Engineering Principles, Operating Systems, Linux, Web Programming, Git, Software Architecture ect.. That way you can answer any question the interviewer throws your way.  Become a master of these concepts.\n* Beyond that, Learn concepts that they didn't cover much in schools such as dynamic programming, Jira, AWS, Jenkins, test software, developer tools, and more.  (From my perspective we didn't learn much about this).\n* HUGE TIP: Simulate work experience as best as you can by Join an open-source project on GitHub.  I did some work on [https://github.com/TheAlgorithms/Python](https://github.com/TheAlgorithms/Python).  A project that tries to implement all algorithms in python.  I learned how to test code doing this and got more practice using git.\n* Do not make a fancy resume with your photo, columns, tables ect.. I did this and didn't get a reply for like 8 months, found out that Applicant Tracking Software can't read those too well so it is better to write a plane resume that is readable line by line.\n* Test your resume on one of these websites that give it ATS score.  My fancy resume got a score of 16% but once I changed it to look more plane and changed the wording I got a score of 46% then I started getting a lot more replies from companies. I used [https://resumeworded.com/resume-scanner](https://resumeworded.com/resume-scanner)\n* Solve one LeetCode question a day, create 4 solid advanced programming projects, and put them on GitHub and on your resume.  Make your LinkedIn stellar.\n* Study your ass off when you have an upcoming interview.\n* During the interview, speak loudly, ask a lot of questions, build off questions from the ones they ask you.  This makes it sounds like you know what you are talking about, that you are interested, and have some form of control during the interview.  Also be nice and grateful.\n\nFor those of you who get super nervous during interviews believe me, so do I.  I was so nervous before my interviews that my stomach physically hurt every day.  I would have diarrhea, and couldn't think of anything else besides the nervousness I felt.  The only thing that helped slightly was preparing to feel more confident, taking deep breaths, and going for walks.\n\nLastly, I am not a genius that went to a good university.  My GPA was average.  Yes, I was desperate, I thought I would never make it, worried about my future, stressed all the time, felt behind, but I still worked my ass off every day, kept applying, and never gave up.  I even demonstrated the hard work I put in during my interview to show them I care.\n\nI also believe some luck and opportunity is involved during this process but there's not much you can do about that so just focus on the hard work.\n\nKeep your head high and good luck on getting your foot in the door. :)\n\nAlso, I'm from San Diego, CA"
        },
        {
            "title": "I collected around 1081+ jobs from companies that hire without whiteboard questions",
            "flair": "Meta",
            "date_created": "02-15-2021 16:21:47",
            "upvotes": 1549,
            "upvote_ratio": 0.97,
            "id": "lkdk8g",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lkdk8g/i_collected_around_1081_jobs_from_companies_that/",
            "comment_count": 145,
            "text": "Hey everyone,\n\nEven as a mid level dev with several years of experience, I have always found it difficult to solve problems on the whiteboard. I'm more of a practical person who can come up with solutions in front of a screen and ever since I left college, it's only been even more difficult to get back into the Leetcode grind.\n\nI don't have much of an appetite for FAANG companies anyway. I figured I would start setting up a section for Hiring Without Whiteboards on my job board to categorise it.\n\nHere's the link: https://arbeitnow.com/hiring-without-whiteboard\n\nWould love to know what you think!"
        },
        {
            "title": "My mom was fired last July and still hasn’t been able to find a job. She knows XSLT, PL1, and JCL well. Any advice?",
            "flair": "Experienced",
            "date_created": "02-04-2021 02:32:34",
            "upvotes": 555,
            "upvote_ratio": 0.95,
            "id": "lc1lnl",
            "edited": "02-04-2021 20:27:01",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lc1lnl/my_mom_was_fired_last_july_and_still_hasnt_been/",
            "comment_count": 179,
            "text": "My mom’s company let go all of the older software engineers who were working from home last July. My mom had worked there for over 20 years. Their reasoning was that they wanted people to work in-person at their new office headquarters across the country. But probably the real reason was to replace the higher income people with new grads who will work at a lower salary.\n\nShe’s been applying for as many jobs as possible this whole time, even low salary jobs that aren’t programming related. She’s also been taking online training courses  in C# I think and maybe some others. She hasn’t been able to find a new programming job or even a secretary type position somewhere.\n\nDoes anyone have advice for a programmer experienced in XSLT, PL1, or JCL? They only gave her 4 months severance and things are getting kind of hard. My mom would prefer another work from home position but is willing to work somewhere within a 4 hour drive from Indianapolis, Indiana. Thank you for any help you can give :)\n\nEdit: thank you guys so much! I expected to get a few replies at most and I’m shocked at how kind and helpful this sub is. I told my mom about a lot of your comments and it made her happy. I told her I saw a few comments saying that she must be pretty smart to know XSLT so well, which made her feel good.\n\nMy mom’s still in touch with her former coworkers who were also laid off - they have a video call every couple weeks or so. As far as I know, no one else has found a job yet either, however I don’t know how hard the others are looking. My mom always says those meetings are so depressing because her old coworkers just complain a bunch.\n\nShe’s on LinkedIn and it’s updated. She gets calls and messages from recruiters all the time honestly, but the jobs they suggest for her are usually looking for different languages. So if she gets an interview, it doesn’t usually go very well. \n\nI’m not offended by comments saying she should’ve kept her skills more current. I agree. And I appreciate other comments reminding people that she’s from a different generation where people could count on working for one company for their whole career. I graduated from engineering school a few years ago and we had a required seminar class where industry people would come speak and basically tell us how important it is to continue educating yourself throughout your career. I’m sure my mom didn’t have that benefit. And, yes she did have to take stacks of code cards down to the single big basement computer at Indiana University. I think she graduated in the late 80’s, possibly very early 90’s. She didn’t go to college until her late 20’s though, so she’s in her early 60’s now. She might prefer to work longer, but she really just needs a job for like 5 years so she can get the higher retirement amount.\n\nAnyway thank you all so much!! I’ll post this to r/mainframe and r/experienceddevs as well.\n\nEdit 2: forgot to say that she is on unemployment right now, but it’s nowhere near enough for her bills. My siblings and I are helping out as much as we can, but it’s still not sustainable. Plus she’s kind of a workaholic (requirement for programmers?) and is going crazy lol.\n\nEdit 3: the reason I posted this is because I could tell my mom has started to get really discouraged. It seems like she’s only looking for secretary type jobs lately and doesn’t talk much about software jobs anymore. After so many rejections, I can understand. But I want her to be able to do what she loves and it just seems like there has to be a market for her skills somewhere. I took screenshots of some of the comments here, especially the people saying that she must be pretty smart to have worked on XSLT. I showed them to her and she was so happy. She said it was what she needed to be re-inspired to look for programming jobs. So again, thank you all so much for your kindness!"
        },
        {
            "title": "Started a new job 2 months ago, hate it and don't know what to do",
            "flair": null,
            "date_created": "02-21-2021 21:14:00",
            "upvotes": 124,
            "upvote_ratio": 0.95,
            "id": "lp2xff",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lp2xff/started_a_new_job_2_months_ago_hate_it_and_dont/",
            "comment_count": 74,
            "text": "Title sums up the post. This is basically an update to [a post](https://www.reddit.com/r/cscareerquestions/comments/kpr2iu/spent_2_years_unemployed_after_graduation_finally/) I made on this board in early January about a job offer I signed in late December. TL;DR on that post just for context: I work for the U.S. branch of a European company whose flagship product is written in an old language called Smalltalk... sort of (I'll explain later). In my first post, I expressed my concern that working for this company might be bad for my career due to the relative obscurity of Smalltalk in the SWE job market, and I got lots of great answers from all sorts of perspectives. Of course, I ultimately decided to take the job, since I had no other prospects other than remaining unemployed.\n\nI've now been working for around 2 months, and I'm starting to realize that there's a lot of things I **really** don't like about this job, and it seems like every day I find something new to dislike about it.\n\n**First**, the language. See, it turns out that while I was told I'd be using Smalltalk on the job, the way it actually works is that the company actually uses a *proprietary framework* that is coded in Smalltalk. Basically, my first month on the job included some basic Smalltalk training, along with training in how to use the company's flagship product, and everything from then on involves using the proprietary framework.\n\nThis comes with all the negatives people on this board usually cite when talking about proprietary frameworks:\n\n\\- **Lack of Documentation.** This one explains itself. According to my team's lead developer, the company's philosophy is to \"document\" their code by using \"descriptive names\" for their methods and variables. This isn't done well. Methods are obscure and convoluted, not at all self explanatory, company-specific terminology and jargon is rampant, and the most common way to understand what a method does is to look at how other devs have used it and just copy them.\n\n\\- **Can't Google anything.** Because the framework is proprietary, it's closed-source and therefore no one on Google (or, for that matter, outside of the company) will know anything about the software. So if and when you get stuck, your only recourse is to ask a more senior developer, and if they don't know what to do, then they ask **their** seniors, and so on all the way up to a pair of allegedly-genius-tier \"gurus\" at the European branch who wrote the framework and have been with the company for decades.\n\n\\- **Non-transferrable experience.** If and when you want to leave this company, it's basically impossible to market your skills and experience, because all you know how to do is maintain and expand the company's framework. To this day, the only transferrable skill I've learned at this company is how to use a debugger, and maybe the basics of Smalltalk, assuming I ever run into another company who uses this language again.\n\n**Second**, my pay. I don't believe I mentioned this in my old post, but my TC at this company is $60k. I live in Miami, FL, which is a high COL area. At first, I was happy just to have found a job, but now that I'm actually getting paid I can't help but notice how little I'm making for my area. Rent here is $1.7k+ for a **studio** (not even a full apartment) in any halfway decent area. Once you factor in bills, gas, groceries, student loan payments, and other necessities, I'm basically living paycheck to paycheck. I'm **not** a big spender by any means. At most I'll treat myself to dinner at a Cheesecake Factory on a Friday afternoon or something, but with the money I'm making now I have to think twice about doing even that, and I often end up just forgoing it altogether so I can continue to build up my meager emergency fund.\n\n**Third**, the company culture. At least I think that's what this is called. There are huge numbers of meetings, plus \"team activities\" like playing Pictionary together or \"hanging out\" after work, the kind of \"team-building\" stuff that isn't technically mandatory, but if you refuse you'll be viewed as not being a \"team player\" or whatever and probably end up getting replaced at some point. Also, I'm not really sure how to word this, but at this company, developers are expected to debug code in front of representatives of client companies (!!!). I've never heard of this practice before and have no idea how common it is, but this is an extremely stressful prospect for someone like me with performance anxiety. I had a hard enough time doing whiteboard problems with a job offer on the line... imagine trying to fix a bug with production code in real time in front of some corporate representative, with *my livelihood* (i.e. survival) potentially on the line. I've heard from more senior developers at this company that this is actually really stressful, as many of the client company representatives are very impatient and demanding. I'm trying to drag out my training period for as long as possible to put off having to do this because I just don't know how I'm going to manage it.\n\nI just feel like such an idiot. I slaved away in college, graduated with a 3.83 GPA, all just to end up living a life where I basically can't afford to treat myself to any kind of leisure or fun on my time off. My day is basically I'm really depressed and unhappy, and it's only getting worse every day. I don't know what to do. I feel so exhausted, drained and demotivated after a work day that I don't even want to look at an IDE, let alone grind Leetcode or build portfolio projects like I did before I got this job.\n\nI want to try to apply to other jobs, but I don't know how to go about it in my situation.\n\n1. Should I update my CV and include my current job, even though I've only been there for two months and I haven't really done anything but \"training\"?\n2. Do I have to stay here for some number of months before leaving so that it won't look bad on my CV? If so, how long do I have to stay?\n3. How necessary is Leetcode? Do I have to grind it to make a good enough salary that I can afford some leisure activities without living paycheck to paycheck? I just don't think I have it in me to do this anymore.\n4. What's the best strategy for an entry level developer to look for a full-time remote position? Should I be trying to connect with random recruiters on LinkedIn? Spamming applications like I did before I got this job? I'd like a job in something mainstream like JavaScript/React or Java or something where the experience I accrue on the job will actually open doors without me having to grind Leetcode forever.\n\nSorry if this post is all over the place. I'm very tired and kind of in a daze at the moment. Sunday depression is setting in. I'm literally staring at my clock, begging it to go slower so it won't be Monday again."
        },
        {
            "title": "Is anyone else looking for a remote dev job with social impact? I've been searching for the last few months and compiled all the companies I have found into a free list I hope will help others. You can filter jobs by the UN's Sustainable Development Goals!",
            "flair": null,
            "date_created": "01-30-2021 16:11:15",
            "upvotes": 1115,
            "upvote_ratio": 0.96,
            "id": "l8lej6",
            "edited": "01-30-2021 08:27:25",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l8lej6/is_anyone_else_looking_for_a_remote_dev_job_with/",
            "comment_count": 110,
            "text": "I've put them on  [remoteimpact.io](https://www.remoteimpact.io/) \\- a free list of remote dev jobs that are transforming the world with their social impact. I'm hoping this site will support my applications!\n\nJobs can be filtered by the [UN's Sustainable Development Goals](https://sdgs.un.org/goals) which list 17 global goals to tackle the worlds most pressing problems.\n\nNew jobs are automatically added daily and if it's useful to others I'd be more than happy to spend more time finding and adding more companies. I've been coding for about a year now and would welcome any ideas on how to improve the site for my portfolio, or any features you would like to see."
        },
        {
            "title": "The ultimate blueprint to getting a job in data science",
            "flair": "Experienced",
            "date_created": "02-02-2021 11:29:45",
            "upvotes": 908,
            "upvote_ratio": 0.96,
            "id": "lar2us",
            "edited": "02-02-2021 18:34:29",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lar2us/the_ultimate_blueprint_to_getting_a_job_in_data/",
            "comment_count": 86,
            "text": "EDIT: I’m on discord to answer your questions: \nhttps://discord.gg/raQ5NjHy\n\nIt’s pretty late in the UK (11.30pm, but I’ll stay up as long as you guys want me to)\n\nOrganisation is Key\n\nI’ve interviewed at Google (and DeepMind), Uber, Facebook, Amazon for roles that lie under the “Data Scientist” umbrella and this is the typical interview construction theme I’ve observed:\n\nSoftware Engineering\nApplied Statistics\nMachine Learning\nData Wrangling, Manipulation and Visualisation\n\nNow nobody is expecting some super graduate level competency in all of these topics, but you need to know enough to convince your interviewer that you’re capable of delivering if they offered you the job. How much you need to know depends on the job spec, but in this increasingly competitive market, no knowledge is lost.\n\nI recommend using Notion to organise your job prep. It’s extremely versatile, and enables you to utilise the Spaced Repetition and Active Recall principles to nail down learning and deploying key topics that come up time and time again in a Data Scientist interview. Ali Abdaal has a great tutorial on note taking with Notion to maximise your learning potential during the interview process.\n\nI used to run through my Notion notes over and over, but in particular, right before my interview. This ensured that key topics and definitions were loaded into my working memory and I didn’t waste precious \ntime “ummmmmm”ing when hit with some question.\n\n2. Software Engineering\nNot all Data Scientist roles will grill you on the time complexity of an algorithm, but all of these roles will expect you to write code. Data Science isn’t one job, but a collection of jobs that attracts talent from a variety of industries, including the software engineering world. As such you’re competing with guys that know the ins and outs of writing efficient code and I would recommend spending at least 1–2 hours a day in the lead-up to your interview practicing the following concepts:\n\nArrays\nHash Tables\nLinked Lists\nTwo-Pointer based algorithms\nString algorithms (interviewers LOVE these)\nBinary Search\nDivide and Conquer Algorithms\nSorting Algorithms\nDynamic Programming\nRecursion\n\nDO NOT LEARN THE ALGORITHMS OFF BY HEART. This approach is useless, because the interviewer can question you on any variation of the algorithm and you will be lost. Instead learn the strategy behind how each algorithm works. Learn what computational and spatial complexity are, and learn why they are so fundamental to building efficient code.\n\nLeetCode was my best friend during interview preparation and is well worth the $35 per month in my opinion. Your interviewers only have so many algorithm questions to sample from, and this website covers a host of algorithm concepts including companies that are likely or are known to have asked these questions in the past. There’s also a great community who discuss each problem in detail, and helped me during the myriad of “stuck” moments I encountered. LeetCode has a “lite” version with a smaller question bank if the $35 price tag is too steep, as do HackerRank and geeksforgeeks which are other great resources.\n\nWhat you should do is attempt each question, even if it’s a brute force approach that takes ages to run. Then look at the model solution, and try to figure out what the optimal strategy is. Then read up what the optimal strategy is and try to understand why this is the optimal strategy. Ask yourself questions like “why is Quicksort O(n²) average time complexity?”, why do two pointers and one for loop make more sense than three for loops?\n\n3. Applied Statistics\nData science has an implicit dependence on applied statistics, and how implicit that will be depends on the role you’ve applied for. Where do we use applied statistics? It pops up just about anywhere where we need to organise, interpret and derive insights from data.\n\nI studied the following topics intensely during my interviews, and you bet your bottom dollar that I was grilled about each topic:\n\nDescriptive statistics (What distribution does my data follow, what are the modes of the distribution, the expectation, the variance)\nProbability theory (Given my data follows a Binomial distribution, what is the probability of observing 5 paying customers in 10 click-through events)\n\nHypothesis testing (forming the basis of any question on A/B testing, T-tests, anova, chi-squared tests, etc).\n\nRegression (Is the relationship between my variables linear, what are potential sources of bias, what are the assumptions behind the ordinary least squares solution)\n\nBayesian Inference (What are some advantages/disadvantages vs frequentist methods)\n\nIf you think this is a lot of material you are not alone, I was massively overwhelmed with the volume of knowledge expected in these kinds of interviews and the plethora of information on the internet that could help me. Two invaluable resources come to mind when I was revising for interviews.\n\nIntroduction to Probability and Statistics, an open course on everything listed above including questions and an exam to help you test your knowledge.\n\nMachine Learning: A Bayesian and Optimization Perspective by Sergios Theodoridis. This is more a machine learning text than a specific primer on applied statistics, but the linear algebra approaches outlined here really help drive home the key statistical concepts on regression.\n\nThe way you’re going to remember this stuff isn’t through memorisation, you need to solve as many problems as you can get your hands on. Glassdoor is a great repo for the sorts of applied stats questions typically asked in interviews. The most challenging interview I had by far was with G-Research, but I really enjoyed studying for the exam, and their sample exam papers were fantastic resources when it came to testing how far I was getting in my applied statistics revision.\n\n4. Machine Learning\nNow we come to the beast, the buzzword of our millennial era, and a topic so broad that it can be easy to get so lost in revision that you want to give up.\nThe applied statistics part of this study guide will give you a very very strong foundation to get started with machine learning (which is basically just applied applied statistics written in fancy linear algebra), but there are certain key concepts that came up over and over again during my interviews. Here is a (by no means exhaustive) set of concepts organised by topic:\n\nMetrics — Classification\nConfusion Matrices, Accuracy, Precision, Recall, Sensitivity\nF1 Score\nTPR, TNR, FPR, FNR\nType I and Type II errors\nAUC-ROC Curves\n\nMetrics — Regression\nTotal sum of squares, explained sum of squares, residual sum of squares\nCoefficient of determination and its adjusted form\nAIC and BIC\nAdvantages and disadvantages of RMSE, MSE, MAE, MAPE\n\nBias-Variance Tradeoff, Over/Under-Fitting\nK Nearest Neighbours algorithm and the choice of k in bias-variance trade-off\nRandom Forests\nThe asymptotic property\nCurse of dimensionality\nModel Selection\nK-Fold Cross Validation\nL1 and L2 Regularisation\nBayesian Optimization\n\nSampling\nDealing with class imbalance when training classification models\nSMOTE for generating pseudo observations for an underrepresented class\nClass imbalance in the independent variables\nSampling methods\nSources of sampling bias\nMeasuring Sampling Error\n\nHypothesis Testing\nThis really comes under under applied statistics, but I cannot stress enough the importance of learning about statistical power. It’s enormously important in A/B testing.\n\nRegression Models\nOrdinary Linear Regression, its assumptions, estimator derivation and limitations are covered in significant detail in the sources cited in the applied statistics section. Other regression models you should be familiar with are:\nDeep Neural Networks for Regression\nRandom Forest Regression\nXGBoost Regression\nTime Series Regression (ARIMA/SARIMA)\nBayesian Linear Regression\nGaussian Process Regression\n\nClustering Algorithms\nK-Means\nHierarchical Clustering\nDirichlet Process Mixture Models\n\nClassification Models\nLogistic Regression (Most important one, revise well)\nMultiple Regression\nXGBoost Classification\nSupport Vector Machines\n\nIt’s a lot, but much of the content will be trivial if your applied statistics foundation is strong enough. I would recommend knowing the ins and outs of at least three different classification/regression/clustering methods, because the interviewer could always (and has previously) asked “what other methods could we have used, what are some advantages/disadvantages”? This is a small subset of the machine learning knowledge in the world, but if you know these important examples, the interviews will flow a lot more smoothly.\n\n5. Data Manipulation and Visualisation\n“What are some of the steps for data wrangling and data cleaning before applying machine learning algorithms”?\n\nWe are given a new dataset, the first thing you’ll need to prove is that you can perform an exploratory data analysis (EDA). Before you learn anything realise that there is one path to success in data wrangling: Pandas. The Pandas IDE, when used correctly, is the most powerful tool in a data scientists toolbox. The best way to learn how to use Pandas for data manipulation is to download many, many datasets and learn how to do the following set of tasks as confidently as you making your morning cup of coffee.\n\nOne of my interviews involved downloading a dataset, cleaning it, visualising it, performing feature selection, building and evaluating a model all in one hour. It was a crazy hard task, and I felt overwhelmed at times, but I made sure I had practiced building model pipelines for weeks before actually attempting the interview, so I knew I could find my way if I got lost.\n\nAdvice: The only way to get good at all this is to practice, and the Kaggle community has an incredible wealth of knowledge on mastering EDAs and model pipeline building. I would check out some of the top ranking notebooks on some of the projects out there. Download some example datasets and build your own notebooks, get familiar with the Pandas syntax.\n\nData Organisation\nThere are three sure things in life: death, taxes and getting asked to merge datasets, and perform groupby and apply tasks on said merged datasets. Pandas is INCREDIBLY versatile at this, so please practice practice practice.\n\nData Profiling\nThis involves getting a feel for the “meta” characteristics of the dataset, such as the shape and description of numerical, categorical and date-time features in the data. You should always be seeking to address a set of questions like “how many observations do I have”, “what does the distribution of each feature look like”, “what do the features mean”. This kind of profiling early on can help you reject non-relevant features from the outset, such as categorical features with thousands of levels (names, unique identifiers) and mean less work for you and your machine later on (work smart, not hard, or something woke like that).\n\nData Visualisation\nHere you are asking yourself “what does the distribution of my features even look like?”. A word of advice, if you didn’t learn about boxplots in the applied statistics part of the study guide, then here is where I stress you learn about them, because you need to learn how to identify outliers visually and we can discuss how to deal with them later on. Histograms and kernel density estimation plots are extremely useful tools when looking at properties of the distributions of each feature.\nWe can then ask “what does the relationship between my features look like”, in which case Python has a package called seaborn containing very nifty tools like pairplot and a visually satisfying heatmap for correlation plots.\nHandling Null Values, Syntax Errors and Duplicate Rows/Columns\nMissing values are a sure thing in any dataset, and arise due to a multitude of different factors, each contributing to bias in their own unique way. There is a whole field of study on how best to deal with missing values (and I once had an interview where I was expected to know individual methods for missing value imputation in much detail). Check out this primer on ways of handling null values.\n\nSyntax errors typically arise when our dataset contains information that has been manually input, such as through a form. This could lead us to erroneously conclude that a categorical feature has many more levels than are actually present, because “Hot”, ‘hOt”, “hot/n” are all considered unique levels. Check out this primer on handling dirty text data.\nFinally, duplicate columns are of no use to anyone, and having duplicate rows could lead to overrepresentation bias, so it’s worth dealing with them early on.\n\nStandardisation or Normalisation\nDepending on the dataset you’re working with and the machine learning method you decide to use, it may be useful to standardize or normalize your data so that different scales of different variables don’t negatively impact the performance of your model.\nThere’s a lot here to go through, but honestly it wasn’t as much the “memorise everything” mentality that helped me insofar as it was the confidence building that learning as much as I could instilled in me. I must have failed so many interviews before the formula “clicked” and I realised that all of these things aren’t esoteric concepts that only the elite can master, they’re just tools that you use to build incredible models and derive insights from data.\n\nBest of luck on your job quest guys, if you need any help at all please let me know and I will answer emails/questions when I can."
        },
        {
            "title": "Looking for a job feels like a perpetually unending finals week",
            "flair": "New Grad",
            "date_created": "01-14-2021 05:46:19",
            "upvotes": 1457,
            "upvote_ratio": 0.99,
            "id": "kwwjbc",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kwwjbc/looking_for_a_job_feels_like_a_perpetually/",
            "comment_count": 216,
            "text": "It's just a never-ending session of studying, working on projects, eating, and sleeping. On the off chance I give myself some free time, I feel super guilty and I can never really enjoy myself."
        },
        {
            "title": "How are people with 6 months - 2 years of experience navigating the job market?",
            "flair": "Experienced",
            "date_created": "02-16-2021 18:29:17",
            "upvotes": 142,
            "upvote_ratio": 0.97,
            "id": "ll668i",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ll668i/how_are_people_with_6_months_2_years_of/",
            "comment_count": 62,
            "text": "I'm a software/data engineer with 2 years of experience. I am lucky to still be employed, but I really want to move closer to my family and friends from college.\n\n\n\n\nI'm not having a great time with the job market, as I am noticing that I am in this position where a lot of senior developers are applying for mid-level roles and I am not eligible for new grad roles either.\n\n\n\n\nShould I even bother looking for a new job in this economy? Should I just relax after work hours instead and find ways to learn more through online classes, instead of applying for jobs that will reject me."
        },
        {
            "title": "Deeply lost in my first software engineering job",
            "flair": null,
            "date_created": "02-09-2021 20:45:12",
            "upvotes": 202,
            "upvote_ratio": 0.94,
            "id": "lg8ter",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lg8ter/deeply_lost_in_my_first_software_engineering_job/",
            "comment_count": 77,
            "text": "Anyone else having serious onboarding struggles at a new company?  \n\n(also happens to be my first company)\n\nA simple ticket doesn’t make sense because none of the words or tools in the ticket make sense.  Because everything is based on internal tools, I can’t search far and wide on the internet for answers.  Team is friendly but swamped and I have a new question on every single step.  \n\nThe docs give instructions like this:\n\nGetting started: \n1.  Bake a cake out of laughter \n2. Climb inside the cake using a needle point cabinet full of tiger hairs.\n3. Collect octopus tears and build tree stumps using toothpaste \n\nIn other words the docs make zero sense.  I haven’t even seen words put together in that way before.  And it feels like each step could probably use an entire doc of its own for an explanation.\n\nIt’s tempting to think I’m stupid/incompetent.  But I do believe that if I had the resources to figure this out, I’d be able to learn.  \n\nStand up meetings are becoming terrifying as I have literally nothing to report.  \n\nAnyone else in this situation?  How did you get through?  \n\nIf I get fired, any recommendations for companies that are good for junior developers who are still learning?"
        },
        {
            "title": "Started job school at 28, graduated at 30, now 32, have become \"the guy who shouldn't be hit by a bus\" at my company. Scared I won't find anything else... Advice?",
            "flair": null,
            "date_created": "01-25-2021 16:19:45",
            "upvotes": 681,
            "upvote_ratio": 0.96,
            "id": "l4npdw",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l4npdw/started_job_school_at_28_graduated_at_30_now_32/",
            "comment_count": 120,
            "text": "Warning, this is kinda long, I'm trying to give an overview of my current situation:\n\nAfter a somewhat problematic life that wasn't exactly going according to plan (depression, just barely graduated from school etc.),\nI managed to finally do job training and get a formal career going.\nBack then, I was hired by my current employer through a\nstate subsidy where the company only had to pay a couple bucks per month for me, while the rest came from the gov, so they had little risk in hiring me.\n\nThe IT situation in the company back then was:\n\n* 1 freelancer who was my job trainer \"on paper\" but he's 100s of km away and only visited in-house like once a month before corona.\n\n* 1 super hyper nerd just a bit younger than me who was more on the admin side, he was here around 2 days a week - he set up most of the virtualized environment here with VMware, different windows and unix servers, all of our IT is currently hosted in-house. It's pretty old and outdated by now, too expensive to replace, too spaghetti to migrate...\n\n\nWell, fast-forward 4 years, I finished job training 2 years later (with an A), got hired full-time, the super nerd left the company 1.5ish years ago to study IT at uni full-time and he won't be coming back.\n\nSo basically, I'm THE IT GUY in my company now, my \"job trainer\" can assist in case of emergency, but I'm mostly managing everything alone, doing both admin and programming work.\n\nThere are multiple areas of concern for me now:\n\n* I'm pretty sure I'm horribly underpaid\n\n* All the responsibility is on my shoulders, I'm the de-facto IT lead due to being the only IT guy, but at the same time, bosses treat me like just another paper-pusher\n\n* Both bosses have little understanding for IT, don't know how much effort it takes to keep everything running while not screwing up (on the plus side, they rarely put deadlines) - they only care about results\n\n* What if the inhouse system fails? It feels like being on a sinking boat, constantly plugging holes.\n\n* I'm not getting any outside input to develop my skills. Everything is self-taught, I maintain and extend super old (e.g. PHP5) legacy code, no frameworks etc.\n\n* I feel like getting a new position \"in the industry\" will be impossible? Every job offer wants a billion different frameworks, I applied to one job that wanted exactly what I know, wasn't even invited to an interview. Disheartening. Probably because of the gappy CV (did this-n-that from 21 to 28).\n\n\nI managed to pick up the following skills by myself in the past 4 years (very loosely ordered by skill): HTML, CSS, JS, PHP, mySQL/PostgreSQL, regex, vim, Python, Windows administration, Webhosting (Apache), Exchange, VMware, Linux administration, Firewalls\n\nPlus of course I solve user problems all day.\n\nI feel like it's an okay skillset, but job offers always seem to want so much more. On the other hand, I feel lacking in other areas:\n\nWe don't have a version control system, I don't know a lot about typical CS theory questions like algorithms and data structures, as I've never needed them so far...then there's the whole teamwork aspect, I've never coded in a team since I'm alone. No \"unit tests\", QA, scrum, agile, all of this stuff.\n\nOn the plus side, I managed to \"not screw up production\" for these 4 years.\n\n\nBasically, I don't know what to do at this point. The responsibility is a bit much, the pay not adequate considering it. And there's not much to do (programming-wise) for the past year or so. I mostly browse reddit or learn more about programming. But time doesn't fly for sure, I feel a bit bored sitting around here 8h every day. At the same time, I feel like I'm getting less and less employable by other companies. Most of my worth here is company-knowledge...\n\nStarting at another company would probably offer me considerably more benefits in vacation and money - but it'll also mean losing a relatively safe job and becoming a \"replaceable little guy\". My constant flip-flopping between delusions of grandeur and impostor syndrome doesn't help matters at all :(\n\n\nAnyone can offer me some advice? Thank you."
        },
        {
            "title": "Opinion: It's okay to take the job that pays more",
            "flair": null,
            "date_created": "01-12-2021 21:27:30",
            "upvotes": 1234,
            "upvote_ratio": 0.94,
            "id": "kvxeoa",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kvxeoa/opinion_its_okay_to_take_the_job_that_pays_more/",
            "comment_count": 178,
            "text": "I just read a post that criticized employees who focus on salary over job satisfaction and I wanted to offer a rebuttal.  You can read the tl;dr at the bottom but I have a story that explains my opinion.\n\nAt the very beginning of 2019 I was faced with a choice. I could stick with a job that I enjoyed with a team of amazing engineers where I was learning a lot and meaningfully contributing to a worthwhile project.  Or I could take a job offer I received for about 50% increased total compensation with great benefits doing more boring work.  I took the new job. It wasn't that I was underpaid by my previous employer, it's just that the offer was for a contracting job in a particularly lucrative niche.\n\nAfter giving two weeks notice to my boss I made a comment in passing to the effect of \"I'm sure I won't like the new job as much but I need to do what's best for my family.\" Well he latched on to that and we had a conversation where he said \"you shouldn't just take a job for the money.\"  He said it in a way that wasn't attacking my decision but was just giving career advice and it really made me question my choice.\n\nWell about a month and a half into the new job my state announced its COVID stay-at-home order.  My wife and I did some last minute grocery shopping and as we are walking from the car to our front door we are mugged at gunpoint by two men.  They take our wallets, phones, and even my car (which was thankfully recovered but needed repairs). My wife's little sister was staying with us at the time so we made the decision to immediately relocate to a safer area.\n\nBetween replacing our phones, the mechanic bill, early lease termination, and relocating costs this was a very expensive ordeal.  We have been living paycheck-to-paycheck since then while our finances stabilize.  If I hadn't taken the higher paying job then I wouldn't have been able to move to a safer neighborhood and I would have to live knowing that my wife and our family could be looking at a gun any time we walked out the door. \n\nSo the beliefs that I now hold, and **here's the tl;dr:**\n\n* Money is *safety*\n* More money means the ability to:\n   * live in a safe area\n   * pay for medical costs (we are in the US)\n   * purchase security equipment (home security cameras, etc)\n   * respond to unforeseen expenses like car problems\n\nI will never fault a coworker or employee for switching jobs to earn more money.  It may sound dramatic, but quite literally their life could depend on it."
        },
        {
            "title": "New Grads: don't worry too much about the perfect first job",
            "flair": null,
            "date_created": "12-29-2020 00:02:03",
            "upvotes": 1425,
            "upvote_ratio": 0.95,
            "id": "klyxns",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/klyxns/new_grads_dont_worry_too_much_about_the_perfect/",
            "comment_count": 389,
            "text": "I am an ex-big 4 worker, and I must say, that place was hell. As a new grad coming from a mediocre school and only a couple small internships, getting a job at \\[biggest cloud company in the world\\] was a dream! I worked extremely hard preparing for interviews my whole senior year and I thought I was going to be set for the rest of my life.\n\nLuckily, when I got to Seattle, I came to an org that was in the middle of being disassembled from the top to the bottom. I had an extremely incompetent manager who was just looking out for himself, a team of engineers who preferred to speak in Mandarin over English, and not a single piece of documentation for our code base.\n\nThe cherry on top was my first conversation with my manager was \"we can hire SDE1's at anytime, so you are not that useful until you can get to SDE2\".\n\nAfter not having a single day of vacation for over a year (yes I worked on Christmas thanks to the company's oncall 24/7 policy!), half my team moving to other companies, and a manager change, I was put on the bottom of my team's ranking list because I had the least amount of experience. At the end of the day, you are worth as much as the years on your resume, how else is a manager that doesn't know you suppose to rank you amongst everyone else at a company that requires rankings? It was devastating to me that after working so hard work (at an estimated average of 50 to 60 hours a week), that it didn't matter.\n\nThis was all almost a year ago now, but I have been at my new company and, even though the work is not as difficult, I am not having constant panic attacks to get stressful, mismanaged work done.\n\nThis work force will chew you up, and I see a lot of new grad peers constantly stressing out about getting that perfect job. The only thing that matters is working somewhere that is not bad for your health. Literally just being in this industry for multiple years will get you more than enough money, you don't need to be a \"rockstar\", that is all just marketing/recruiter BS."
        },
        {
            "title": "How did life change for you when you got your first well-paying job?",
            "flair": "Meta",
            "date_created": "02-16-2021 01:28:09",
            "upvotes": 50,
            "upvote_ratio": 0.85,
            "id": "lkox2s",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lkox2s/how_did_life_change_for_you_when_you_got_your/",
            "comment_count": 79,
            "text": "Currently pursuing my CS degree and am very stressed. I love coding and I am making the right choice, but am having all sorts of existential angst right now. I don't know if this is appropriate for this subreddit, but I'd like to hear stories of what it was like when you \"made it\" so to speak, when you went from being a broke student or working a shit job, to getting hired somewhere that paid you a  livable salary. I could use some motivation haha."
        },
        {
            "title": "Software engineers with 1-3 years of experience, how does the pandemic job market compare to your new grad job market?",
            "flair": "Experienced",
            "date_created": "02-12-2021 19:05:53",
            "upvotes": 79,
            "upvote_ratio": 0.91,
            "id": "lie33x",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lie33x/software_engineers_with_13_years_of_experience/",
            "comment_count": 65,
            "text": "As a new grad 2 years ago, I applied to about 100 jobs, I was in the interview process with 6 companies, and I got 2 offers.\n\n\n\n\n\nI'm currently working as a software engineer now.  Since November, I applied to about 150 jobs.  I have had about 10 calls with recruiters after applying for jobs.  Half of them went on to more technical rounds.  Despite doing well in the later rounds, I got rejected in favor of the hiring manager wanting to pursue other job candidates, who are probably more experienced.\n\n\n\n\n\nI doubt it's because I am a bad interviewer, because I had no problem interviewing as a new grad."
        },
        {
            "title": "What are the best career paths/jobs/are of expertise for C/C++?",
            "flair": null,
            "date_created": "02-21-2021 22:25:16",
            "upvotes": 49,
            "upvote_ratio": 0.91,
            "id": "lp4gl5",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lp4gl5/what_are_the_best_career_pathsjobsare_of/",
            "comment_count": 45,
            "text": "Like python is clearly for AI, Javascript for web, what's the best best programming areas for C/C++?"
        },
        {
            "title": "How did you get your SECOND job out of college?",
            "flair": null,
            "date_created": "01-15-2021 22:22:02",
            "upvotes": 362,
            "upvote_ratio": 0.96,
            "id": "ky1ozi",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ky1ozi/how_did_you_get_your_second_job_out_of_college/",
            "comment_count": 176,
            "text": "I’m currently almost 2 years into my career at a very large corporation. I graduated in the spring of 2019 and am now looking to move on to a new job with a different company, but within the same space that I currently work. My question is, what advice do you guys have in the search for the second job out of college? \n\nI haven’t been working for 2 years quite yet. Would I still be looking for more “entry level” positions? Associate? Junior? I feel like I am too qualified for entry level since all the postings I see are looking for people that haven’t graduated yet. And when I find job postings mentioning “associate” or “junior”, most of them are still looking for at least 3-5 years of experience. \n\nSo to the people that worked at a company for 2 years or less after college and were able to find another job, how did you do it? I’ve been applying but have still been under qualified and rejected. I just don’t really know what I’m qualified for at this point. Surprisingly, finding a job while in college seemed much easier. \n\nAny advice is greatly appreciate. Thanks!!"
        },
        {
            "title": "How unique is my job situation?",
            "flair": "Experienced",
            "date_created": "01-05-2021 19:39:14",
            "upvotes": 555,
            "upvote_ratio": 0.97,
            "id": "kr20es",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kr20es/how_unique_is_my_job_situation/",
            "comment_count": 252,
            "text": "Hi all. I work for an all remote team as a web dev doing mostly front end work. I've been at my current company for 2 years and I'm ready to search for something new in hopes of a higher salary, however I'm not sure if what I'm giving up is 'rare' or not as I've only worked for two companies so far in my career.\n\nTo be specific, the pros/cons of my job situation are:\n\nPros\n\n1. In a typical week I spend only around 28-30 hrs at my computer. The extra 10-12 hours are spent working out, eating lunch, etc\n2. Work is almost always no pressure, I often do all of the time estimation for my tickets and can decide how long I think it will take to get something done. I have never been told to work faster, or had my performance criticized\n3. It is very rare for me to have to be in any meetings other than 30 minutes of a daily standup call in which I rarely have to participate\n4. I’ve never been contacted outside of work hours or asked to work over time, and I’m not required to be on call\n5. When doing front end work, I make design choices almost entirely on my own\n6. I work with modern technologies\n7. I never have any issues with my coworkers or team lead. I can go to anyone for help and they will do their best to tackle whatever problem I’m having with me\n8. I’m never asked to do anything out of my job description\n\nCons\n\n1. I make $80k/yr, changing companies would likely make me quite a bit more than a raise ever could (but for the hours I'm *actually working,* could I even consider myself underpaid? I'm not sure)\n2. Neither the benefits nor the 401k match are very good\n3. I live in a high cost of living area due to my S/O's schooling, and won't be moving for a few years. I like to save as much as possible every month, and my salary being lower than the area's average pay doesn't do me any favors\n\n**TLDR**: I feel I have a good work/life balance that I am afraid to give up in exchange for more money, which won't even make me happier. Has anyone been in a similar situation? How did you handle it? How unique is my current work situation?\n\nAlso, it might be worth noting that I am only interested in working for all remote companies\n\nThank you"
        },
        {
            "title": "Are you more willing to apply to a job if the company publicly lists the salary range?",
            "flair": null,
            "date_created": "01-06-2021 23:06:36",
            "upvotes": 921,
            "upvote_ratio": 0.99,
            "id": "krw044",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/krw044/are_you_more_willing_to_apply_to_a_job_if_the/",
            "comment_count": 184,
            "text": "I find myself basically skipping over jobs that don’t even imply what the range would be.\n\nI went through a job interview process a few months back that lasted 2 weeks, only for them to offer $30k less than my salary I asked for on the first day, because they didn’t publicly list their salaries.\n\nIs that normal? What do y’all think?"
        },
        {
            "title": "CS jobs which don't require sitting in front of the PC all day.",
            "flair": null,
            "date_created": "01-01-2021 17:03:13",
            "upvotes": 602,
            "upvote_ratio": 0.93,
            "id": "kobr3g",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kobr3g/cs_jobs_which_dont_require_sitting_in_front_of/",
            "comment_count": 280,
            "text": "Hey guys!\n\nI'm currently in university studying CS and sustained an injury last semester which impedes me from working on a PC for a long time (especially typing which is kinda essential to programming). I'm working on fixing it also look for alternatives like programming with my voice and so on but it got me thinking. Programming in and of itself was never something I truly enjoyed, it was always more a mean to an end since I enjoy planning and seeing my creation way more than the act of typing itself. Furthermore I'm not sure anymore if I want to sit all day in front of a PC because nowadays I don't feel as comfortable sitting in front of screen all day like I used to but I would still very much like to work with my brain but in the 21 century I don't see that working outside a very computerized environment.\n\nSo I wanted to ask you know some other CS related jobs which don't require an excessive amount of time in front of a PC since I don't see myself becoming a programmer anymore and don't what I want to become anymore.\n\nAnyways, I hope y'all stay safe!"
        },
        {
            "title": "Quitting my job tomorrow, this is how I intend to go about it. Any advice?",
            "flair": "Experienced",
            "date_created": "02-04-2021 23:45:33",
            "upvotes": 121,
            "upvote_ratio": 0.98,
            "id": "lcpmyw",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lcpmyw/quitting_my_job_tomorrow_this_is_how_i_intend_to/",
            "comment_count": 69,
            "text": "Due to feeling unappreciated by upper management and HR at my company for the past year I made the decision to find a new job after working at my company for 3 years. (This is also my first job out of college). \n\nI accepted an offer two days ago, filled out the background check, and am now in the process of getting my equipment shipped to me to work from home. \n\nMy intention is to talk to my manager over video tomorrow and give him my two week notice. After the meeting is over email him my official resignation. Once this is done I intend to tell my team if my manager has no qualms about it. \n\nI kind of feel weird for leaving. This is the best thing for my career (I believe at this time) but I still find it hard to say goodbye. \n\nI never talked about my grievances with the company with my direct team (just my manager), I love my team but never mentioned it. I feel like I'm blind siding them with this because I didn't ever mention I was thinking of leaving, but I really couldn't because my company has laid people off and I didn't want to be put in the awkward situation of saying I want to leave while lay offs are possible. \n\nPlus this job hunt hasn't been super easy for me as multiple companies have reviewed me up until the on-site and rejected me, said they're not hiring, or just never said anything. So nothing has ever been guaranteed, even my current offer could be pulled if they felt like it. So that's why I never wanted to say anything to anyone.\n\nAny advice? Should I do anything different?"
        },
        {
            "title": "How an average student with no internships landed a SWE job after 600 job applications",
            "flair": "New Grad",
            "date_created": "01-15-2021 00:02:45",
            "upvotes": 858,
            "upvote_ratio": 0.95,
            "id": "kxepoo",
            "edited": "01-14-2021 16:06:52",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kxepoo/how_an_average_student_with_no_internships_landed/",
            "comment_count": 100,
            "text": "TL:DR at bottom.\n\n**Background:**\n\nCall me Mister Average. I had a 2.84 GPA coming out from my B.S. in CompSci that I finished in May 2020, as well as no internships during schooling. I didn't take schooling in general very seriously, and would receive B's and C's in many of the courses. I didn't realize how important it was to have a internship until my first semester into senior year.\n\n\n\n**The Plan:**\n\nOh no! I'm out of time to get an internship! \"what ever will I do????\" is what you're asking. Well this is not the time for should've/could've mindset. We progress only forward now. There is nothing back there, look forward and keep marching.\n\nI knew it was going to be a tough journey, especially during 'Rona season so it was going to be extremely difficult for me to land anything. So I had to come up with a plan:\n\n1. Wake up early every morning and begin applying to Indeed, Glassdoor and then Linkedin.\n2. Work on personal projects\n3. Leetcode\n\n**The Process:**\n\n\nSo every single morning, I would get up and immediately take myself to the PC and begin applying. At first, I didn't know which jobs to apply to so I applied to all of them. 100 or so rejection emails later all saying \"Unfortunately we have decided to pursue other candidates at this time\", and then I got my first phone interview. It was a recruiting agency that worked with government contracting for the most part. She begin asking me questions that would be on the interview such as:\n\n1. Why do you want to work at X?\n\n2. Where do you see yourself in 5-10 years?\n\n3. What challenges have you faced?\n\n4. Describe yourself.\n\n5. Why should we hire you?\n\n6. Do you want to ask us any questions\n\n\n\nYou are probably thinking I was demolishing these questions, getting every single one perfect for how the recruiter would have wanted it right? \n\n**You're Wrong**\n\nI was stammering, nervous, mumbling, and often times throughout these questions I would just say \"I don't know.\" Did I get past the first phone interview? No, but guess what? \n\n**I just figured out some questions that would be asked in the next interview I take. The only way to truly succeed in this world is to fail.**\n\nThese questions should be **ingrained in your skull**. If you have a SO, roommate, brother, sister, mother, father, etc. to practice these questions on, then it will be better. And if you're on the boat as me, you don't so guess what? We are going to practice these questions before every single interview BY YOURSELF and say them all meticulously.\n\nB-b-but 8754378543a, which one of those questions are the most important?\n\nWell son, I would personally say that the final one is, and here is the reason I think it really helps: It shows how interested you are in the position. Should you fire 10-20 questions at them, and extend the interview by 30 minutes? \n\nNo.\n\nWhat you want to do with this is simply ask questions that if you were in the shoes of the employer, you would think to yourself \"Great Question\". Do you know how many times I have failed an interview but the dopamine hit of having the employer say \"Great Question\" when it came time for the questions to the interviewer? \n\nA lot.\n\nUnderstand what the business does, and use your questions based on that research. Also hit them with general questions such as \"What do you like about working at X?\", \"How is the WLB\", \"How has X Company been affected by 'Rona?\" as well. \n\nOn the same boat, speak about your personal projects as though they are your own children. Speak about the complexities of the problems that you faced were, **AND THEN HOW YOU SOLVED THEM**, speak about the tech stack you used, **AND WHY YOU USED THEM**, and finally give any important tidbits of information to show them how hard you worked on the application.\n\nNow finally, it's time to speak about the elephant in the room:\n\n**LEETCODE**\n\nThis sub likes to jump on the importance on leetcode, and to practice it every day. Now, don't get me wrong. It is in fact quite important to pass the coding part of the technical interview, but that is only half the battle. Remember that the questions discussed in the last section are the other half. But let's get started with the leetcode discussion. \n\nWhat to study?\n\nI would personally go with something like the blind 75:\n\nhttps://www.teamblind.com/post/New-Year-Gift---Curated-List-of-Top-75-LeetCode-Questions-to-Save-Your-Time-OaM1orEU\n\nB-b-b-but 8754378543a, is that it? \n\nWell not only are you finishing each of these questions, but EVERY SINGLE TIME:\n\n1. You describe the code to yourself.\n\n2. Describe your thought process as you are writing it.\n\n3. What are some of the optimizations that can be made to it? \n\n4. What is the Space/Time Complexity now, and with further optimizations, what can it be taken to?\n\nAnd here is a final question before I get to the end of the post with the conclusion.\n\nWith just the blind 75 and leetcode daily you must have destroyed the technical part?\n\n**Once again, it's a resounding NO**\n\nI was once again, a stammering mess with voice cracks, chocking up, and general spaghetti coming out of my pockets. But guess what? I didn't give up, every single time I fell, I got myself back up and kept doing more and more technical interviews until I was proficient. And with 600 applications, 10 technical interviews under my belt. I finally received a SWE offer and I couldn't be more proud of myself and the journey it took to get here. More than half a year of constant fighting to get to where I am now. The me that existed months ago would be happy to know I finally got to my destination. I don't care if 1 or 2 people actually view this post, as long as I can lend a hand to those of you can't see the peak of the mountain and are discouraged ready to turn back. Allow me to lend a hand, and tell you that a mindset of moving forward, taking hits and getting back up, and you will see yourself at the top of that mountain. When you do however, I want you to lend a hand to those that can't see the peak.\n\nTL:DR: Fall, and then get up. Fail, and then succeed. Wake up, apply, work on personal projects, and leetcode. And most importantly, ask questions in your interviews."
        },
        {
            "title": "Spent 2 years unemployed after graduation. Finally got my first job in late Dec. of 2020, but it's in an obscure language. How bad is this for my career?",
            "flair": null,
            "date_created": "01-03-2021 22:28:02",
            "upvotes": 769,
            "upvote_ratio": 0.95,
            "id": "kpr2iu",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kpr2iu/spent_2_years_unemployed_after_graduation_finally/",
            "comment_count": 197,
            "text": "Title basically sums up this entire post. I'll quickly go over a bit of background info about me just for context: I graduated from a mid-tier (I think?) college in Summer of 2019. Immediately after graduating, I spent some time preparing for interviews and building personal projects using JavaScript and the MERN stack just to pad my resume, all while applying for jobs (albeit casually). I wasn't able to find anything until around late February 2020, when I finally received an offer from a local company. \n\nThe pay wasn't great and it didn't offer any benefits (it was a contract-to-hire role), but I was already around 7 or 8 months out from graduation so I was just glad to have finally found a job. Then the COVID lockdown hit my state and that offer got rescinded. I spent the rest of 2020 building more personal projects (again w/ JavaScript and MERN, even picked up GraphQL) frantically applying to basically any software engineer position I could find on LinkedIn, Glassdoor, Indeed, you name it.\n\nFinally, in early December of 2020, I got a call from a recruiter who was trying to fill a position for a mid-size-ish European company. After a short conversation, I was told that they were looking for someone with experience (I spent all of 2020 hearing lines to this effect, so I basically assumed this was gonna be another rejection), but that they would try to convince the company to give me an interview anyway. In the interest of brevity I won't bore anyone with in-depth info about the process. Suffice it to say I found it pretty grueling for a company of its size and value. The process included something approximating an IQ test, and then 5 interviews (2 HR, 2 technical, then a final interview w/ some execs). \n\nLong story short, I did really well on the interviews (according to my recruiter, who I had frequent communications with). I got an offer, and like my first offer, it isn't great (though it is a bit higher than the offer I got in early 2020), but at least I wouldn't starve, and this company actually offers benefits, so I've got health insurance too. I accepted the offer and they sent me a laptop and a bunch of other equipment. I start in a few days.\n\nThere's just one problem. The company's flagship product/service (what I'd be working on) is coded in what seems to be a very obscure programming language called Smalltalk. I did some research on it during the interview process and it's ancient (1972), though I'm pretty sure it has some modern implementations (I think the company I got hired by uses a platform called Pharo or something). Smalltalk doesn't look anything like any modern mainstream language I know of, certainly nothing like JavaScript, Java or Python. The syntax is pretty alien compared to those languages. Documentation, learning materials and forums/communities for it are sparse.\n\nI'm a regular lurker on this board and I've seen lot of concerns raised about companies that use proprietary languages and such. While Smalltalk isn't proprietary to this company, it's obscure enough that I feel like it might as well be a proprietary language.\n\nWhile I'm glad to finally have a job (again... fingers crossed), I'm kind of feeling a little depressed because I feel like the experience I'll get is going to be worthless, since it's in a language that is so alien relative to more modern, mainstream ones. I know that a lot of people say that what matters most is knowledge of the fundamentals or whatever, but throughout 2020 literally every job posting I saw wanted 3+ years of experience with specific languages or tools, be it JavaScript, React, Python,  Java, Spring, C#, or whatever. I really don't want to be pidgeonholed into having to look for basically nonexistent Smalltalk positions if I lose this job or want to switch jobs for whatever other reason in the future.\n\nIs the language/framework you work with important enough to warrant trying to switch jobs as soon as I possibly can? If so, what's the shortest amount of time I can stay with this company before switching jobs without having it look bad on my resume? Will working this job for any extended period at all negatively affect my future prospects in jobs that involve mainstream, in-demand tools?\n\nThanks in advance."
        },
        {
            "title": "Feeling down about my job search",
            "flair": "New Grad",
            "date_created": "02-09-2021 19:39:09",
            "upvotes": 44,
            "upvote_ratio": 0.89,
            "id": "lg7a47",
            "edited": "02-10-2021 10:54:09",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lg7a47/feeling_down_about_my_job_search/",
            "comment_count": 60,
            "text": "I graduated in dec 2020 with a math and com sci degree and have yet to find a job. I turned down an offer from HCL back in December and now I am regretting it, hard. I felt like since I had a job offer right out of college that finding another would not be too difficult. WRONG. I went through a coding boot camp that had a job offer at the end and I was not chosen. My coding skills are basic at best but I know if given a chance I would fucking kill it and learn fast. I have applied to over 100 places I’m sure. I know it’s only February but fuck why does it feel like the end? I literally feel like I should change my career aspirations bc I can’t find a damn job. I suffer from depression and  bipolar 2 so I’m sure all these feelings are just feelings and not facts. But fuck it’s hard to get out of that mindset when my life is a cluster fuck and I know getting a job would change that. I guess I’m here to vent and to hear anyone else’s experience trying to find a job as a new grad in the middle of a fucking pandemic. Thanks for reading.\n\n\nEdit: I truly appreciate everyone giving their input on how the job search is going for them. \n\nI’d also like to reply to the people who think I’m entitled to a job, lol. I truly don’t feel that way I was only setting the scene of who I was and what I was going through. I grew up on tough love so I have some empathy for you on why you would feel that way. So even to those people, thanks for your reply!\n\nAlso btw I’m a woman so she/her."
        },
        {
            "title": "Anyone here worked a remote software dev job and travelled around the US? What was your experience like and what tips do you have?",
            "flair": "New Grad",
            "date_created": "02-24-2021 18:36:42",
            "upvotes": 35,
            "upvote_ratio": 0.93,
            "id": "lrfnur",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lrfnur/anyone_here_worked_a_remote_software_dev_job_and/",
            "comment_count": 23,
            "text": "Also, whats the tax situation like?"
        },
        {
            "title": "Indians who went to the US for Masters in CS, what major differences you found in the curriculum and job hunt ecosystem?",
            "flair": null,
            "date_created": "02-09-2021 15:12:00",
            "upvotes": 51,
            "upvote_ratio": 0.73,
            "id": "lg232r",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lg232r/indians_who_went_to_the_us_for_masters_in_cs_what/",
            "comment_count": 51,
            "text": "What should someone, who is coming for Masters in fall 2021, expect?\n\nI know the salaries are pretty high but the competitiveness is even higher. But apart from that, how is the course different from what we already know?\nAnd most importantly, are you happy with the career choice you made?"
        },
        {
            "title": "\"They can't move out fast enough\". What will this mean for the new grad job market in San Fran?",
            "flair": null,
            "date_created": "01-17-2021 15:04:31",
            "upvotes": 144,
            "upvote_ratio": 0.91,
            "id": "kz5avn",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kz5avn/they_cant_move_out_fast_enough_what_will_this/",
            "comment_count": 137,
            "text": "https://www.nytimes.com/2021/01/14/technology/san-francisco-covid-work-moving.html?action=click&module=Editors%20Picks&pgtype=Homepage\n\nInteresting story on companies moving out of NoCal.\n\n\"That’s where the story of the Bay Area’s latest tech era is ending for a growing crowd of tech workers and their companies. They have suddenly movable jobs and money in the bank — money that will go plenty further somewhere else.\""
        },
        {
            "title": "Got a job offer for a lower salary than what was mentioned due to not have a certain credential. Still waiting to hear back. Should I be worried?",
            "flair": null,
            "date_created": "01-29-2021 05:43:12",
            "upvotes": 310,
            "upvote_ratio": 0.98,
            "id": "l7gv6s",
            "edited": "01-28-2021 21:51:36",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l7gv6s/got_a_job_offer_for_a_lower_salary_than_what_was/",
            "comment_count": 40,
            "text": "This is in Louisiana for a DBA role. I got an offer for $86k, but was told twice before and after the interview that the range was $91k - $95k. The job listed only 3-5 years experience, but I have 6+ years experience. They said the reason they had to pay lower was because I didn't have a bachelors in CS so they had to waive it. The degree wasn't mandatory as the job description said Bachelors or revelant experience. I have all the skills and also have the experience in the same industry as the company. Im also a US citizen if that matters.\n\nBefore I made a counter, I asked the HR guy if there was a possibility of the offer being rescinded and he said 100 percent they will not do that and at most they would  decline the counter. When I got the offer, I asked if I could take 1 day to think it over and he said he can submit a counter offer if I wanted so I did. I was very polite and also apologetic to the HR guy because I felt bad he had to do extra work. \n\nShould I be worried of it getting rescinded? I believe I'm their first pick but I'm worried right now that they are trying to get someone else with a degree and have me on the back burner. I did notice they removed their job listen for there role. It has been 2 days since I made the counter.\n\n What are your thoughts?\n\nEDIT: Sorry, I forgot to mentioned I countered to have the salary increased to $95k, which is still a bit lower than market rate and lower than what I had previously made in my past jobs.\n\nEDIT 2: Not sure if this matters, but normally a candidate had to go to a 3rd round to meet with the CTO, but the hiring managers I guess liked me enough to have me bypass the 3rd round."
        },
        {
            "title": "How did you break out of the cycle of \"easier\", lower-paying jobs into a higher paying job?",
            "flair": "Experienced",
            "date_created": "02-21-2021 22:56:51",
            "upvotes": 29,
            "upvote_ratio": 0.82,
            "id": "lp54u0",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lp54u0/how_did_you_break_out_of_the_cycle_of_easier/",
            "comment_count": 22,
            "text": "I'm coming up on about 3 years of experience, plus a years internship. \n\nMy first job was $60,000 in Orlando/remote (only going into the office once a month for the last year - so I lived in S. FL). \n\nMy S/O had to move to San Diego, and it seemed like the only job I could find an offer for was a $70,000 job. Both jobs were relatively easy to get, but I feel like I need to try something more ambitious, if only for a few years. $70,000 in southern California sucks, too. \n\nI know the general talk of \"just bang out leetcode bro\", but at 3 YOE, will they be asking me more advanced questions? I'm just started learning leetcode, and this stuff is pretty difficult to me. But I'm concerned if I take like 6 months to get up to speed, they might expect more of me as a mid-level engineer? Or am I just being anxious and psyching myself out?"
        },
        {
            "title": "I’ve seen a lot of success stories for first full time offer, I’m curious about how you get into your second SWE job",
            "flair": "Experienced",
            "date_created": "02-16-2021 10:38:55",
            "upvotes": 31,
            "upvote_ratio": 0.9,
            "id": "lkyuw0",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lkyuw0/ive_seen_a_lot_of_success_stories_for_first_full/",
            "comment_count": 30,
            "text": "The title says it all. I’m currently at a not too bad but not so great enterprise software company as a new grad ( pay ~110k in the Bay). Wondering if I have a chance moving to a more prestigious company when I jump ship 1-2 years down the line."
        },
        {
            "title": "I'm a liberal arts major who received a full-time SWE job offer, my experience breaking into tech",
            "flair": "New Grad",
            "date_created": "12-22-2020 01:23:52",
            "upvotes": 1792,
            "upvote_ratio": 0.93,
            "id": "khrsw5",
            "edited": "12-22-2020 17:00:28",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/khrsw5/im_a_liberal_arts_major_who_received_a_fulltime/",
            "comment_count": 145,
            "text": "I was starting my last year of completing my liberal arts degree when I decided to teach myself how to code in Python. I took my first CS class later that year and fell in love with it, and decided I wanted to pursue software engineering.\n\nI had a lot of cards stacked against me, I was a recently homeless woman of color in a low-income, single-parent household, and it was too late for me to pursue a CS degree. I decided to take as many CS classes as possible and decided to teach myself everything else along the way. I knew my tech skills weren't the strongest, but I had professional work experience and always excelled at soft-skills. I was able to find a tech-adjacent job and that job helped me land more formal CS experience. I took a lot of advice from this subreddit; I went to hackathons, did Leetcode, and contributed to open-source projects. Unfortunately I ended up graduating into a COVID recession, but after 3 months of applying aggressively (close to 800 applications), screwing up technical interviews, etc. I finally landed \\*one\\* full-time software engineering job offer. It's not FAANG or a tech company for that matter, and the location is not ideal, but the salary is great and I know it will open a lot of doors for me.\n\nI wanted to share my experience to show that you can succeed in this field with an unconventional background. Tech skills are important but your soft skills are indispensable - I'm certain that my soft skills are what helped me land this job. I'm happy to answer any questions or hear from other people with a similar background/experience.\n\nEdit: Wow thank you for all the awards and positive comments! I noticed there is some confusion about my timeline in the comments, so I wanted to clarify that I ended up taking another year of college to take as many CS classes as possible. I have a little over 2 years of programming experience now."
        },
        {
            "title": "I just got a job at a dream company but I’m literally the last man left in my tech team, should I take it?",
            "flair": null,
            "date_created": "02-21-2021 04:18:17",
            "upvotes": 12,
            "upvote_ratio": 0.94,
            "id": "lolobm",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lolobm/i_just_got_a_job_at_a_dream_company_but_im/",
            "comment_count": 36,
            "text": "So we had been asking for a pay rise at our company, it didn’t happen until our CTO resigned. It’s a pretty small team of 4 devs, so 3 others have resigned and gotten other jobs. All this happened in the space of a month. The owner of the company called me into his office to beg me to stay and even gave me an increase and promised to build a new team around me. Ex-colleagues say he always says that and just wants me to help ease in the newbies. \n\nFew days later, I got a job at a dream company(Senior role) for twice the pay and now I’m really thinking of resigning too, but if I do, it will be impossible for the company to cope as it needs its tech team on a daily basis. Just one new replacement has been brought in so far and he’s not even resumed yet. I had given my word to the owner that I wouldn’t leave yet as I don’t want the company to get to its knees \n\nPlease how do I approach this as I am highly leaning towards resigning and going for my dream job"
        },
        {
            "title": "Since when graduated needs to have AWS, Docker, Kubernetes experience in order to get a job?",
            "flair": "New Grad",
            "date_created": "01-26-2021 14:28:34",
            "upvotes": 107,
            "upvote_ratio": 0.91,
            "id": "l5c66l",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l5c66l/since_when_graduated_needs_to_have_aws_docker/",
            "comment_count": 62,
            "text": "God, I feel so lost in this job market. To me, it is crazy to expect someone to have experience with cloud development right after graduation.\n\nNext thing you know, they will ask us to have experience with quantum computing!"
        },
        {
            "title": "Have you lost a job due to bad performance? What happerned exactly?",
            "flair": null,
            "date_created": "02-06-2021 17:10:43",
            "upvotes": 45,
            "upvote_ratio": 0.9,
            "id": "ldybpc",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ldybpc/have_you_lost_a_job_due_to_bad_performance_what/",
            "comment_count": 39,
            "text": "I read regularly successful and motivating stories of self learners but I am not aware of the failures in work place."
        },
        {
            "title": "Junior Dev - I'm being told everywhere(including reddit and my job) to ask questions, but whenever I do, I'm being met with unnecessary hostility that makes me feel like an idiot. What do? Is this normal?",
            "flair": null,
            "date_created": "01-04-2021 15:39:17",
            "upvotes": 417,
            "upvote_ratio": 0.97,
            "id": "kq7z63",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kq7z63/junior_dev_im_being_told_everywhereincluding/",
            "comment_count": 117,
            "text": "So I'm working in this company for 7 months now. For the most part it has been great until I've been moved to a project in an external company(feeling like a freelancer...) I've been given a large, high priority task in an extremely abstract and  complex application with unrealistic deadlines.\n\nI struggle, I struggle hard and even though I'm doing my best, the requirements either change, are not mentioned during meetings, or overcomplicate things to the point of me having to plan the structure for days. My problem is that I basically have noone to ask for help, Im alone on this, I have 0 guidance and I keep getting behind.\n\nTo be truthful help/guidance has been offered to me numerous times, but whenever I actually ask for it it goes something like this:\n\nMe: how should the relationship between A and B affect C? \nSDev:  Why didn't you ask me for D?\nMe: What about D?\nSDev: wooooow, well that sucks, what have you been doing all that time exactly? Look it up and get to work we have a deadline.\n\nMe: gets extremely anxious, spends hours on looking for a relation between A,B,C and D which turns out to not even exist.\n\n0 progress for an entire day. Next day manager knocks on the door asking about my progress. \n\nNotice that my original question was never actually answered. It's an endless cycle of anxiety and feeling like a failure.\n\nI'm absolutely terrified of asking questions to my manager and senior dev's because everyone seems to think \"he probably is slacking off all day, that's why he doesn't know anything, lemme make him feel bad about that\" rather than \"let's answer this question real quick, the feature will be done faster and everyone will be happy\".\n\nA week ago I've almost had a panic attack before weekly meeting because I always have to explain the reasons behind my failure, instead of showing successfully developed feature or at least a significant progress.\n\nI feel slow, anxious, burnt out, terrified of meetings, scared of going to work.\n\nI'm also extremely anxious about being fired, it's an extremely hard situation due to the pandemic and finding a new job could take quite a while. I earn very little(I can save like $100 a month). I feel defeated.\n\nDo you guys have any advice on what to do in a situation like this?"
        },
        {
            "title": "I just got offered my first job post-graduation. Should I take this job?",
            "flair": null,
            "date_created": "02-10-2021 21:43:10",
            "upvotes": 46,
            "upvote_ratio": 0.96,
            "id": "lh0hvh",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lh0hvh/i_just_got_offered_my_first_job_postgraduation/",
            "comment_count": 35,
            "text": "I just graduated in December with a CS degree and have been job searching for 3 weeks. This is the first job offer I've received. It's $45,000 a year. The job is for an IT position managing loan software (it's a special loan crm software where I'd write business rules and parameters in visual basic as needed) helping employees with issues related to the software, run reports, etc. While the job seems like a good job starting out of college, I'm worried about the job experience being too specific if I ever want to find another IT job outside of banking. I'm especially worried about the lack of development experience. Is CRM experience transferrable? I'd like to work in security one day as well, and I'm not sure this would help me."
        },
        {
            "title": "50k a year at 21, government job. Am I cutting myself short or is this good for a while?",
            "flair": "Student",
            "date_created": "02-15-2021 22:00:14",
            "upvotes": 25,
            "upvote_ratio": 0.83,
            "id": "lkkdyy",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lkkdyy/50k_a_year_at_21_government_job_am_i_cutting/",
            "comment_count": 29,
            "text": "So I’m a junior in college and I landed a 50k per year job (well only 25k because I’m only part time until school starts)\n\n\nI’m promised a job when I graduate and I’ll be making 50k a year. Not bad. I like in the Midwest too.\n\nBut then I realized how much I love this job. First off, it’s job security is insane. All of my coworkers have been working there for 10+ years at least. They all make pretty good salaries, great health insurance, and they still get PENSIONS for gods sake. \n\n6 weeks of time off per year, with random days like today Presidents’ Day off guaranteed. Like 2 weeks off for Xmas. None of that “unlimited pto” bullshit. \n\nGreat work life balance. Office is just chill. Never have to come in on weekends or any bullshit like that. \n\nIs the salary insanely high? No. But it’s a good living. \n\nHowever, my friends and fiancé think I’m selling myself short. That software engineers or system admin should be making a lot more, and if I plan to work here for a while I’m a loser.\n\nIs this true? Am I settling myself short? This job is so chill and I like it, and honestly I want to be one of the ones working there for 10+ years."
        },
        {
            "title": "Is there a job in CS that requires little actual programming?",
            "flair": null,
            "date_created": "02-11-2021 11:11:20",
            "upvotes": 25,
            "upvote_ratio": 0.83,
            "id": "lhg3zk",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lhg3zk/is_there_a_job_in_cs_that_requires_little_actual/",
            "comment_count": 40,
            "text": "Currently the most enjoyable part I find about programming is the conceptual thinking and possible implementations of solutions rather than the actual programming. Doubt that there's a career path that requires 0 programming (though feel free to prove me wrong), but what is the one that requires the least amount of actual programming? And a follow up, how much actual programming does a college educator need?"
        },
        {
            "title": "11 months after graduating, Starting first 6 figure job as Software Engineer -- A Bit Nervous",
            "flair": "New Grad",
            "date_created": "02-20-2021 05:14:58",
            "upvotes": 21,
            "upvote_ratio": 0.78,
            "id": "lnwrbr",
            "edited": "02-20-2021 03:52:30",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lnwrbr/11_months_after_graduating_starting_first_6/",
            "comment_count": 26,
            "text": "tl;dr: starting first real position, any advice or resources for a new developer who wants to become a great developer and senior software engineer?\n\nLooking forward, Need advice:\n\nI'm looking for advice on what I can do in and out of work to reach the peaks of a career in software engineering. Are there books you recommend every software developer should read? Are there things you wish you would have been doing or did when you began your career? What should I always keep in mind, what are some pitfalls (technical, interpersonal, financial, etc) to avoid? What productivity/efficiency techniques have helped you the most in your career? Any blogs or podcasts you recommend that touch on these things? \n\n\n\nA bit of my history: \n\ntldr: graduated with no internships at age 27, Went from unpaid internship to 73k dead end position, to a 100k offer that I start next month.\n\nI come from a poor immigrant family (Mexican), my dad is dead. I went back to school at 22 after waking up in a soulless, full-time, minimum wage job in a factory wondering how I got there and whether I could find a more impactful path in life. I managed to knuckle down and jump from a community college to 4-year university which I graduated from last year right as COVID hit. \n\nThe job hunt began with no internships under my belt and as expected resulted in a SCARCE amount of interviews. \n\nI started an unpaid  internship with a group of MBAs who were part of a UCI  start-up incubator. I wrote a simple Alexa skill using NodeJS that allowed a user to book an appointment with a (simulated) clinic. Even though it was relatively simple features, being thrust into AWS IAM intricacies and so on felt very overwhelming as I was their only developer. We reached a project checkpoint right before summer and I resigned to find a paid job, ready to work at a grocery store if I had to while I job hunted. I wasn't in a position to be unemployed for very long.\n\nLuckily, I got hired full time at 73k with TCS in August as part of a huge hiring surge they were conducting during COVID. They are a behemoth of bureacratic tape and after a positive initial experience in the training phase, all coding stopped and a dizzying shuffling began where I felt like I was lost in a crack of the company not coding anything and having no direction at all. I was on leetcode grinding and learning each day, sending out applications. \n\nA recruiter reached out on LinkedIn one day in late November and after a series of interviews with the company I got an offer for 100k that I start soon and want to bring a consistent \"A game\" to. My family tree pivots forever here with me, and I'm ready to do what it takes and apply all that I can muster to be competent enough to continue on this path seeking  mastery."
        },
        {
            "title": "What was you worst job switch?",
            "flair": null,
            "date_created": "01-31-2021 21:53:17",
            "upvotes": 84,
            "upvote_ratio": 0.96,
            "id": "l9j0c0",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l9j0c0/what_was_you_worst_job_switch/",
            "comment_count": 37,
            "text": "Often times in this subreddit we encourage people to job hop whether that's to maximize income, gain new experiences, be healthier/happier, or whatever. But sometimes things go awry at the new place. So what happened at yours?\n\nPersonally, my worst trade was abandoning the Amazon interview process for an SDEII role in favor of a medium-sized business in my area. They pitched the job as essentially breaking monoliths up into a microservice architecture, but within six months they pulled the old switcharoo. The management team that hired me got pushed out, 2 of my team's 3 products got EOL'd, and they were pushing for a WordPress rewrite for our final product."
        },
        {
            "title": "What was it like getting a software engineering job in the early 2010s?",
            "flair": "Experienced",
            "date_created": "02-13-2021 20:21:52",
            "upvotes": 26,
            "upvote_ratio": 0.86,
            "id": "lj4ql7",
            "edited": "02-13-2021 12:52:48",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lj4ql7/what_was_it_like_getting_a_software_engineering/",
            "comment_count": 31,
            "text": "I work with a senior software engineer who started out in 2011-2013.  He has a degree in econ and never took a CS course past intro to CS.  He taught himself basic frontend development from codeacademy and youtube, and eventually got a job as a frontend engineer at a small startup before moving into full stack developer roles at bigger companies.  He said back then, the fact he had an econ degree did not matter and a lot of employers were ok with him not having a CS degree.\n\n\n\n\n\n\nEven just before the pandemic destroyed the job market, it really was getting pretty competitive.  I noticed that this subreddit has turned against going the self-taught route and coding bootcamp route, and just recommended going back to school.  CS degrees, which seemed like a sure thing 5 years ago, has turned into 4 years of crazy competition for internships and jobs.  \n\n\n\n\n\nI started going to school for CS in the mid 2010s, and there was definitely this mentality like I'm getting a very valuable undergrad degree.  People said that the degree itself would guarantee employment, and getting an internship or two would be a huge bonus.  I graduated with one internship and had a decent time finding a job, and I had friends graduate with no internships who still found jobs.\n\n\n\n\n\nI'm still surprised when I see the number of people from top schools applying for jobs at my company without internships.  I'm also shocked to see people graduate with one or two internships from top schools struggling to find jobs."
        },
        {
            "title": "The bar for high paying jobs is getting impossibly high. It's not just leetcode, but distributed systems too.",
            "flair": null,
            "date_created": "02-06-2021 08:01:57",
            "upvotes": 12,
            "upvote_ratio": 0.56,
            "id": "ldqdm2",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ldqdm2/the_bar_for_high_paying_jobs_is_getting/",
            "comment_count": 89,
            "text": "Just got a reject from Amazon and Google because of my lack of distributed systems experience. Interviewed for entry-level positions.\n\nRead, watched, and did tons of system design interviews and questions. Have a bachelors and masters degree in CS with a 4.0 GPA and 2 years (non-distributed system intern) experience. One interviewer even commented my system design and knowledge of distributed systems is well beyond my years.\n\nGrinded hundreds of leetcode questions, read CTCI, read EPI, read tons of programming language books related to my language/stack so I could master it, spent countless hours watching talks on writing good code.\n\nRead distributed systems textbooks and was able to have conversations with interviewers on topics. Even discussed a side project I had been working on for several months where I implemented the Raft algorithm to make a multithreaded high availability scaling distributed in-memory key-value store with consistent hashing and active replication. Benchmarked, and can handle several million requests per second.\n\nSubmitted optimal questions for every leetcode problem and walked the interviewer through it every step of the way.\n\nThought I had it.\n\nBoth companies pretty much said the same thing to me:\n\nI performed exceptionally well on every metric but they're simply looking for people with more **work experience** on developing distributed systems.\n\nI literally applied for a generic entry level position, and both of them wanted 2+ yrs experience (which I have, just not in the right field, supposedly...)\n\nWelp. I tried so hard but I guess I'm stuck writing C++ for 60k/yr.\n\nThe bar is so impossibly high, now it's not enough to score perfect and have side projects... **you must have years experience doing the job position you are applying for too.**\n\nNot only that, but smaller companies won't even consider me for entry level positions in these fields because they all want 2-3 years + experience working on distributed systems. So I guess I'll never be able to get into a FAANG company or get those 100k+ jobs.\n\nHow do you all feel about this situation? Any thoughts on how the trends are going?"
        },
        {
            "title": "New Grad Struggling to get a job",
            "flair": null,
            "date_created": "02-16-2021 04:44:37",
            "upvotes": 28,
            "upvote_ratio": 0.93,
            "id": "lksrac",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lksrac/new_grad_struggling_to_get_a_job/",
            "comment_count": 20,
            "text": "Is anybody else in this position, graduated in December and haven’t had any luck. I’ve gotten a handful of interviews and failed most all of them in the final rounds. Anybody else going through this? I’m pretty bummed out."
        },
        {
            "title": "Would it be crazy to quit my 100k analytics job to pursue a bootcamp now?",
            "flair": null,
            "date_created": "02-19-2021 05:22:40",
            "upvotes": 7,
            "upvote_ratio": 1.0,
            "id": "ln46g8",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ln46g8/would_it_be_crazy_to_quit_my_100k_analytics_job/",
            "comment_count": 34,
            "text": "Hi! \n\n&#x200B;\n\nI've been at my job for about 3.5 years now working at a well known bank doing analytics. I have been considering enrolling a bootcamp for quite a while now and am trying to hear as many opinions before doing so. A little background about me: I went to a top 25 school, majored in math and have taken an intro to programming course in C++ (I did well in it and enjoyed it, but for some reason went the math route instead of CS). I have picked up SQL and Python by nature of my analytics job, but am by no means a programmer.\n\n&#x200B;\n\nMy question for you is: is it a bad idea to quit my job to pursue a bootcamp and pivot into SWE? I've heard mixed things about bootcamps and am a little bit worried about how they are regarded vs. a bachelor's in CS given the competitive job market for entry level devs."
        },
        {
            "title": "Is it weird to be totally feel ABSOLUTELY (101%) dumb on your first swe job?",
            "flair": "New Grad",
            "date_created": "02-18-2021 08:50:33",
            "upvotes": 24,
            "upvote_ratio": 0.82,
            "id": "lmf5h4",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lmf5h4/is_it_weird_to_be_totally_feel_absolutely_101/",
            "comment_count": 16,
            "text": "Recently got a job after a lot of hard work after graduating last year. No internship/work experience.\n\nApplied to a small company (2 full time engineers and 1 time part time) for a front end dev position even though they required 2 yrs of experience. \n\nThey gave me an interview due to my React experience. I made a few projects that they liked. I believe they liked my personality too and I eventually got the job. \n\nIt was my 2nd day today, I was told to try to understand the JSON coming from the backend and then make a React component displaying those data. The JSON seemed complicated as heck to me, TONS of info! The tech lead is super duper nice though and helps me a loooooot! And even tells me to ask for any help I need. However today I felt super dumb and believe I wasted a lot of his time as he was kind as heck to help me out leaving his own work, as a result he stayed back to finish his task that he *probably* couldn't complete because of me.\n\nI know it's only my 2nd day but I am already scared of being fired. Was my experience normal and generally what all new devs go through in their first job or am I really dumb? Also how do I become a better engineer?"
        },
        {
            "title": "Senior developer in a new job, not being helped, told that I should try learning myself more.",
            "flair": "Experienced",
            "date_created": "01-26-2021 11:41:56",
            "upvotes": 45,
            "upvote_ratio": 0.93,
            "id": "l59xmo",
            "edited": "01-26-2021 07:40:31",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l59xmo/senior_developer_in_a_new_job_not_being_helped/",
            "comment_count": 65,
            "text": "I joined a new company 2 months ago as a full stack developer, their codebase is huge and it has some red flags that I started seeing, such as when I asked what if a certain database query would be bad for the database, they told me it's unused code still being in the platform.\n\nFrom the start I got nearly no help, no pair programming, they feel like I should just look around in the code and try and understand everything, fair enough! It makes sense, but I'm getting stuck everywhere.\n\nI'm working on a feature now but I can't reproduce it on my local machine, I've asked the developers in Slack but I haven't gotten a response since yesterday.\n\nI had my first evaluation this week and I was told I should try and find solutions by myself more, since they feel like I'm disturbing some co-workers by asking too many questions for things I could have found out myself..\n\nAre these red flags? Should I just try to learn more? I'm just not the kind of person that likes working on a small feature for 2 weeks because the answers are nowhere to be found.\n\n**Edit: While the term senior is something I am in years of being a developer, my skill is more medior, I've been travelling, switching jobs, so my knowledge is scattered.**"
        },
        {
            "title": "How much notice to give? Quitting job after 3 months",
            "flair": null,
            "date_created": "02-19-2021 21:25:21",
            "upvotes": 13,
            "upvote_ratio": 0.94,
            "id": "lnmre3",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lnmre3/how_much_notice_to_give_quitting_job_after_3/",
            "comment_count": 17,
            "text": "Started a new job 3 months ago. It isn't a good fit, project not like what it was explained like to me, not interesting work to me, also not enjoying working with new colleagues remotely.\n\nI'm going to give notice but not sure how much time ahead I should do it. I am barely ramped up and basically useless, so 1 or 2 weeks notice seems like overkill. I was considering giving notice on a Thursday for a Friday last day?\n\nFor context, I have 6 years experience and enough money saved up that I'm just going to stay unemployed for the rest of shelter-in-place and work on personal projects and take classes, then get an in-person job whenever that is a thing again (probably early 2022).\n\nWDYT?"
        },
        {
            "title": "Switch job to modernize a monolith?",
            "flair": "Experienced",
            "date_created": "02-23-2021 18:12:34",
            "upvotes": 13,
            "upvote_ratio": 0.89,
            "id": "lqkmrz",
            "edited": "02-23-2021 11:57:06",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lqkmrz/switch_job_to_modernize_a_monolith/",
            "comment_count": 12,
            "text": "Hey everyone,\n\nI'm currently working as a software engineer in a modern environment - Microservices, Docker & Kubernetes, AWS, Messaging with Kafka. Everything is pretty relaxed and there is hardly any overtime. I can pretty much do what I want and am working in a great team.\n\nNow I've got a job offer with 30% more salary where my main task would be modernizing (and thus decomposing) a largely untested java monolith. The target architecture/technology pretty much looks like the one I am used to from my current job.\n\nSince I have never worked with a monolith or even modernized one, I am wondering whether I should take this job. On the one hand, I'm sure there would be a lot to learn for me (DDD techniques etc.), but on the other hand, I'm not sure whether all the potential headaches are worth the learning curve and the money.\n\nThis would be my first job change ever after 5 years in software engineering and I'm not sure if it would be a good step to make. There's more money and potential learning, but probably more frustrating work and a less modern environment to begin with.\n\nSo, what would you guys do? Has anyone taken a similar step and can report their experience? Was it a good idea or did it just hurt?\n\nThanks!"
        },
        {
            "title": "Where are all those remote jobs?",
            "flair": null,
            "date_created": "01-25-2021 15:44:17",
            "upvotes": 54,
            "upvote_ratio": 0.87,
            "id": "l4n5dr",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l4n5dr/where_are_all_those_remote_jobs/",
            "comment_count": 50,
            "text": "I keep seeing companies advertising \"fake remote\" positions (a.k.a. remote until WE consider Covid is an acceptable risk for you). One recruiter outright lied to me during the entire process (tests and all) and made me wait for the final offer to confirm me it was faux remote.\n\nOthers employers are shamelessly offering \"only 3 presential days per week\" in peak 3rd wave. Cmon this was even normal before Covid.\n\nI scrub LinkedIn every day and find very few 100% remote positions at country-level. There seems to be more positions offered  abroad, but they are usually restricted to a region (like \"remote but only in country X\"). Some freelance friends claim they get contacted a lot but the truth is they are doing mostly short projects. I'm not interested in freelancing for the moment.\n\nSeriously, where are all those remote jobs? Are most companies expecting Covid to just go away in a few months so that they can cram us again in open spaces as sheeple?"
        },
        {
            "title": "I got my dream job and I hate it",
            "flair": null,
            "date_created": "11-28-2020 04:23:20",
            "upvotes": 1173,
            "upvote_ratio": 0.93,
            "id": "k2e35x",
            "edited": "11-27-2020 23:08:45",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/k2e35x/i_got_my_dream_job_and_i_hate_it/",
            "comment_count": 326,
            "text": "( First world problems coming your way ) I recently became very “successful” in the past few months. I (22F) make well over a $100,000/yr, tech, but I have never been so unhappy. My job is incredibly stressful and I have no time to focus on my hobbies that do make me happy. I work 10-12 hour days. I am constantly filled with anxiety that something at work might go wrong and I’ll lose the company a ton of money and get fired ( I probably won’t get fired, but I constantly think I should be fired lol). I have never been an anxious person until starting this job. I am wondering if anyone else has ever job the job they worked all there life for, then fucking hated it. Should I quit?\n\nTLDR; I got my dream job and I hate it. Should I quit?"
        },
        {
            "title": "Had serious car accident, hands damaged and need 4-5 months to heal. Graduation pushed to the end of the summer. Will probably miss out on all the new grad jobs. How can I navigate this terrible situation?",
            "flair": "New Grad",
            "date_created": "02-23-2021 06:46:49",
            "upvotes": 15,
            "upvote_ratio": 0.79,
            "id": "lq8d3d",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lq8d3d/had_serious_car_accident_hands_damaged_and_need/",
            "comment_count": 10,
            "text": "Long story short, some idiot hit me when driving, destroyed lots of things, of which both my hands were included in that list. Doctors say I am looking at 6 months healing time. So far healing has been going along steady as the doctors predicted, but it's slow... promising and looking good, but slow. Nothing permanent so that is good.\n\nI obviously can't do any job right now while I'm in casts, and definitely won't be able to do any new grad job. I would be able to finish the rest of my courses due to accommodations but job searching is out of the question, let alone doing a job in May or June.\n\nI am *very* scared right now because if I graduate during the summer, then there's no grad jobs left. I had debated skipping the summer and graduating at the end of Fall 2021. However my family, which has to take care of me because of all I'm going through, for some reason dropped an ultimatum that I must graduate in the summer and delaying graduation is unacceptable. Considering this freak accident is not even my fault, and that I've had nothing but great success so far with jobs and a stellar GPA, I am caught so far out of left field by what you just read that I am beside myself.\n\nI have almost two years of work experience and went back to finishing school. I have two small names and one big name on my resume. Problem is I've been out of industry for two years as well, so a lot of stuff is no longer fresh.\n\nMy main question is: Are my chances significantly hurt by applying in September for graduate jobs? I am worried about dealing with a huge gap of unemployment and people looking at me weird. I guess I should say I don't know what to do and I'm really upset that everything has happened now.\n\nOne of the reasons I was looking towards grad jobs is because my friends say that new grad jobs let you pick more of the stuff you like, and that is very important to me since I want to do something I love and do it well rather than do something I don't care about. I do not know if they are telling me something untrue and that it doesn't matter, and I can just apply for stuff in September anyways since it won't differ from new grad jobs."
        },
        {
            "title": "How can a late-bloomer (28M) get a developer job?",
            "flair": null,
            "date_created": "02-10-2021 02:46:30",
            "upvotes": 11,
            "upvote_ratio": 0.72,
            "id": "lggtax",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lggtax/how_can_a_latebloomer_28m_get_a_developer_job/",
            "comment_count": 39,
            "text": "I don't have any experience nor a degree in CS but I've built things like compilers, cross-platform libraries, data structures (which should be obvious because that's necessary to write compilers), and have even designed software systems (which includes a 6K semicolon/11K lines of code modularized game mod).\n\nEvery developer position I apply for, even the Jr and entry level ones, are throwing out my applications. I have a github that can demonstrate my skills and yes they have documentation, readmes, and code licensing but it seems as if none of that even matters.\n\nNot to make this super heavy but I don't have experience or a degree because (trigger warning) >!I had spent over a decade battling depression, anxiety, and suicide attempts.!<\n\nAnd because of that, I fear my age, lack of schooling, and experience all put me at a severe disadvantage and it really sucks because I actually love programming and designing things, I currently do it as a hobby but I want to make it a career.\n\nBefore anyone asks, no I'm not good at selling myself, I've never been good at selling myself because I'm more of an \"action speaks louder than words\" type of guy. I'd rather make/do something to prove my value/worth than to just speak about it.\n\nAny advice/help/suggestions?"
        },
        {
            "title": "Software Developers, how much of your job is NOT software development?",
            "flair": null,
            "date_created": "12-09-2020 06:46:21",
            "upvotes": 709,
            "upvote_ratio": 0.98,
            "id": "k9k9hc",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/k9k9hc/software_developers_how_much_of_your_job_is_not/",
            "comment_count": 173,
            "text": " I was in college studying computer science and I wanted to have some real-world experience and so I sought out and eventually decided to work with a group who would train me in my field and then after 6 months, if I did well enough, I would have an internship in my field of interest. Well, my internship is coming to an end and I haven't done anything related to my particular track. Part of me does believe that this is normal and that internships are typically basic and as an intern, I'm not going to work on anything cutting edge, so I don't believe I had high expectations for what my internship would be like. But to have not done a single thing the past 3.5 months related to my interest has me wondering about this field of work.\n\nIs it normal to spend most of your day sending emails, clicking buttons, and networking as opposed to problem solving? If you had an internship in data analytics or software development, what was that experience like, and did you too do nothing related to your field the entire time?\n\nP.S. Yes, I've asked for more work, reached out to other team members in my field of interest, and whenever I ask my manager how I'm doing he says I'm doing fine."
        },
        {
            "title": "Should I take this job offer?",
            "flair": "New Grad",
            "date_created": "02-16-2021 18:44:55",
            "upvotes": 5,
            "upvote_ratio": 0.86,
            "id": "ll6id2",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ll6id2/should_i_take_this_job_offer/",
            "comment_count": 26,
            "text": "A bit of background: I’m a new grad with a poor GPA from a decent school. Recently been given a job offer (first one), and they’re also the first one that doesn’t mind my poor gpa. \n\nI’ve been told the pay is good but the company’s technologies are all proprietary meaning I’d have little to no transferable skills if I did end up taking the job. I’m still working on new projects and learning useful technologies to beef up my resume and continuing applying to jobs, but if i don’t find anything before I have to give them an answer, should I just take it? \n\nIs it better to have some work experience with irrelevant technologies for a year than to be job searching and trying to build up my resume instead? I’m worried about the scenario in a year where I wanna switch to something more fulfilling and can’t land a job due to lack of relevant experience. \nThank you for the help."
        },
        {
            "title": "I mostly blew off my cs degree, but I have a job anyways. How much value would I get revisiting fundamental cs topics?",
            "flair": null,
            "date_created": "02-02-2021 20:27:17",
            "upvotes": 48,
            "upvote_ratio": 0.89,
            "id": "lb16du",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lb16du/i_mostly_blew_off_my_cs_degree_but_i_have_a_job/",
            "comment_count": 23,
            "text": "So when I was in college, I didn't manage my time very well and I struggled a lot. I was a consistent C student, the minimum grade to stay in the program. I scraped by with C's for fundamentals, and instead of taking challenging electives like computer networking, electrical engineering, and operating systems, i took my schools \"cop out\" electives to meet my requirements. I'm working my first job and I'm doing perfectly fine. Lately in my free time I've been less interested in gaming and more interested in computer stuff and learning. How much value would i get in my career out of revisiting my CS fundamentals and studying them a bit on my own, and trying some of those electives in skipped on my own? \n\nBefore I decide to do that stuff, I want to known if it would be purely for fun or if I would get some (how much?) Career value out of this? I regret the way I performed in undergraduate and feel a bit inferior."
        },
        {
            "title": "What are some jobs for a cs engineer other than web/app/software development?",
            "flair": null,
            "date_created": "02-20-2021 18:44:37",
            "upvotes": 9,
            "upvote_ratio": 0.91,
            "id": "lo9pun",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lo9pun/what_are_some_jobs_for_a_cs_engineer_other_than/",
            "comment_count": 11,
            "text": "I am in my 3rd year of my engineering course and I have only one year left.For the last couple of months,I studied node,django,flutter to develop my skills but  did not enjoy working with any of them.I am currently doing some coding challenges in leetcode and I am enjoying that more than being a developer. Which are the best career I should look for if I am more keen towards maths and algorithms and less with developing websites and all?"
        },
        {
            "title": "Anyone here just end up never getting a job in this field with a CS degree at all?",
            "flair": null,
            "date_created": "02-12-2021 09:13:22",
            "upvotes": 10,
            "upvote_ratio": 0.82,
            "id": "li57sn",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/li57sn/anyone_here_just_end_up_never_getting_a_job_in/",
            "comment_count": 23,
            "text": "I know some people mentioned that it even took a full year post grad to get a job, but is there anyone that even after a year plus post graduation didn't get a job and just ended up working in a different field? My biggest fear is that I'll end up never getting a job in the field after graduating especially after seeing people in this sub that are way more qualified than me not getting any offers back. At what point does someone move on to something else?"
        },
        {
            "title": "How are you applying to 300+ jobs?",
            "flair": null,
            "date_created": "11-30-2020 19:47:36",
            "upvotes": 753,
            "upvote_ratio": 0.96,
            "id": "k3zjav",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/k3zjav/how_are_you_applying_to_300_jobs/",
            "comment_count": 262,
            "text": "I'm a senior at a top 15? school?  idk pretty good school though, and I've been applying to new grad positions since end of august. I've been seeing posts of people saying they've applied anywhere from 300-500 positions and i'm just trying to figure out where you're finding all these applications. I've applied to basically every single one of the apps in the Pitt/CSC New Grad Github sheet and a good amount of jobs outside of that. But I'm at the point where I just don't know where else to apply. Every app on Indeed / Handshake etc. are all either places i've already applied to or are apps that require 2-3+ years experience and definitely not for new grads. help ?"
        },
        {
            "title": "My first dev job will be with Salesforce, how worried should I be?",
            "flair": "New Grad",
            "date_created": "02-18-2021 23:21:43",
            "upvotes": 5,
            "upvote_ratio": 0.78,
            "id": "lmw7nt",
            "edited": "02-18-2021 16:59:58",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lmw7nt/my_first_dev_job_will_be_with_salesforce_how/",
            "comment_count": 23,
            "text": "Hey my friends,\n\nI'm a bootcamp grad and I've been applying to jobs for about two months now and oh boy is it hard on my mental health. I've made it to the final round of a bunch of interviews only to be ghosted, and Salesforce is the first (and only) offer I got. It's 65k / yr (I live in NYC so I know that's pretty low but I'm not complaining).\n\nWhat I'm really worried about it picking up bad habits and learning a crap ton of proprietary software that's not gonna translate to a different non-SF frontend developer role (Apex and all the other SF specific software they use). There also doesn't seem to be a lot of mentorship which is something I really value.\n\nAny advice is appreciated, I almost certainly will have to take the job because it's a pandemic and my situation isn't great (also, again, my mental health); I'm planning on sticking around for \\~6 months and then looking for another frontend role.\n\nEDIT: Yep the job is with Salesforce, not just a company that uses the tech."
        },
        {
            "title": "What are some non programming/tech books you’ve read that help with your job?",
            "flair": null,
            "date_created": "12-28-2020 02:42:32",
            "upvotes": 331,
            "upvote_ratio": 0.98,
            "id": "klebiy",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/klebiy/what_are_some_non_programmingtech_books_youve/",
            "comment_count": 80,
            "text": "I’m thinking interesting Biographies, books that help you optimize your day to day or even just be a better coworker"
        },
        {
            "title": "Critique my job hunting approach please",
            "flair": "New Grad",
            "date_created": "02-12-2021 15:47:10",
            "upvotes": 13,
            "upvote_ratio": 0.88,
            "id": "liacj8",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/liacj8/critique_my_job_hunting_approach_please/",
            "comment_count": 19,
            "text": "I have a CS degree and I've worked in a non technical field for the past 2.5 years.  I have no professional coding experience (not even internships).  I have various personal projects listed on my resume to bolster my case for being qualified.  I want to move into a SWE job.\n\nMy job hunting approach has been a mix of blind applications and reaching out to alumni from my college for referrals.  So far I've gotten two interviews out of 50 applications, but none have come from referrals.  I've gotten around 6 referrals.\n\nWhat could I do better and at what point should I call it quits?  I think after 300 apps with at least 30 coming from referrals, I should just go do a bootcamp or get my MS in CompSci.  But i would really want to get a job instead, any advice appreciated."
        },
        {
            "title": "I feel like I suck at my job",
            "flair": null,
            "date_created": "02-05-2021 12:50:34",
            "upvotes": 12,
            "upvote_ratio": 0.94,
            "id": "ld3xif",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ld3xif/i_feel_like_i_suck_at_my_job/",
            "comment_count": 31,
            "text": "Joined a company 2 months back.  I was hired solely from my experience as a web developer (Laravel and Vue Js ).  I was tasked to build a trading bot. Initially I thought it was going to be good experience but I never thought I would have hated doing this\n\nHowever,  I find it really boring and I find it extremely difficult to understand the concepts of trading bot especially things like how to enter or exit order , backtesting etc .  Basically I don't quite understand how does a trading bot work. I have watched tutorials after tutorials and I even learned python to learn this up. But good Lord, the world of data science and algorithm trading seems to be so overwhelming and I am not prepared for this. I have managed to code up a trading strategy in pine script but I struggle to convert this strategy to  a bot. "
        },
        {
            "title": "Should I request to push my start date back? First job as a newly graduate",
            "flair": "New Grad",
            "date_created": "02-16-2021 20:13:23",
            "upvotes": 9,
            "upvote_ratio": 0.85,
            "id": "ll8iql",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ll8iql/should_i_request_to_push_my_start_date_back_first/",
            "comment_count": 15,
            "text": "Hello so I graduate from uni in May, and I got a offer to work as a entry level developer starting middle of June. Great company and I'm really excited, only thing is my family wants to go on a long vacation at the end of July.\n\nThe vacation would be around the days of July 24th to Aug 6th. Would it be bad to ask if my start date could be pushed to after Aug 6th? Or would it be fine to just use a bunch of PTO days during those two weeks?"
        },
        {
            "title": "What charts do you use in your job?",
            "flair": null,
            "date_created": "02-24-2021 10:54:55",
            "upvotes": 4,
            "upvote_ratio": 0.76,
            "id": "lr74c1",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lr74c1/what_charts_do_you_use_in_your_job/",
            "comment_count": 11,
            "text": "Hi,\n\nI am a Computer Science teacher and part of our curriculum is to teach charts like flowcharts, data flow diagrams and Gantt charts.\n\nCan I ask what different charts you use in your CS jobs? What do you use them for? (All of your answers are going to go into a ppt for my students so anything is useful).\n\nThanks."
        },
        {
            "title": "Got conned into a wrong job and don't know what to do to get out of the situation",
            "flair": "New Grad",
            "date_created": "02-22-2021 11:18:07",
            "upvotes": 6,
            "upvote_ratio": 1.0,
            "id": "lpium0",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lpium0/got_conned_into_a_wrong_job_and_dont_know_what_to/",
            "comment_count": 12,
            "text": "So I graduated in the middle of the pandemic and couldn't land a job for 7 months. Finally got a role at a small company in a Illinois suburb. In the interview they made it seem that they already had engineers at this office whom I will be working with, they said the current engg team is small but they plan to hire more people and that they currently have a larger offshore engg team in India. Now I had read some negative reviews about this offshore team and the CTO but I figured I will only deal with them occasionally and will mostly just be working with the team here in the US. \n\nBoy was I wrong, I come to my first day at work (yes they are working from the office every day, during the pandemic) and I find that there's literally just one other woman in the \"engg team\" who joined a couple of months before me and has no prior work experience, I have 2 years of experience and about 1.4 months of experience as a software developer, working in C, C++ and JavaScript Web Dev, current job is a Java Server Faces full stack role, a framework I have no prior experience with. The people in the American office while friendly are all just Sales and Platform Support. I was not excited about this company but decide it would be okay for like a year or so before I get a better job.\n\nThen when I finally had a meeting with the CTO and the Offshore engg team and I lost all hope for this job. It turned out to be a really negative and down right disrespectful and condescending bunch of people. The CTO is a micromanaging maniac who preys on desperate new grads and then puts them through the grinder until they quit within a year, there's only 1 engg on the devops \"team\" (just 2 people, one of which is a new grad like me) who has stayed for 3 years but she is related to the CTO so of course. I am expected to spend 2 hours or more every night to train with a offshore team member and join their daily standup, they expect me to work all day even on weekends and I am berated on every standup about not getting familiar with the framework and their code base fast enough. The CTO insults me and the other woman on my \"team\" about not being as productive as their offshore engineers who have worked at the company for many years and have the benefit of actually working with senior devs in person. According to him someone having a Master's degree should automatically be as good at their specific code base as a senior engineer, even if they have no prior experience. \n\nI have been at this company for less than a month but already I am feeling quite depressed and stuck. I feel I cannot even begin to apply for a new job for at least 5,6 months without it becoming a red flag on my resume, but I don't want to ruin my mental health over the next 6 months working with such people. I feel like I have barely any time left outside of work. They have given me a study project to do to learn the JSF framework but I barely feel any interest towards it, because no matter what I do they keep moving the goal posts and criticize how I code it, even though I am just following the tutorials available online and I have no help here. \n\nI even had to manually setup the work laptop on my own and I am still dealing with the clusterfuck of a codebase that they have, outdated codebase with not even Maven for dependency management, no Git, using SVN for version control, with junior devs having to submit patch files for seniors to verify and check in manually, no Test or Dev environment for devs to test their code changes, the source code has hardcoded paths for so many config files and dependencies that you have to manually figure out and fix from the console errors, have to setup everything locally including the database, also database changes almost every day and requires you to download a SQL dump file shared in a email and run it on your local DB to get the latest changes. I have no idea if the skills I learn here (JSF, PrimeFaces ) will even help me in the future since it seems to be an old and outdated framework compared to Spring.\n\nWhat should I do to get out of this situation as fast as possible. Should I start applying to jobs while keeping this job off my resume or wait for a few months and then add this job to my resume and then start applying. Should I personally contact recruiters/ hiring managers through LinkedIn or stick to blindly applying through job portals. I can dedicate a hour or so every day to LeetCode, but the thing that has led me to failing to crack interviews a lot is DB and Architecture design, as I don't have a lot of experience with those areas and don't know how to prepare for them."
        },
        {
            "title": "What made you leave your last job and what would cause you to leave your current job?",
            "flair": null,
            "date_created": "01-24-2021 03:18:19",
            "upvotes": 35,
            "upvote_ratio": 0.9,
            "id": "l3o8k2",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l3o8k2/what_made_you_leave_your_last_job_and_what_would/",
            "comment_count": 39,
            "text": "I've been with my current company for about a year. Overall, things are pretty decent, but there are also some frustrations. I'm trying to work on these issues, but I think when it stems from upper management or other groups it can be difficult to address. So, I'm thinking about casually exploring the job market once covid is over.\n\nI'm curious to see what causes other people to leave."
        },
        {
            "title": "Losing my eyesight one of my eyes. Are there any jobs that do not require much coding with a mid-range salary?",
            "flair": null,
            "date_created": "02-20-2021 21:10:15",
            "upvotes": 12,
            "upvote_ratio": 0.94,
            "id": "locw4n",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/locw4n/losing_my_eyesight_one_of_my_eyes_are_there_any/",
            "comment_count": 9,
            "text": "Hello, I am facing a personal problem. I am doing coding for my bread and butter. But for some reason, I am losing my eyesight one of my eyes.  So I want to leave coding so that my other eye can be saved. So, I am looking for a job type that is the part iT or software development field but does not include a lot of coding or eye strain.  Can anyone know this type of job? Thank you."
        },
        {
            "title": "I cannot find a job..",
            "flair": "New Grad",
            "date_created": "11-30-2020 05:31:32",
            "upvotes": 314,
            "upvote_ratio": 0.87,
            "id": "k3myxv",
            "edited": "11-30-2020 13:25:13",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/k3myxv/i_cannot_find_a_job/",
            "comment_count": 306,
            "text": "I will graduate soon with a BS in CS. Despite having a 3.8+ GPA and good classes (including graduate ones) and ok projects, I am not getting hired by almost 40-50 companies that I applied to. In fact, I am not getting an interview.\n\nI got hired by a company for internship (software engineering) this summer but it got cancelled thanks to COVID, and then the same company rejected me for full time.\n\nI cannot believe that I will graduate and be unemployed despite knowing people who did a lot poorer than me and still managed to find a good job.\n\nIs anyone here able to give me some advice?\n\n&#x200B;\n\nPS: Thanks for all the replies and help. Sorry if I missed your reply! I didn't mean to sound arrogant of course, what I mean by mentioning others was to say maybe I am doing something wrong which a lot of you helped with. "
        },
        {
            "title": "I might be leaving my full time job for a summer internship and it's giving me anxiety",
            "flair": "Student",
            "date_created": "01-22-2021 22:28:06",
            "upvotes": 30,
            "upvote_ratio": 0.86,
            "id": "l2v0nn",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l2v0nn/i_might_be_leaving_my_full_time_job_for_a_summer/",
            "comment_count": 43,
            "text": "I currently work at a very large utility company that offers good benefits and has decent pay (the most I've ever earned, but I don't think that's saying a lot), but I have a Summer SDE internship lined up with Amazon which lasts 3 months. I'm currently a junior and a CS major, and getting to work for a major tech company like this almost seems like a dream come true. On top of that, this internship will be paying me quite a bit more than my current job does (around 1.5 x my current pay). All of it seems really exciting and gets my blood pumping, but I'm having lots of anxiety about potentially leaving my current full-time job for \"just a 3 month internship.\" I'm not someone who has ever really suffered from anxiety, so I don't even know if I'm properly describing what I'm feeling, but it's something I think about at least once a day, if not every other day, and get stressed over.\n\nThe bigger issues are:\n-I only started this job late last November, and my internship begins in June. I'm afraid I'd be burning a bridge when I leave. My original idea was to ask for time off, which I believe I've accrued enough for a month, but 3 months seems ridiculous, especially as a new employee, and I'm afraid my employer will just tell me to quit or fire me. My idea was that maybe I can say I have an emergency I have to take care of and won't be able to return until the end of August, but that still seems like it would be a stretch for them to be okay with. \n\n-I know there is a possibility of it becoming full time work, and the person in charge of my college STEM program mentioned that one of her friend's students just got offered a full-time position, but I don't know how likely that is. I know I shouldn't be banking on them offering me full-time, but I'm also worried that when the internship is over I won't find another job to keep me afloat. I have money saved up, and I know that with the extra income from this internship I can definitely save up a lot more, but it's still somewhat terrifying.\n\n-My mother, who works in the same field as I currently do, keeps asking me about work and how I like it because she believes that it's \"the right path for me\" despite me disliking this line of work. I know they will be upset when they find out I've left what they see as a \"sure thing\" for this uncertainty. It's driving me crazy to keep acting like I'm so in love with my current job, but if I ever complain about not liking the work or even act too neutral towards it, it leads to hour long arguments where they either tell me to stop dreaming and take what life has given me, or they drill me about how I can't afford to throw it away and that I'm not taking it seriously.\n\n-I'm turning 30 this year and I still live at home with my parents. I planned on moving out two years ago, but the plans fell through, then last year I lost my job around June, so I had no choice but to tough it out and stay even longer. Now I'm once again looking for an apartment because I can't stand living here any more. I don't have a good workspace/work environment, because I don't have a desk or the room for one and my younger brother & dogs are very loud. Plus if I leave my job for this internship, I'm sure I'll either be kicked out or my life at home will be insufferable.\n\nIt feels like things are starting to look good when it comes to a CS future now. I have this internship opportunity, and I just got accepted into a program that Google and like 3 schools in the country (mine being one of them) partnered up on. It's essentially taking a CS data structures class with them and getting college credit for it and meeting up with someone from Google once a week. It's supposed to be a great way to network, and also has an industry emphasis and some interview skills modules. So it really feels like I'd be wasting this opportunity if I don't take it. I'm afraid that this internship is a big chance for me, and I can't say no.\n\nIf I'm being honest, I'm not even sure what type of advice I was looking for out of this thread; maybe I'm just venting. I told myself I'd made up my mind and that I'm gonna stick with my decision to take the internship. I figured that I should be giving my all to what I want for my future career path, rather than not take the opportunity because I felt safe in what I consider to be more of a back up plan. If someone has some good advice, I'd love to hear it. Maybe I really am just childish for wanting this; idk."
        },
        {
            "title": "Dejected and feeling hopeless with job search",
            "flair": "New Grad",
            "date_created": "02-03-2021 00:39:05",
            "upvotes": 12,
            "upvote_ratio": 0.93,
            "id": "lb798q",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lb798q/dejected_and_feeling_hopeless_with_job_search/",
            "comment_count": 32,
            "text": "Some background, I’m a recent graduate from UW Madison with a CS degree, no internship, and pretty bound to looking out of the Milwaukee area for a job. I have been applying for work in the computer science since March of 2020 and it’s getting extremely hard to not lose hope and just give up. I’ve had my resume looked at, did projects and leetcode, but it seems like no matter what I do, I won’t even be given a chance without an internship or any form of work experience in software development. Especially when a lot of these “Entry Level” positions then go on to ask for years and years of experience in which I don’t have, or I end up being locked into recruiter hell, where I think I have a great opportunity set up and they seem excited to hire, just to realize they are just there for my information to “tell me when they find a good fit”. Like I’m daily applying to every software developer/engineer, computer science job I can see. So I’m not sure. \n\nIt’s really hard to really know what to do to help the situation at this point. As I’ve been looking for so long now. I don’t know if any good projects or ways to really stand out, and I kind of just feel like a failure as a graduate and like if I haven’t been hired yet, nothing will change that. \n\nJust posting this both as a vent/rant as I feel like no one I Know personally understands the level of rejection I’m dealing with. And to maybe ask if someone on here has any advice? Thanks."
        },
        {
            "title": "How is Raleigh, NC, in terms of job market, career growth and living conditions?",
            "flair": "New Grad",
            "date_created": "01-22-2021 23:21:29",
            "upvotes": 51,
            "upvote_ratio": 0.86,
            "id": "l2w4tk",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l2w4tk/how_is_raleigh_nc_in_terms_of_job_market_career/",
            "comment_count": 31,
            "text": "I am currently based in Chicago, doing generic data science/engineering stuff fresh out of school. \n\nI am curious about Raleigh, NC as a potential moving destination because I have friends there. I know it's not as promising as Austin but I hear that it's the second fastest growing tech scene in the US.\n\nCan you share your job search and living experience in Raleigh? Is it competitive or easy to find a job in the research triangle area? Is it a diverse place or more like the deep south? How expensive is it compared to Chicago?"
        },
        {
            "title": "Why do you think “front end developer” has the highest job satisfaction on Glassdoor?",
            "flair": null,
            "date_created": "02-18-2021 08:23:00",
            "upvotes": 3,
            "upvote_ratio": 0.64,
            "id": "lmenmu",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lmenmu/why_do_you_think_front_end_developer_has_the/",
            "comment_count": 17,
            "text": "Saw this article ranking careers according to Glassdoor. Apparently front end development leads to highly satisfied people who review their jobs on Glassdoor. \n\nWhy do guys think that’s the case? Not on call as much as other types of devs? More tangible outcomes and literally visible deliverables?\n\nA front end engineer for a video game needs C++. For web, react and JavaScript. \n\nWhat should I learn to apparently have the happiest job on Glassdoor? \nwww.cnbc.com/amp/2020/01/15/the-20-best-jobs-in-america-in-2020-according-to-glassdoor-ranking.html"
        },
        {
            "title": "Are portfolio websites worth making? Do they help with getting a job?",
            "flair": null,
            "date_created": "02-04-2021 07:49:48",
            "upvotes": 24,
            "upvote_ratio": 0.94,
            "id": "lc7v5j",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lc7v5j/are_portfolio_websites_worth_making_do_they_help/",
            "comment_count": 19,
            "text": "Just wondering if I should spend time making one. I would love some insight!"
        },
        {
            "title": "Does a masters make a person too overqualified for entry level jobs or is it an advantage in comparison to someone with just an undergraduate?",
            "flair": "New Grad",
            "date_created": "02-24-2021 11:05:40",
            "upvotes": 5,
            "upvote_ratio": 0.86,
            "id": "lr7axy",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lr7axy/does_a_masters_make_a_person_too_overqualified/",
            "comment_count": 9,
            "text": "Assuming both are recent graduates, for an entry level job, will the person with a Masters be too overqualified? Or will they have an advantage in comparison to the person with undergraduate done only? I have read that both are true, so depends on companies?"
        },
        {
            "title": "What type of companies should I look for if I don't want a stressful job?",
            "flair": null,
            "date_created": "01-20-2021 02:13:41",
            "upvotes": 42,
            "upvote_ratio": 0.96,
            "id": "l0vwwp",
            "edited": "01-20-2021 05:00:07",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l0vwwp/what_type_of_companies_should_i_look_for_if_i/",
            "comment_count": 43,
            "text": "After working for years in embedded software with large domains, I am looking for companies with less stress and honestly an easy day at work. All of my experience is in c++ but am willing to learn other languages. I want a software engineer role. I am usually much happier when the work that I have to do is straightforward and easy to implement. I don't care if it's boring. I don't care if it's repetitive. I get stressed out when I have to find my way in a million lines of code in a complex system or chase people who are experts in certain portion of the code.\n\nIt is important that those companies could sponsor me for a visa. I currently live in europe but want to move to either the us or uk.\n\nWhat type of companies should I look for? You don't have to list names just point me in the direction so my search is much easier.\n\nFrom my research banks could be what I am looking for. Although I am not sure if they work with c++. Would the fortune 500 companies also fit my criteria?\n\n**Edit:** It seems like some people misunderstood me. Let me clarify what I hate about my current job. Companies in my region have been producing systems for decades. Which means there is a large codebase (> million lines of code) and it's usually very complex. Me and colleagues started two years ago and everytime we get a task we need to find  experienced people to explain where to change. Most people lack knowledge which can sometimes lead to debugging hell and weird confusions. I know someone who left cause he couldn't take the stress.\n\n There is no doing overtime and we are not forced to work extra hours. But even with that there is a lot of stress.\n\nWhat I love is changing places where I know the code and don't have to chase people. I like easy software development and enjoy my day knowing what exactly to do. \n\n**tldr: I want easy and relaxed coding with visa sponsorship ( if possible with a good salary that can help me survive in London or new york)**"
        },
        {
            "title": "Would getting a programming job later in life hurt my chances?",
            "flair": null,
            "date_created": "02-21-2021 01:49:13",
            "upvotes": 2,
            "upvote_ratio": 1.0,
            "id": "lois3a",
            "edited": "02-20-2021 19:05:32",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lois3a/would_getting_a_programming_job_later_in_life/",
            "comment_count": 18,
            "text": "To sum things up I went to school for computer science, but during college I started working as a freelance 3D animator to help pay tuition.\n\nI've graduated now, and one of the companies I worked with frequently wants to supply me with regular, well paying animation work for the foreseeable future; nothing insane, but enough where I could live comfortably by on my own. They have always been great to work for and I trust them, so it should be stable and it's work I enjoy doing. It's also a pretty rare opportunity in freelancing, so I feel bad turning it down.\n\nSo I'm curious: if I did the animation gig for a couple of years, would getting my first programming job at say, 28y or so hurt me in any way? I would of course keep programming things in my free-time as that's just who I am, I just want to make sure I'm not screwing myself out of that career path if I decide to take this offer."
        },
        {
            "title": "Anyone ever quit their current job to dedicate more time to finding a new job?",
            "flair": null,
            "date_created": "02-16-2021 22:50:04",
            "upvotes": 3,
            "upvote_ratio": 0.8,
            "id": "llbz4e",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/llbz4e/anyone_ever_quit_their_current_job_to_dedicate/",
            "comment_count": 20,
            "text": "I've officially decided I am very unhappy with my current position. I'd be happy just about anywhere else so I'm sending a significant number of applications out. \n\nI'd like to spend more time leet coding and have a more open schedule for interviews but I think it would be dumb to give up income while searching. \n\nI think I have a pretty strong resume with almost 3 and half years of web dev experience. Most experience in micro services with c# but also a few with Java spring boot. My previous role gave me a good amount of experience with python. My current role deals with a lot of infrastructure problems in AWS. I also just graduated with my masters in data science. Should I apply to New grad jobs at fang? Or would that be misleading?\n\nI've got plenty of savings to last the rest of the year. I also live in a pretty decent tech hub in Denver. \n\nAnyone done this and ended up screwed? Or ended up being a really good decision? Do companies get suspicious when you say you already quit your current job?"
        },
        {
            "title": "How hard is it to get a job in Silicon Valley?",
            "flair": null,
            "date_created": "02-16-2021 06:11:13",
            "upvotes": 4,
            "upvote_ratio": 0.59,
            "id": "lkud5a",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lkud5a/how_hard_is_it_to_get_a_job_in_silicon_valley/",
            "comment_count": 16,
            "text": "Hey folks,\n\nCurrently a senior studying chemistry at a well regarded university. My plan after graduation was originally to attend medical school, but I've been having some doubts recently and am exploring other options. One thing I was considering was going back to school after I graduate to try to pick a master's in computer science. I've taken a couple of comp sci classes during undergrad that I enjoyed and did quite well in. Was wondering if anyone could enlighten me about the difficulty of getting a job in Silicon Valley afterwards (doesn't need to be FAANG or whatever). I see many of my CS friends heading there after graduation, but I think it may be a bit hasty to see that as some sort of expectation. Any advice about how to improve my chances would be appreciated. Thanks for your thoughts.\n\nTL;DR Chemistry student thinking of switching to comp sci. Want to know what I can reasonably expect afterwards."
        },
        {
            "title": "Why are there so many \"entry level\" jobs that require multiple years of experience?",
            "flair": null,
            "date_created": "01-18-2021 06:53:51",
            "upvotes": 62,
            "upvote_ratio": 0.88,
            "id": "kzmid4",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kzmid4/why_are_there_so_many_entry_level_jobs_that/",
            "comment_count": 33,
            "text": "It's so stupid and its a huge waste of time for all of us looking for a job. Why do companies do that? I just saw a job listing titled entry level position and in the description they were asking for 5-7 years of experience. I'm so tired of this."
        },
        {
            "title": "How are Online MSc in CS viewed in job market in comparison to on-campus MSc in CS ?",
            "flair": null,
            "date_created": "02-12-2021 19:27:22",
            "upvotes": 9,
            "upvote_ratio": 1.0,
            "id": "liejkm",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/liejkm/how_are_online_msc_in_cs_viewed_in_job_market_in/",
            "comment_count": 14,
            "text": "Do Online MSc in CS hinder us from getting internships or entry level position jobs ?"
        },
        {
            "title": "I've got my first job! DevOps",
            "flair": "Student",
            "date_created": "02-15-2021 23:05:36",
            "upvotes": 8,
            "upvote_ratio": 0.76,
            "id": "lklu7i",
            "edited": "02-15-2021 15:09:07",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lklu7i/ive_got_my_first_job_devops/",
            "comment_count": 11,
            "text": "Hi folks!\nFinally, after a year of endless search I got my very first job, not only in this field but overall.\nNow I am Cloud DevOps Intern(will transfer to full time after 3 months)\n\nSo lil story about it:\nI study in other country (small city) than I was born (capital), and was trying to find a job there. No one wants to have 0 experience student on full time the and only a few inter positions are open, mostly frontend or smth.\nSo being mildly desperate I decide to look for some stuff \"at home\"\nFirst page, bang\nFirst job posting, bang\nFirst application, bang\nFirst day, bang\nI got a call from recruiter and we had a nice conversation the same day I applied, and a little tech interview with basic questions on the next day.\nAnd I've got an offer! Today way my first work day and I am so excited to join this team :)\n\nHave a nice day everyone and good luck :)\n\n\nUPD: location is maybe not so important, EEU"
        },
        {
            "title": "Low GPA, No Intern/Job Experience After Graduating. It's Been Nearly a Year. What Do I Do?",
            "flair": null,
            "date_created": "02-22-2021 01:41:21",
            "upvotes": 0,
            "upvote_ratio": 0.38,
            "id": "lp8ln8",
            "edited": "02-21-2021 19:32:09",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lp8ln8/low_gpa_no_internjob_experience_after_graduating/",
            "comment_count": 25,
            "text": "Note) Perhaps it is unclear in the following text but no, I have not gone around applying to anything. I honestly thought it'd be a joke to do that with my current status. Should I start with that regardless?\n\nI graduated with a minor in software and as the title states, I graduated with a low GPA (3.0) and have no intern experience, nonetheless a job in the field. It's been nearly a year since I've graduated as well. I am currently working as a freelance translator but I see no future in this career. \n\nWhhere shoukd I start to get a job in this field? I wouldn't know anything about getting into grad school and I've heard my low GPA is already a red flag. I honestly wouldn't want myself as a student if I were professor as well."
        },
        {
            "title": "PSA: be aware of fake job scams",
            "flair": "Meta",
            "date_created": "02-24-2021 22:58:04",
            "upvotes": 30,
            "upvote_ratio": 0.92,
            "id": "lrlw0b",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lrlw0b/psa_be_aware_of_fake_job_scams/",
            "comment_count": 6,
            "text": "I just helped a friend identify that he was being recruited by a scammer. The way it went down was very similar to this article: https://www.howtogeek.com/410387/scam-alert-fake-job-recruiters-tried-to-catfish-us-here%E2%80%99s-what-happened/\n\nBasically they offered him a part time programming job that paid insane amounts of money. There was a fake interview process where they had him answer some behavioral type questions. There was no face to face meetings in person or over zoom. There was no technical interview. As part of the job he was going to get paid a good rate for \"training\" then would get his full rate a few days after that.\n\nThe scam came when he was told that he was going to be sent a company check that he could then use to pay for his company issued macbook and software. Never do this. Thankfully he felt like something was up and started asking people he knew before doing anything else.\n\nHe did send out his address, email and phone number. Hopefully this information won't be too bad...\n\nSome of the red flags to look for:\n1. a non cooperate email address (@gmail, @outlook, etc)\n2. urgency to finish everything quickly (Have you signed it yet?!)\n3. No in person meetings or video calls\n4. English is bad or off\n\nThe article above recommends to report these scams to the FTC: https://reportfraud.ftc.gov/#/\n\nGood luck out there and stay vigilant!"
        },
        {
            "title": "Where can I find a list of agencies that offer contracting jobs?",
            "flair": null,
            "date_created": "02-21-2021 21:27:35",
            "upvotes": 15,
            "upvote_ratio": 0.8,
            "id": "lp37vr",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lp37vr/where_can_i_find_a_list_of_agencies_that_offer/",
            "comment_count": 5,
            "text": "I am a new grad and finding it difficult to land a full-time job, which is why I am trying to broaden my scope and trying to compile a list of agencies that offer contract-to-hire positions. Any pre-existing list or resource would also be useful."
        },
        {
            "title": "Lied about experience got a SWE job at a big tech company for new grad",
            "flair": "New Grad",
            "date_created": "02-20-2021 06:44:24",
            "upvotes": 0,
            "upvote_ratio": 0.31,
            "id": "lnydq5",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lnydq5/lied_about_experience_got_a_swe_job_at_a_big_tech/",
            "comment_count": 23,
            "text": "Hi guys so I wasn’t getting interviews with my regular resume or even hacker ranks so I started to apply with a resume where I faked a lot of experience. Passed all interviews and I got the job, but now I’m worried that if I accept I will get caught in the background check. I already have a job at a smaller tech company less pay that i applied with my real resume. Will companies find out that I lied about my experience on my resume, and then tell the company that I already accepted for."
        },
        {
            "title": "Doom scrolling but with job postings?",
            "flair": null,
            "date_created": "01-12-2021 18:41:35",
            "upvotes": 115,
            "upvote_ratio": 0.93,
            "id": "kvu09d",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kvu09d/doom_scrolling_but_with_job_postings/",
            "comment_count": 32,
            "text": "I honestly don't know if I'm the only one that does this or not, but does anyone else just feel absolutely overwhelmed when looking at job postings? Something akin to doom scrolling on Twitter.\n\nJust looking at the requirements that are on job postings, and sometimes finding a posting that looks promising but then you navigate to it and it's completely ridiculous and makes you feel horribly underqualified. \n\nNow I know the feedback everyone gives is \"Just apply for it even if you aren't qualified!\", but it's incredibly demoralizing to doom scroll through job boards sometimes."
        },
        {
            "title": "I made a database of software remote jobs across Loom, Zapier, Binance & 2750+ remote companies, totally free. Will continue to add new jobs as I discover more.",
            "flair": "Meta",
            "date_created": "12-12-2020 19:03:47",
            "upvotes": 1675,
            "upvote_ratio": 0.98,
            "id": "kbrhxz",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kbrhxz/i_made_a_database_of_software_remote_jobs_across/",
            "comment_count": 50,
            "text": "All jobs are free listings, none are payed to promote.\n\nLink: https://remotists.com/subs/software-engineering-remote-jobs/\n\nI have been working on this since august as i was laid off due to covid. Still continuing to do it with some friends. \n\nI am thinking of adding a sort feature moving ahead. Apart from that, If there is any more feedback, do share. :)\n\nThanks."
        },
        {
            "title": "How helpful is knowing many languages when looking for a job in this field?",
            "flair": "Student",
            "date_created": "02-20-2021 13:19:56",
            "upvotes": 5,
            "upvote_ratio": 0.78,
            "id": "lo4bdx",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lo4bdx/how_helpful_is_knowing_many_languages_when/",
            "comment_count": 9,
            "text": "Hi all!\n\nI'm studying CS, in my first year. Doing pretty well so far. Recently I realized just how involved I am with languages, since before I didn't really pay it much mind and it seemed normal to me.\n\nDue to circumstances in my childhood I can fluently speak Romanian (not great, but good), and English and Dutch at a basically native level. Furthermore I learned French in school for a very long time, which I plan on brushing up again with some studying of my own, and a few months ago I started learning Japanese which I'm still going very strong in, and have formed a routine I haven't broken out of.\n\nSo say I don't slack off and by the time I finish my CS degree I'm more or less fluent in all 5 languages. Would that net me any benefit when it comes to jobs? Right now it's just a fun thought but knowing language learning could help my career, well it'd be another source of motivation to keep it up.\n\nWhat do you guys think? Got any personal anecdotes to share? Cheers!"
        },
        {
            "title": "Applying to jobs without telling current employer",
            "flair": null,
            "date_created": "02-17-2021 21:23:27",
            "upvotes": 3,
            "upvote_ratio": 0.81,
            "id": "lm10xr",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lm10xr/applying_to_jobs_without_telling_current_employer/",
            "comment_count": 13,
            "text": "So I’ve been working at a small startup for about a year and wanted to move on to a larger company so that I can continue to grow my career. I began applying to jobs without notifying my employer as I didn’t see any harm in doing so. The worst that could happen is that I would have a competing offer.\n\nI ended up getting an offer at a company that I really wanted to work at and verbally accepted it. I was told not to say anything to my current employer until after I cleared a background check. The same day that I cleared the background check, I notified my current employer and am staying on through the end of the month.\n\nHowever, my boss was upset with me for applying and accepting an offer behind his back. He also stated that it was normal for employees to be more open in discussions with their employer about this kind of stuff. Is this the case? Am I in the wrong for not talking with my boss about it ahead of time? My impression is more so that it doesn’t make sense to let your employer know you’re looking to move on until you have something else secured? Just wanted some opinions to clarify my own thoughts on it."
        },
        {
            "title": "How realistic is it to work for two freelancing job at the same time as a fresh grad?",
            "flair": null,
            "date_created": "02-14-2021 18:39:26",
            "upvotes": 6,
            "upvote_ratio": 0.72,
            "id": "ljqlj0",
            "edited": "02-14-2021 10:43:24",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/ljqlj0/how_realistic_is_it_to_work_for_two_freelancing/",
            "comment_count": 15,
            "text": "A bit of a stupid question, but... \n\nI currently started my first ever job as a \"Freelance Front End developer\" for a startup company where I'm required to devote at least 6 hours a day but with flexible hours. Shit pay though.\n\nI interviewed for another \"freelance developer\" for a big non-tech company where I need to devote 8 hours a day and with flexible hours. Great salary however.\n\nMy question is, if I accept both offers as a fresh grad with not much experience, how realistic is it to shit code 14 hours a day? Should I go for it or it's overkill?"
        },
        {
            "title": "What kind of equipment did you get for your job?",
            "flair": null,
            "date_created": "02-23-2021 01:02:18",
            "upvotes": 0,
            "upvote_ratio": 0.33,
            "id": "lq1a33",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lq1a33/what_kind_of_equipment_did_you_get_for_your_job/",
            "comment_count": 18,
            "text": "Pretty self explanatory. What equipment did you receive when onboarding? I've seen mostly macs and windows laptops. I was wondering how this works when you need both? \n\nAlso, did anything change with WFH?"
        },
        {
            "title": "Am I overreacting? Should I change my job?",
            "flair": null,
            "date_created": "01-13-2021 15:48:56",
            "upvotes": 31,
            "upvote_ratio": 0.86,
            "id": "kwfs31",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kwfs31/am_i_overreacting_should_i_change_my_job/",
            "comment_count": 57,
            "text": "I got my masters in computer science (with distinction, yay) at the end of 2018, took a job at a small company that I quit after about 6 months because the projects were not the right fit for me. I've been with my current employer for a little more than 1.5 years. All of that time spent in one rather big project.\n\nSince there has been a shortage of developers at the company and recruiting has proven difficult, I've had the opportunity to take on quite a lot for someone with so little experience (leader of a small 3-person team last year, later handling epics with an estimated time of 10-50 days all by myself). Now, I don't think that that alone should justify a promotion or raise, but here is my problem:\n\nI got a very good performance review at the end of last year (exceeded nearly every expectation for my current position, some by a lot), but I won't get a promotion. Meanwhile, the two other colleagues that were in junior positions at the beginning of last year have now been promoted, leaving me as the only junior in a team of about 15-20 people, all of them in senior positions. To make matters worse, the company just hired a guy with a background in mathmatics and 1 (!) year of experience at another company followed by 1 year of paternity leave as a senior developer. I've also spoken to one of the new seniors, and he makes 30% more than me. \n\nI don't feel like my work for the company is appreciated at all. I try to focus on the positives (nice colleagues, interesting workload, home office), but I don't enjoy working anymore. I have zero motivation, can think about nothing else at times and have trouble relaxing or even sleeping. I'm just so fucking angry it makes my stomach hurt. My girlfriend has told me she thinks I should see a doctor because of how irritable and depressed I've become.\n\nI think it's time to quit and find something else. Somewhere where I fell like my work is appreciated. Am I overreacting? Should I quit? I don't want it to look like I'm job hopping after staying for only 6 months in my first job and now staying only 2 years in my second."
        },
        {
            "title": "Laid off about 6 months ago, after only having about 1.5 years of experience. Now can't get hired for a job. Feel like I have fallen through a crack in this industry and don't know how to fix this?",
            "flair": null,
            "date_created": "01-01-2021 20:36:42",
            "upvotes": 82,
            "upvote_ratio": 0.89,
            "id": "kof962",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kof962/laid_off_about_6_months_ago_after_only_having/",
            "comment_count": 75,
            "text": "So, basically, I graduated with a CS degree and worked as a developer for about 1.5 years. Before this, I worked in another industry for about 5 years (worked their while paying for my degree). Due to working full time, I couldn't get internship experience because I had to pay for housing and other things with my job.\n\nAfter graduating, I got hired as a full stack developer. Worked there for about a 1.5 years and got let go mid summer 2020. I took a few months off due to some personal things I wanted to take care of, also got a couple certificates that I thought could help get a job. Also, worked on a major project as well.\n\nSince then, I haven't been able to get a job though since I have recently started reapplying (started again in early October/November). I have had my resume looked over by people in the industry and they say it looks fine, so it is not an issue with my resume.\n\nI am studying leetcode and working on projects, so I have that covered. Also, 1.5 years of full stack development experience should count for something I would think.\n\nBut, it is extremely hard to even get an interview. Again, YES, I have had my resume looked over...it is not that.\n\nI feel like I am just in this odd position right now. I am no longer considered a \"new grad\", so I no longer qualify for those \"new grad\" jobs (yes, the ads specifically say they only want people who graduate between a certain period to apply for those jobs and auto reject if you don't meet that criteria). Yes, I have even tried anyway and got auto rejected as I predicted.\n\nBut, I also don't have that magical \"3 years\" experience to be considered a experienced developer, so I get rejected from those due to not enough experience or match.\n\nWTF am I supposed to do, just go homeless at this point? I'm sorry I was the person who got let go because I was newest on the team and they made cuts due to the economy. \n\nI feel like I am in this weird position that this industry seems to not be set up to handle and seems to \"shun\". AKA, I am not a new grad, but I am also not someone with 3 years experience yet. It feel like this industry is just set up to make people in my position just \"go away\" and don't give them a shot at a job.\n\nWhat is someone like me supposed to do to get a job? I'm just at a lose at this point."
        },
        {
            "title": "What is the best programming language to learn to give you the best shot at securing an entry level job after graduation?",
            "flair": "Student",
            "date_created": "02-17-2021 15:05:38",
            "upvotes": 4,
            "upvote_ratio": 0.7,
            "id": "llt1df",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/llt1df/what_is_the_best_programming_language_to_learn_to/",
            "comment_count": 11,
            "text": "Hi, I am a student in my 3rd year of college. I was wondering what where the programming languages and skills that are the most in demand for entry level jobs. I tried searching on the internet but almost all websites say different things. Some say Java, others SQL, some Python and JavaScript.\nI want to know the exact language(s) that'll give a recent grad with little experience the best shot?"
        },
        {
            "title": "What branch of cs should I focus on if I just want a part time remote job?",
            "flair": null,
            "date_created": "02-23-2021 04:14:50",
            "upvotes": 3,
            "upvote_ratio": 0.71,
            "id": "lq5erm",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/lq5erm/what_branch_of_cs_should_i_focus_on_if_i_just/",
            "comment_count": 9,
            "text": "Approximately 20hours/week. I’m still a beginner but I just want a specific path to take to achieve my goal hours. \n\nThanks!"
        },
        {
            "title": "What's the most annoying part of your job?",
            "flair": null,
            "date_created": "01-31-2021 05:28:18",
            "upvotes": 12,
            "upvote_ratio": 0.83,
            "id": "l92a83",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/l92a83/whats_the_most_annoying_part_of_your_job/",
            "comment_count": 29,
            "text": "Something you wish it wasn't part of your day"
        },
        {
            "title": "If you get a developer job, prioritize saving from day one.",
            "flair": "New Grad",
            "date_created": "12-11-2020 20:29:31",
            "upvotes": 182,
            "upvote_ratio": 0.85,
            "id": "kb75iv",
            "edited": "12-11-2020 20:13:28",
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/kb75iv/if_you_get_a_developer_job_prioritize_saving_from/",
            "comment_count": 131,
            "text": "I understand that a software developer job along with professions such as doctors are more recession proof than many other jobs...but I strongly recommend you focus on saving the day you land the software developer job. \n\nDon’t buy the bmw as it depreciates the moment it leaves the dealer..not only that, it’s expensive to maintain. Use that same money to invest in yourself whether it is learning your field to stay relevant or build your diversified stock portfolio. \n\nGet a rent controlled apartment and/or get roommates. Make friends and you’ll eventually find someone who is about to leave a rent controlled apartment. Yes you will be making six figures and can afford better but don’t expect this to be something you can consistently count on. Besides the more you save and invest, the more your money starts working for you. This habit could help you save enough for a down payment on a home in the Bay Area though this will take a long while. \n\nCook more and don’t eat out often. Besides, the $14 sandwich or the $30 steak and asparagus plus tip isn’t as great as it sounds. You could make that at home for half the price. \n\nYou can still have fun without spending a lot of money. The Bay Area has so much beautiful nature to explore. Take a drive and go kayaking or go explore the redwoods. You can also go and play sports and make new friends. You can host get togethers(once this pandemic is done obviously) and play board games and buy alcohol from your local grocery store. You don’t need to party at dna lounge or temple night club or some swanky nightlife spot and spend $70 to order a round of shots for you and your buddies to have fun. \n\nI realize this sounds boring but I’ve seen way too many 22 year olds blow their developer salaries on nice cars, fancy gadgets, living in a swanky apartment, and partying a lot with high end alcohol. It’s fun in your 20s but don’t assume this income and job will be permanent. I’ve seen so many smart people lose good paying jobs in tech as they get older and they didn’t have much to fall back on because they had a ball when they were younger. They eventually had to leave the Bay Area as they could no longer afford the Bay Area. Don’t think you’re immune because you’re currently knowledgeable about the in demand area of tech."
        },
        {
            "title": "feeling worthless after a job app coding test",
            "flair": "New Grad",
            "date_created": "02-07-2021 01:05:13",
            "upvotes": 5,
            "upvote_ratio": 0.86,
            "id": "le81j8",
            "edited": false,
            "is_locked": false,
            "nsfw": false,
            "is_spoiler": false,
            "stickied": false,
            "url": "https://www.reddit.com/r/cscareerquestions/comments/le81j8/feeling_worthless_after_a_job_app_coding_test/",
            "comment_count": 20,
            "text": "(US here) i graduated in may 2020, so i knew it was going to be tough to find a job but i didn’t expect it to be so tough just to get past the first stage of them looking at my resume and immediately throwing it away. i’ve had 4 employers contact me after applying since may and i’ve applied to nearly 100 positions (i had a job for about 4 months but they went out of business in october, and i never felt like i really did anything other than talk to my boss and put bugs for his software into Jira).\n\ni graduated from a small private liberal arts school in the midwest with a ba in cs and a ba in engineering physics. throughout my college career i always felt like i wasn’t ever doing anything, while my friends that went to big 10 schools were always doing cool stuff in their classes and building their resume/portfolio. all i learned was Java and never did much. i did do a senior project but it became very limited in scope due to covid. \n\nfast forward to now. i just got done doing an online coding test for a large company. the test was in Go which i had not known any of until a few days ago when i started to learn it specifically for this test. then the one main question for it was about concurrency and making a worker pool and i just had no idea and i got a 17% on the test.\n\ni just don’t know what my next step COULD be. i’m willing to move anywhere in the country for any opportunity. i’m just feeling very defeated yet again after getting 10 rejections this week and then i have this test which i bombed. i guess i’m just looking for guidance. i’m sorry if this is a common post i just needed to get it out there. \n\ni’m not really in a position where i can take something unpaid either. but even if it’s like $20,000 a year that’s fine. just something where i can learn and feel like a competent programmer."
        }
    ]
}