{
    "Post 1": {
        "Title": "Mark Cuban: \"if we're taking something somebody said in their home and we're trying to turn it into something that leads to you being forced to divest property in any way, shape or form, that's not the United States of America. I don't want to be part of that.\"",
        "Flair": null,
        "Date Created": "04-30-2014 01:29:41",
        "Upvotes": 2773,
        "Upvote Ratio": 0.91,
        "ID": "24b935",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.businessinsider.com/mark-cuban-on-donald-sterling-2014-4#!GpRMR",
        "Comment Count": 2035,
        "Text": ""
    },
    "Post 2": {
        "Title": "Indiana Sheriff Justifies New 55,000 Pound Mine Resistant Ambush Protected Military Vehicle By Stating \"The United States of America Has Become A War Zone\"",
        "Flair": null,
        "Date Created": "06-08-2014 21:39:53",
        "Upvotes": 2789,
        "Upvote Ratio": 0.93,
        "ID": "27mq54",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.indystar.com/story/news/2014/06/07/police-officer-safety-surplus-zeal-military-equipment-spurs-debate-mrap-military-vehicle/10170225/",
        "Comment Count": 1133,
        "Text": ""
    },
    "Post 3": {
        "Title": "North Dakota unveils proposal requiring high school students to pass U.S. citizenship test to graduate - \"Every single student in Arizona and across the United States of America should have basic knowledge and understanding of American government..\" \"Civics is just common sense.\"",
        "Flair": null,
        "Date Created": "12-03-2014 20:18:26",
        "Upvotes": 1668,
        "Upvote Ratio": 0.93,
        "ID": "2o6460",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://latino.foxnews.com/latino/news/2014/12/01/north-dakota-may-require-all-high-school-students-to-pass-us-citizenship-civics/",
        "Comment Count": 353,
        "Text": ""
    },
    "Post 4": {
        "Title": "\"Across the country [United States of America], local law enforcement agencies are using an investigative technique called a tower dump to access data on cell phone towers, even of people who are not related to a specific investigation.\"",
        "Flair": null,
        "Date Created": "11-29-2013 23:19:07",
        "Upvotes": 674,
        "Upvote Ratio": 0.91,
        "ID": "1rq95l",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.wltx.com/news/onyourside/article/257093/325/Tower-Dumps-in-SC-Could-Give-Your-Cell-Data-to-Police-",
        "Comment Count": 41,
        "Text": ""
    },
    "Post 5": {
        "Title": "\"[Bill Cosby] will definitely be known as the most prolific serial rapist in the United States of America...\"",
        "Flair": null,
        "Date Created": "07-08-2015 10:10:46",
        "Upvotes": 6,
        "Upvote Ratio": 0.59,
        "ID": "3cisgm",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.cnn.com/videos/tv/2015/07/07/cosby-rape-accuser-patti-masten-sot-ac.cnn",
        "Comment Count": 17,
        "Text": ""
    },
    "Post 6": {
        "Title": "Congratulations, people of the USA.  It is official.  You now live in a full fledged police state.  You bought it.  It owns you.  You and your family may now be searched ANY TIME, ANY PLACE, NO REASON NEEDED, NO EXPLANATION OFFERED.  The Constitution of The United States of America has EXPIRED.",
        "Flair": null,
        "Date Created": "02-25-2011 13:13:42",
        "Upvotes": 23,
        "Upvote Ratio": 0.59,
        "ID": "fsgox",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.youtube.com/watch?v=V1B3AubsTBo",
        "Comment Count": 51,
        "Text": ""
    },
    "Post 7": {
        "Title": "The ACLU has called her “the most gagged person in the history of the United States of America.”",
        "Flair": null,
        "Date Created": "09-23-2009 06:13:02",
        "Upvotes": 108,
        "Upvote Ratio": 0.85,
        "ID": "9n5k2",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://amconmag.com/article/2009/nov/01/00006/",
        "Comment Count": 25,
        "Text": ""
    },
    "Post 8": {
        "Title": "46,609,072 People [in the United States of America] on Food Stamps in 2012; Record 47,791,996 in December: \"Nearly a quarter of the people living in Washington, D.C. are on the program.\"",
        "Flair": null,
        "Date Created": "03-11-2013 20:48:01",
        "Upvotes": 52,
        "Upvote Ratio": 0.85,
        "ID": "1a38u5",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.weeklystandard.com/blogs/46609072-people-food-stamps-2012_706745.html",
        "Comment Count": 14,
        "Text": ""
    },
    "Post 9": {
        "Title": "American writes to the Queen asking her to take back control of the US because Presidential candidates 'aren’t up to par' | 'I beg of you, make the United States of America a colony of the United Kingdom,' the letter said",
        "Flair": null,
        "Date Created": "10-17-2015 19:07:23",
        "Upvotes": 0,
        "Upvote Ratio": 0.41,
        "ID": "3p49eh",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.independent.co.uk/news/people/american-writes-to-the-queen-asking-her-to-take-back-control-of-the-us-because-presidential-a6697661.html",
        "Comment Count": 21,
        "Text": ""
    },
    "Post 10": {
        "Title": "Black Panther Chairman Declares “The Hour of War Is At Hand” - \"Your enemy in Afghanistan, your enemy in Iran, your enemy that you are bombing in Libya today – those are not our enemies. Our enemies are right here in the United States of America.\"",
        "Flair": null,
        "Date Created": "10-03-2011 04:57:33",
        "Upvotes": 57,
        "Upvote Ratio": 0.72,
        "ID": "kyutv",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.shtfplan.com/headline-news/american-powder-keg-black-panther-chairman-declares-the-hour-of-war-is-at-hand_09172011",
        "Comment Count": 9,
        "Text": ""
    },
    "Post 11": {
        "Title": "Man takes an oath to Protect, Defend and Preserve The Constitution of The United States of America, then uses the power of the office to invalidate it.  People quietly accept Change.",
        "Flair": null,
        "Date Created": "03-09-2011 00:36:49",
        "Upvotes": 36,
        "Upvote Ratio": 0.65,
        "ID": "g00kt",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://news.antiwar.com/2011/03/07/obama-approves-indefinite-detention-without-trial/",
        "Comment Count": 14,
        "Text": ""
    },
    "Post 12": {
        "Title": "A global view of America's relationship with capital punishment | China. Iran. Saudi Arabia. Iraq. The United States of America. What you just read is, according to Amnesty International, a list of the countries that executed the largest numbers of prisoners in 2014.",
        "Flair": null,
        "Date Created": "07-16-2015 20:04:03",
        "Upvotes": 0,
        "Upvote Ratio": 0.46,
        "ID": "3dindb",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.minnpost.com/foreign-concept/2015/07/global-view-americas-relationship-capital-punishment",
        "Comment Count": 2,
        "Text": ""
    },
    "Post 13": {
        "Title": "Obama and White House turn Boston Memorial for bombing victims into a Christians only religious event, barring non-Christians from participation, violating the spirit and rights protected under The Constitution of The United States of America.",
        "Flair": null,
        "Date Created": "04-20-2013 01:58:54",
        "Upvotes": 0,
        "Upvote Ratio": 0.43,
        "ID": "1cpbga",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.rawstory.com/rs/2013/04/18/harvard-atheists-shocked-at-exclusion-from-boston-bombing-memorial-service/",
        "Comment Count": 2,
        "Text": ""
    },
    "Post 14": {
        "Title": "\n\"Fiscal Woes Boomerang for Brown in California\": “The fact is, California has been living beyond its means,” Gov. Jerry Brown said. “The United States of America and its federal government has been living beyond its means. This is a day of reckoning, and we have to take the medicine.”",
        "Flair": null,
        "Date Created": "05-15-2012 18:42:49",
        "Upvotes": 6,
        "Upvote Ratio": 0.76,
        "ID": "to93x",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.nytimes.com/2012/05/15/us/brown-proposes-8-3-billion-in-cuts-for-california.html?_r=1&ref=us",
        "Comment Count": 1,
        "Text": ""
    },
    "Post 15": {
        "Title": "Want to hear The President of The United States Of America give a speech here in The United States and make absolutely no mention of The People of The United States of America, their welfare, their health, their future, their sacrifices, their needs, their hopes or their concerns?",
        "Flair": null,
        "Date Created": "05-23-2011 09:21:45",
        "Upvotes": 0,
        "Upvote Ratio": 0.27,
        "ID": "hhtgp",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.youtube.com/watch?v=GQ8wHAPGzTQ",
        "Comment Count": 3,
        "Text": ""
    },
    "Post 16": {
        "Title": "International Women's Day 2014 event in St.Paul, MN, United States of America",
        "Flair": null,
        "Date Created": "03-08-2014 04:57:31",
        "Upvotes": 0,
        "Upvote Ratio": 0.27,
        "ID": "1zuyms",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.internationalwomensday.com/esearch.asp",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 17": {
        "Title": "“There is not a liberal America and a conservative America, there is the United States of America. There is not a black America and a white America, and Latino America, and Asian America, there’s the United States of America” — spent the past 39 months dividing America, by class, by race, by sex.",
        "Flair": null,
        "Date Created": "04-17-2012 21:09:25",
        "Upvotes": 0,
        "Upvote Ratio": 0.4,
        "ID": "segdj",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.washingtontimes.com/news/2012/apr/15/curl-obama-at-home-in-dcs-fetid-swamp/?page=all",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 18": {
        "Title": "Comprehensive timeline: Malaysia Airlines Flight 370 PART 4",
        "Flair": null,
        "Date Created": "03-10-2014 21:26:14",
        "Upvotes": 1278,
        "Upvote Ratio": 0.92,
        "ID": "20288q",
        "Edited?": "03-11-2014 13:36:54",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/20288q/comprehensive_timeline_malaysia_airlines_flight/",
        "Comment Count": 2517,
        "Text": "Continued from  **[here](http://redd.it/200owp)**. Once again, thanks for the support. Happy to do this! - MrGandW\n\n**Out of room - Part 5 is [HERE!](http://redd.it/205k0i)**\n\nThere seems to be a crowdsourced map hunt for the flight going on [Tomnod.](http://www.tomnod.com/nod/challenge/malaysiaairsar2014)\n\n[CURRENT SEARCH AREA](http://news.bbcimg.co.uk/media/images/73498000/jpg/_73498637_china_malaysia_plane4_624.jpg) - BBC\n\nMYT is GMT/UTC + 8.\n\nKeep in mind that there are lots of stories going around right now, and the updates you see here are posted only after I've verified them with reputable news sources. For example, stories about phones ringing are because of the phones going to voicemail or call forwarding - they are not actually the passengers' phones themselves ringing. To my knowledge, none of the passengers' phones have been reported as active or responsive.\n\n**UPDATE 5:21 PM UTC**: White House Press Secretary says NTSB, FAA officials have arrived in Malaysia; still not enough information to know cause of plane's disappearance.\n\n**UPDATE 4:06 PM UTC**: China to adjust search for missing Malaysia Airlines flight over expanded range and involve more ships in rescue work, state news agency says. [Source](https://twitter.com/XHNews)\n\n**THIRTEENTH MEDIA STATEMENT, 11:30 PM MYT/3:30 PM UTC**: In response to [these allegations:](http://aca.ninemsn.com.au/article/8812646/woman-raises-questions-about-cockpit-behaviour)\n\n>Malaysia Airlines has become aware of the allegations being made against First Officer, Fariq Ab Hamid which we take very seriously. We are shocked by these allegations.\n\n>We have not been able to confirm the validity of the pictures and videos of the alleged incident. As you are aware, we are in the midst of a crisis, and we do not want our attention to be diverted.\n\n>We also urge the media and general public to respect the privacy of the families of our colleagues and passengers. It has been a difficult time for them.\n\n>The welfare of both the crew and passenger’s families remain our focus. At the same time, the security and safety of our passengers is of the utmost importance to us.\n\n**UPDATE 1:03 PM UTC**: Relatives of Chinese passengers on board missing the flight have refused to accept money from Malaysia Airlines as distrust and frustration at the carrier mounted, AFP reports.\nThe airline said it had offered “financial assistance” of 31,000 yuan (£3,040) to the family of each missing traveller.\nBut a relative of one of the passengers, from east China’s Shandong province, told AFP: “We’re not really interested in the money.” \n\n**UPDATE 10:35 AM UTC**: Interpol has revealed the names of two Iranians who boarded flight MH370 on the stolen passports.Interpol’s chief Ronald Noble named one as Pouri Nour Mohammadi who was born on 30 April 1995. The other was Delavar Syed Mohammad Reza born 21 September 1984.\nHe later added that he was inclined to thing the disappearance of the plane was not a terrorist incident. [The Guardian](http://www.theguardian.com/world/blog/2014/mar/11/malaysia-airlines-mh370-search-refocused-on-malacca-straits-live-updates#block-531ee41ce4b025518d900a60)\n\n**UPDATE 10:24 AM UTC**: Malaysia's military believes it tracked missing plane on radar to Strait of Malacca, military source says. Reuters.\n\n**TWELFTH MEDIA STATEMENT, 5:29 PM MYT/9:29 AM UTC**:\n\n> This statement is in reference to the many queries on the alleged five (5) passengers who checked-in but did not board MH370 on 8 March 2014 from Kuala Lumpur to Beijing despite having valid tickets to travel.\n\n> Malaysia Airlines wishes to clarify that there were four (4) passengers who had valid booking to travel on flight MH370, 8 March 2014, but did not show up to check-in for the flight.\n\n> As such, the issue of off-loading unaccompanied baggage did not arise, as the said four passengers did not check in for the flight. Hence, the above claim is untrue.\n\n**03:00 pm MYT / 07:00 am GMT - PRESS CONFERENCE**\n\n* No confirmation of any findings of debris\n* Passenger using stolen Austrian passport has been identified as 19 year old Iranian, Pouria Nour Mohammad Mehdad. He's a asylum seeker heading to Frankfurt to see his mother. It's \"not likely\" they were involved with terrorist organisation.\n* Investigation is ongoing for the passenger using stolen Italian passport. CCTV image.\n* Malaysian police confirms there was no passenger that did not board the flight (in contrary of the previous 5 missing passenger, as told by DCA)\n* Malaysian police is investigating a range of theories including hijacking and sabotage, but also any possible psychological problems of those on board.\n\n**UPDATE 5:06 AM UTC**: China is pushing insurers to quickly settle claims in missing Malaysian plane case. [Source](http://www.scmp.com/business/china-business/article/1445691/china-pushing-insurers-quickly-settle-claims-malaysian-plane)\n\n**UPDATE 4:01 AM UTC**: CNN reporters, citing the Hong Kong Civil Aviation Dept., say Cathay Pacific Airways pilots have spotted 'large solid debris.' Previous reports about debris have been confirmed false. [Source](https://twitter.com/vplus/status/443231550524899328)\n\n**ELEVENTH MEDIA STATEMENT, 11:15 AM MYT/3:15 AM UTC**:\n\n>As we enter into Day 4, the aircraft is yet to be found. \n\n>The search and rescue teams have expanded the scope beyond the flight path. The focus now is on the West Peninsular of Malaysia at the Straits of Malacca. The authorities are looking at a possibility of an attempt made by MH370 to turn back to Subang. All angles are being looked at. We are not ruling out any possibilities.\n\n>The last known position of MH370 before it disappeared off the radar was 065515 North (longitude) and 1033443 East (latitude).\n\n>The mission is aided by various countries namely Australia, China, Thailand, Indonesia, Singapore, Vietnam, Philippines and the United States of America. The assets deployed to cover the search and rescue is expensive. In total there are nine aircraft and 24 vessels deployed on this mission.\n\n>Apart from the search in the sea, search on land in between these areas is also conducted.\n\n>The search and rescue teams have analysed debris and oil slick found in the waters. It is confirmed that it does not belong to MH370.\n\n>The B777-200 aircraft that operated MH370 underwent maintenance 10 days before this particular flight on 6 March 2014. The next check is due on 19 June 2014. The maintenance was conducted at the KLIA hangar and there were no issues on the health of the aircraft.\n\n>The aircraft was delivered to Malaysia Airlines in 2002 and have since recorded 53,465.21 hours with a total of 7525 cycles. All Malaysia Airlines aircraft are equipped with continuous data monitoring system called the Aircraft Communications Addressing and Reporting System (ACARS) which transmits data automatically. Nevertheless, there were no distress calls and no information was relayed.\n\n>Malaysia Airlines has a special task force to take care of families. Mercy Malaysia and Tzu Chi and others are also helping Malaysia Airlines by providing special psychological counseling to families and also the MH crew.\n\n>The Chinese government officials in Malaysia are also working closely with Malaysia Airlines. A representative from the embassy is stationed at the Emergency Operations Centre to assist with the emergency management and matters related to families in Kuala Lumpur.\n\n>In Beijing, the Prime Minister’s special envoy to China, Tan Sri Ong Ka Ting is there to assist and coordinate all operational matters with Malaysia Airlines.\n\n> We regret and empathise with the families and we will do whatever we can to ensure that all basic needs, comfort, psychological support are delivered. We are as anxious as the families to know the status of their loved ones.\n\n> To the families of the crew on-board MH370, we share your pain and anxiety. They are of the MAS family and we are deeply affected by this unfortunate incident.\n\n> Malaysia Airlines reiterates that it will continue to be transparent in communicating with the general public via the media on all matters affecting MH370. \n\n**UPDATE 1:10 AM UTC**:  CNN's National Security reporter Jim Sciutto [@jimsciutto](https://twitter.com/jimsciutto) says US officials tell him that the stolen passports used to board MH370 fit the pattern of human trafficking.\n\n**UPDATE 12:53 AM UTC**: : Per [@CNBCWorld](http://twitter.com/CNBCWorld), Malaysian authorities have indefinitely postponed news conferences on the search for flight MH370.\n\n_--UPDATES ABOVE THIS ARE DATED TUESDAY, MARCH 11, 2014--_\n\n**UPDATE 11:29 PM UTC**: Underwater search expert: 'Crucial time is passing' in search for vanished Malaysia Airlines flight. [@CNNbrk](https://twitter.com/cnnbrk)\n\n**UPDATE 9:19 PM UTC**: Report: US intelligence official says Malaysian officials gave US images and biometrics of men believed to have used stolen passports to board missing flight. [CNN](http://www.cnn.com/2014/03/10/world/asia/malaysia-airlines-plane/)\n\n**UPDATE 6:47 PM UTC**: FBI is waiting for thumbprints taken by airport security in Malaysia to compare with US database. @NBCNews\n\n**UPDATE 6:22 PM UTC**: Report: Iranian man booked tickets used by fake passport-carrying passengers, travel agent tells Financial Times. [NBCNews](http://www.nbcnews.com/storyline/missing-jet/iranian-bought-tickets-fake-passport-passengers-report-n49016)\n\n**UPDATE 5:12 PM UTC**: Boeing shares have dropped 2.8% amid safety concerns. [Source](http://www.usatoday.com/story/money/business/2014/03/10/boeing-stock-safety-issues/6252813/)\n\n_--UPDATES ABOVE THIS ARE DATED MONDAY, MARCH 10, 2014.--_"
    },
    "Post 19": {
        "Title": "Comprehensive timeline: Malaysia Airlines Flight 370 PART 3",
        "Flair": null,
        "Date Created": "03-10-2014 07:17:19",
        "Upvotes": 2218,
        "Upvote Ratio": 0.91,
        "ID": "200owp",
        "Edited?": "03-10-2014 22:32:03",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/200owp/comprehensive_timeline_malaysia_airlines_flight/",
        "Comment Count": 1192,
        "Text": "Continued from  **[here](http://redd.it/1zy97c)**. Once again, thanks for the support. Happy to do this! - MrGandW\n\n**I am out of room, please see Part 4 [HERE!](http://redd.it/20288q)**\n\nMYT is GMT/UTC + 8.\n\nKeep in mind that there are lots of stories going around right now, and the updates you see here are posted only after I've verified them with reputable news sources.\n\n**UPDATE 5:12 PM UTC**: Boeing shares have dropped 2.8% amid safety concerns. [Source](http://www.usatoday.com/story/money/business/2014/03/10/boeing-stock-safety-issues/6252813/)\n\n**UPDATE 3:25 PM UTC**: Malaysia sending ships to investigate debris near Hong Kong. [Source](http://www.bloomberg.com/news/2014-03-10/plane-debris-hunters-seek-suspected-aircraft-window-part.html)\n\nUSS Kidd joins USS Pinckney in search efforts of MAS flight. USNavy\n\n**UPDATE 1:37 PM UTC**: China has adjusted the operations of orbiting satellites to help in the search of the missing flight MH370. [Source](https://twitter.com/XHNews/status/443017767047139329)\n\n**UPDATE 12:00 PM UTC**:\n\n* An area of debris is spotted off the coast of Vietname.\n* Ships En Route to Check Debris South of Hong Kong\n* Passengers With Stolen Passport ‘Not Asian-Looking’\n* Looking at Possibility of Passport Theft Syndicate.\n* Search area range doubled to 100 nautical mile radius\n* [Pics used to explain the search area](https://pbs.twimg.com/media/BiXhKYFCAAI19bJ.png:large)\n\n**UPDATE 9:46 AM UTC**: Oil slick sample found about 100 nautical miles off the coast of Kelantan is NOT from MH370. [New Strait Times](https://twitter.com/NST_Online/status/442959557862518784)\n\n**TENTH MEDIA STATEMENT, 05:30 PM MYT/9:30 AM UTC**:\n\n>The purpose of this statement is to update on emergency response activities at Malaysia Airlines.\n\n>On notification of the incident the following steps have been taken:-\n\n>The EOC:-\n\n>1. Activation of the Emergency Operations Center (EOC) in the early morning of 8 March 2014. The EOC is the central command and control facility responsible for carrying out emergency management functions at the strategic level during a disaster.\n\n>2. In addition to the EOC, various departments of Malaysia Airlines are also addressing to all the different needs during this crisis.\n\n>Family Management\n\n>1. Malaysia Airlines is working closely with the government of China to expedite the issuance of passports for the families intending to travel to Malaysia, as well as with the immigration of Malaysia on the issuance of their visas into Malaysia.\n\n>2. Malaysia Airlines is deploying an additional aircraft to bring the families from Beijing to Kuala Lumpur on 11 March 2014.\n\n>3. When the aircraft is located, a Response Coordination Centre (RCC) will be established within the vicinity to support the needs of the families. This has been communicated specifically to the families.\n\n>4. Once the Response Coordination Centre is operational, we will provide transport and accommodation to the designated areas for the family members.\n\n>5. Our oneworld partners have been engaged to help bring family members in other countries aside from China into Kuala Lumpur.\n\n>Search and Rescue\n\n>1. Malaysia Airlines has been actively cooperating with the search and rescue authorities coordinated by the Department of Civil Aviation Malaysia (DCA) and the Ministry of Transport\n\n>2. DCA has confirmed that search and rescue teams from Australia, China, Thailand, Indonesia, Singapore, Vietnam, Philippines, New Zealand and the United States of America have come forward to assist. We are grateful for these efforts.\n\n\n>We also want to address a few common queries from the media.\n\n>We are receiving many queries about how the passengers with the stolen passports purchased their tickets. We are unable to comment on this matter as this is a security issue. We can however confirm that we have given all the flight details to the authorities for further investigation.\n\n>We also confirm that we are making necessary arrangements for MH370 passengers' families from Beijing to travel to Kuala Lumpur. However, flight details of the families’ arrival are highly confidential. This is to protect the privacy and well-being of the families during this difficult time and to respect their space. Our position is not to reveal any information on the flight or movements of the families.\n\n>Malaysia Airlines' primary focus at this point in time is to care for the families of the passengers and crew of MH370. This means providing them with timely information, travel facilities, accommodation, meals, medical and emotional support. The costs for these are all borne by Malaysia Airlines.\n\n>All other Malaysia Airlines’ flights are as per schedule. The safety of our passengers and crew has always been and will continue to be of utmost importance to us.\n\n>The airline continues to work with the authorities and we appreciate the help we are receiving from all local and international parties and agencies during this critical and difficult time.\n\n>Malaysia Airlines reiterates that it will continue to be transparent in communicating with the general public via the media on all matters affecting MH370.\n\n**UPDATE 8:30 AM UTC Press Conference**:\n* Seach and rescue remain the main focus of the authorities.\n* SAR region in straits of malacca is now widened.\n* SAR charts would be release soon to the press.\n* Object resemble inverted lifecraft is reported. Vessels are sent for verification by Vietnamese authorities.\n* No update on the analysis of the oil slicks yet.\n* Chinese delegation from different ministries are in Malaysia to assist in false passport investigaton, search & rescue and dealing with chinese families.\n* Malaysia, US & Chinese are working together on the investigation of the stolen passport.\n* Security measure in Malaysia Airport are not being heightned, as authorotiers are not treating it as security threat yet.\n* Immigration officer will be attending next PC to address airport security matters.\n\n**UPDATE 5:44 AM UTC**: \n>Central Propaganda Department: The media may not independently analyze or comment on the lost Malaysia Airlines flight. Related coverage must strictly accord with authoritative information issued by the Civil Aviation Administration of China and with Xinhua News Agency wire copy. The domestic aviation department can promptly provide related information to passengers’ family members. All media must refrain from interviewing family members without permission, and must not incite any discontented sentiment. All media continue to give increased publicity to the Two Sessions.\nCaution should be exercise as the directive is verified to be authentic, the wording are not.\n\n**PRESS CONFERENCE UPDATES, 12:00 PM MYT/04:00 AM UTC**:\n\n* SAR area covers 50 nautical miles radius and covers possible turnback area\n* Various neighbouring countries are assisting to locate missing aircrafts. 34 aircraft, 40 ships, +100 men, +1000 man hours have been deployed. Countries: Vietnam, China, Singapore, Indonesia, USA, Thailand, Australia and the Phillipines\n* Air search daily 7 a.m. to 7 p.m., ship search continues through the night.\n* Nothing has been found that appears to be debris from the aircraft, let alone the aircraft\n* Various reports of sighting of objects in the media. Vietnamese authorities have reported locating a piece of the aircraft - a door - but that report has not been verified officially by Vietnamese authorities today.\nSAR has spotted two areas where the aircraft's tail might be, but it turns out these sightings turn up not being pieces of the aircraft's tail.\n* Oilslick samples have been sent to labs. Malaysia Air is hoping they can report the slicks some from the missing aircraft.\n* Authorities are investigating the case of two passengers on the aircraft with fraudulent passport. authorities going through all CCTV, all records.\n* There are issues with 5 passengers who did not fly on the aircraft. MAS reiterates baggage from these 5 passengers were removed.\n* _No possibility has been ruled out._\n\n>\"For the aircraft to just go missing just like that, from the radar blip, there are many theories that have been said in media, there are many experts around the world that have contributed knowledge about what could have happened. and as far as we are concerned, we are equally puzzled. the honourable prime minister used the word 'perplexing'. we are equally puzzled. to confirm what happened on this aircraft, we need concrete evidence, pieces of the aircraft, to do forensic study. unfortunately again, we are unable to secure any parts of the aircraft to date.\"\n\n>\"We understand you want answers from us, you want details, we are equally eager as you are to find details and parts of the aircraft and we hope you will be patient and our boys in the rescue control centre on the ships now are trying their best to locate whatever they can find in the areas that we have identified and maybe those beyond that. we are every hour, every minute, every second, looking at every inch of the sea.\"\n\nThanks to /u/kikibroadway for the transcription.\n\n**UPDATE 3:56 AM UTC**: Vietnamese Navy says they cannot find rectangle object thought to be door from missing passenger jet. [Yahoo](http://my.news.yahoo.com/vn-says-cannot-object-thought-025159322.html)\n\n**UPDATE 3:09 AM UTC** (corrected timestamp): Malaysia aviation regulator to send team to Vietnam once parts of missing jet are positively ID'd. [Source](http://stream.wsj.com/story/malaysia-airlines-flight-370/SS-2-475558/SS-2-476464/?mod=wsj_streaming_malaysia-airlines-flight-370)\n\n_--ALL UPDATES ABOVE THIS ARE DATED MONDAY, MARCH 10, 2014. PLANE MISSING 60+ HOURS.--_"
    },
    "Post 20": {
        "Title": "Comprehensive timeline: Malaysia Airlines Flight 370 PART 2",
        "Flair": null,
        "Date Created": "03-09-2014 10:47:01",
        "Upvotes": 2163,
        "Upvote Ratio": 0.92,
        "ID": "1zy97c",
        "Edited?": "03-09-2014 23:19:08",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/1zy97c/comprehensive_timeline_malaysia_airlines_flight/",
        "Comment Count": 1078,
        "Text": "**CONTINUED IN PART 3, [HERE](http://redd.it/200owp)**\n\n**NINTH MEDIA STATEMENT, 10:00 AM MYT/02:00 AM UTC**:\n\n>It has been more than 48 hours since we lost contact with our flight MH370 from Kuala Lumpur to Beijing.\n\n>Despite not being able to establish any positive findings on the whereabouts of the aircraft, Malaysia Airlines has been actively cooperating with the search and rescue authorities coordinated by the Department of Civil Aviation Malaysia (DCA).\n\n>DCA has confirmed that search and rescue teams from Australia, China, Thailand, Indonesia, Singapore, Vietnam, Philippines and the United States of America have come forward to assist. We are grateful for these efforts.\n\n>Malaysia Airlines' primary focus at this point in time is to care for the families. This means providing them with timely information, travel facilities, accommodation, meals, medical and emotional support. The costs for these are all borne by Malaysia Airlines.\n\n>Initial financial assistance has been given out to all families over and above their basic needs.\n\n>At least one caregiver is assigned to each family. These caregivers are well-trained staff and volunteers from Malaysia and other organisations. \n\n>As of now, there are more than 150 \"Go Team\" members consisting of senior management and caregivers at Beijing to attend to these families. In Kuala Lumpur, a different group of caregivers are attending to the families’ needs.\n\n>Families from other nations apart from China have been arriving at Kuala Lumpur since early yesterday. More are expected to arrive today.\n\n>Malaysia Airlines is working closely with the government of China to expedite the issuance of passports for the families as well as with the immigration of Malaysia for their visas into Malaysia.\n\n>When the aircraft is located, a Response Coordination Centre (RCC) will be activated within the vicinity to support the needs of the families. This has been communicated specifically to the families.\n\n>The airline continues to work with the authorities and we appreciate the help we are receiving from all parties and agencies during this critical and difficult time especially the members of the media.\n\n>Malaysia Airlines reiterates that it will continue to be transparent in communicating with the general public via the media in all matters affecting MH370.\n\n>Malaysia Airlines is similarly anxious and we appreciate the patience, support and prayers from everyone.\n\nMalaysia Airlines stock is down 16%.\n\n**UPDATE 12:34 AM UTC**: Analysis of oil slick samples found in hunt for missing jet expected to completed by Monday afternoon. [Source](http://my.news.yahoo.com/samples-oil-slick-sent-chemistry-department-bernama-230415109.html)\n\n_--ALL UPDATES ABOVE THIS POINT ARE DATED MONDAY, MARCH 10, 2014--_\n\n**UPDATE 9:51 PM UTC**: US official: No 'chatter' has been detected suggesting any link between Malaysia Airlines jet and terror, no terror group has claimed responsibility. [NBCNews](http://www.nbcnews.com/storyline/missing-jet/no-terror-group-claims-credit-missing-jet-official-says-n48481)\n\n**UPDATE 7:42 PM UTC**: Thai police official say they are probing a passport racket on the resort island of Phuket related to missing Malaysia Airlines jet. [Source](http://my.news.yahoo.com/thai-police-target-passport-ring-vanished-flight-probe-185147840.html)\n\n**UPDATE 6:50 PM UTC**: France's air accident board offers to help Malaysia and Vietnam with the recovery of missing Malaysia Airlines plane - Reuters\n\n**UPDATE 6:19 PM UTC (note: GMT and UTC times are equivalent)**: Vietnam's air search set to resume Monday at daylight local time after possible plane debris found.\n\n**UPDATE 4:17 PM GMT**: China's Ministry of Public Security sends team to Malaysia to investigate 2 people using stolen passports to travel on missing plane. XHNews\n\n**UPDATE 3:06 PM GMT**: Officials are waiting until daylight in Vietnam to send more aircraft to the site where a navy plane has found fragments thought to belong to the missing Malaysian Airlines aircraft. They are said to be not far off from the plane's flight path.\nVietnam’s Civil Aviation Authority of Vietnam said it was too dark to be certain the object in waters off southern Vietnam was part of the missing plane, Reuters reports.\n\n**UPDATE 1:33 PM GMT**: The floating object spotted 100km south-southwest of Vietnam’s Tho Chu island is not wreckage from flight MH370, US officials have told CNN. The fragments were believed to be a composite inner door and a piece of the tail, Vietnam’s ministry of information and communication said in a posting on its website. They were located some 80 kilometers south-southwest of Tho Chu island.\n\n**UPDATE 12:19 PM GMT**: \n\n* SAR operation is now intensified. Original search area of 20 nautical miles from IGARI waypoint, is now widen to 50 nautical miles. Straits of Malacca (west coast of Malay Penisular) is now part of search area, in response to the possibility of aircraft turn back.\n* 34 aircraft & 40 vessels participate in SAR operation\n* Airborne SAR have Stop at 7 pm MYT till daylight, but sea SAR is still on going.\n* No sign of aircraft.\n* Oil spills are confirmed, but remained unverified of it's association to MH370.\n* Authorities are not ruling out possibilities of hijacking, but SAR took main priority.\n* Investigation is ongoing on the stolen passport used to board the flight.\n* Authorities was not aware of allegation of terrorism linked with recent incident in China. There's no communication from Chinese embassies on this allegation.\n* Aircraft's last communication with ATC was when the Aircraft is being 'transfered' from Malaysia airspace to Vietnam airspace.\n* Malaysia navy are deploying submarine recovery vessels to assist in SAR.\n* Next press meeting will be held at 10 March 2014, 12:00 pm MYT / 04:00 am GMT\n\n**UPDATE 11:29 AM GMT**: Vietnamese SAR vessels are due to reach a suspicious floating object spotted 100km south-southwest of Vietnam’s Tho Chu island within the hour. It was first spotted by Singapore SAR forces. The Guardian.\n\n**UPDATE 10:59 AM GMT**: According to radar records, MH370 did divert from original course before lost contact with ATC, as told by a Malaysia air force officer. Reuters.\n\n**UPDATE 8:43 AM GMT**: Relatives of passengers to be flown to Malaysia. [NBCNews](http://www.nbcnews.com/storyline/missing-jet/relatives-missing-passengers-be-flown-malaysia-n48166)\n\n**UPDATE 8:00 AM GMT**: Malaysia Airlines tells relatives of passengers on missing plane to 'expect the worst' as search reaches 36 hours. [source](http://www.straitstimes.com/breaking-news/se-asia/story/missing-malaysia-airlines-plane-mas-tells-relatives-mh370-passengers-chi#sthash.Og5FZMjk.dpuf) Also, US Navy P-3 and USS Pinckney helicopter are over Malaysia Airlines search site.\n\n**UPDATE 7:38 AM GMT**: It is confirmed with China Southern that 'Maraldi' and 'Kozel' (passengers with stolen passports) bought their tickets together and were both due to fly onto Amsterdam. [source, Malcom Moore](https://twitter.com/MalcolmMoore/status/442557870048309248)\n\n**UPDATE 7:06 AM GMT**: Pentagon did not see any sign of explosion over the suspected missing site of MH370. NYTimes.\n\n**EIGHTH MEDIA STATEMENT, 2:43 PM MYT/6:43 AM GMT**:\n\n >_Statement by MAS GCEO, Ahmad Jauhari Yahya_\n\n>\"Together with all those affected by the MH370 incident, we understand the need to provide regular updates on the progress of the search and rescue operations.  As the hours turn into days, we at Malaysia Airlines are similarly anxious and we appreciate the patience, support and prayers from everyone.  \n\n>We however acknowledge that the most affected group in this incident is the families of those on-board. As such, our primary focus at this point in time is to care for the families. This means providing them with timely information, travel facilities, accommodation, meals and emotional support. Initial financial assistance has been given out to all families. Caregivers are already assigned to each family and they are trained staff and volunteers from Malaysia and Australia.\n\n>Family members of the MH370 passengers from Beijing who wish to travel will be flown in stages to Kuala Lumpur on the available flights.  We are also communicating with the families from other nations to similarly arrange for their travel to Kuala Lumpur. \n\n>In the event flight MH370 is located, a Response Control Centre (RCC) in the area will be activated to support the needs of families.\n\n>The airline continues to work with the authorities and we appreciate the help we are receiving from all parties during this critical and difficult time.\"\n\n**UPDATE 6:16 AM GMT**: Civil aviation chief: 5 passengers did not board missing Malaysia Airlines flight, bags were removed from plane. [source](https://twitter.com/BBCWorld/status/442542755797946368)\n\n**UPDATE 5:20 AM GMT**: Malaysia armed forces chief: 22 aircraft, 40 ships, helicopters, coast guard vessels deployed in investigation of missing Malaysia Airlines. [source](https://twitter.com/STForeignDesk/status/442529443316125696)\n\n**UPDATE 5:16 AM GMT**: Malaysia civil aviation chief: Authorities examine airport footage of 2 passengers with false passports on missing Malaysia Airlines flight. [BBC](https://twitter.com/BBCBreaking)\n\n_--ALL UPDATES ABOVE THIS ARE DATED SUNDAY, MARCH 9, 2014. THE AIRCRAFT HAS BEEN MISSING FOR OVER 30 HOURS.--_"
    },
    "Post 21": {
        "Title": "Skeletons Found Under a Florida Wine Shop May Be Some of America’s First Colonists - The skeletons, found in St. Augustine, Florida, likely date to the first decades of the oldest European settlement in the United States.",
        "Flair": null,
        "Date Created": "03-07-2017 06:18:57",
        "Upvotes": 1933,
        "Upvote Ratio": 0.95,
        "ID": "5xy0yx",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.smithsonianmag.com/smart-news/remains-early-colonists-unearthed-st-augustine-180962385/?utm_source=twitter.com&utm_medium=socialmedia",
        "Comment Count": 70,
        "Text": ""
    },
    "Post 22": {
        "Title": "Clear Channel Outdoor Americas, which has tens of thousands of billboards across the United States, will announce on Monday that it has partnered with several companies, including AT&T, to track people’s travel patterns and behaviors through their mobile phones.",
        "Flair": null,
        "Date Created": "02-29-2016 06:36:59",
        "Upvotes": 1061,
        "Upvote Ratio": 0.91,
        "ID": "4884xv",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.nytimes.com/2016/02/29/business/media/see-that-billboard-it-may-see-you-too.html",
        "Comment Count": 306,
        "Text": ""
    },
    "Post 23": {
        "Title": "TIL: In 1990, the United States Congress designated March 25th, of each year, as National Medal of Honor Day, a day that is dedicated to all Medal of Honor recipients.",
        "Flair": null,
        "Date Created": "03-25-2014 19:40:53",
        "Upvotes": 3,
        "Upvote Ratio": 0.6,
        "ID": "21bugf",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/21bugf/til_in_1990_the_united_states_congress_designated/",
        "Comment Count": 1,
        "Text": "It was on March 25, 1863 when the first Medals of Honor were presented.  Secretary of War, Edwin Stanton presented Medals of Honor (Army) to six members of  ”Andrews Raiders” for their volunteering and participation during an American Civil War raid in April of 1862.\n\nCreated in 1861, the Medal of Honor is the United States of America’s highest military honor.  It is awarded only to US military personnel, by the President of the United States in the name of Congress, for personal acts of valor above and beyond the call of duty.\n\nThere are three versions of the Medal of Honor, one for the Army, one for the Navy and one for the Air Force, with personnel of the Marine Corps and the Coast Guard receiving the Navy version.\n\nSince its creation, there have been 3,468 Medals of Honor awarded to the country’s Soldiers, Sailors, Airmen, Marines and Coast Guardsmen.  Please take some time today to reflect on the selfless action and sacrifice of those that have earned this distinguished award.\n"
    },
    "Post 24": {
        "Title": "Why does approximately one out of every three children in the United States live in a home without a father? Fathers disappear from households across America.",
        "Flair": null,
        "Date Created": "07-02-2013 03:16:24",
        "Upvotes": 58,
        "Upvote Ratio": 0.83,
        "ID": "1hgjyi",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.washingtontimes.com/news/2012/dec/25/fathers-disappear-from-households-across-america/print/",
        "Comment Count": 48,
        "Text": ""
    },
    "Post 25": {
        "Title": "It has long been the stuff of drug-trafficking legend, but federal authorities announced on Saturday that they have helped seize the first known and fully operational submarine built by drug traffickers to smuggle tons of cocaine from South America toward the United States.",
        "Flair": null,
        "Date Created": "07-04-2010 16:02:36",
        "Upvotes": 115,
        "Upvote Ratio": 0.9,
        "ID": "cluoy",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.chron.com/disp/story.mpl/world/7093154.html",
        "Comment Count": 33,
        "Text": ""
    },
    "Post 26": {
        "Title": "Police in Italy and New York broke up a major trans-Atlantic mafia ring on Tuesday, arresting 24 people accused of plotting to move hundreds of millions of dollars in drugs between South America, Italy and the United States",
        "Flair": null,
        "Date Created": "02-11-2014 21:07:24",
        "Upvotes": 47,
        "Upvote Ratio": 0.84,
        "ID": "1xmpqv",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.reuters.com/article/2014/02/11/us-italy-drugs-us-idUSBREA1A19F20140211",
        "Comment Count": 5,
        "Text": ""
    },
    "Post 27": {
        "Title": "'Swedes did not commit crime against America':  Mystery enshrouds the trial against two Swedish citizens charged with a series of terror crimes in a New York court, with no connections established between the alleged crimes and the United States.",
        "Flair": null,
        "Date Created": "12-24-2012 14:25:17",
        "Upvotes": 38,
        "Upvote Ratio": 0.8,
        "ID": "15dcox",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.thelocal.se/45252/20121224/#.UNg7jYvtRMg.reddit",
        "Comment Count": 9,
        "Text": ""
    },
    "Post 28": {
        "Title": "COVID-19 Megathread #5",
        "Flair": null,
        "Date Created": "03-10-2020 17:58:44",
        "Upvotes": 1332,
        "Upvote Ratio": 0.95,
        "ID": "fge7ve",
        "Edited?": "03-13-2020 23:28:02",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/fge7ve/covid19_megathread_5/",
        "Comment Count": 10055,
        "Text": "**This post is updated daily.**\n\nYou can also follow the [Reddit Live thread here.](https://www.reddit.com/live/14d816ty1ylvo/)\n\n&nbsp;\n\nCOVID-19 has now infected more than 144,890 people. There have been 5,401 confirmed deaths and 70,252 confirmed recoveries attributed to the virus.\n\n&nbsp;\n\n**MAJOR UPDATES**\n*See more recent updates further down this post.*\n\nMARCH 13 - President Trump declared a National Emergency. [Watch the announcement here](https://twitter.com/WhiteHouse/status/1238547861358309377), and [read about it here.](https://www.politico.com/news/2020/03/13/coronavirus-emergency-declaration-trump-128530)\n\n&nbsp;\n\n**Recommended Reading:**\n\n[A coronavirus cautionary tale from Italy: Don’t do what we did](https://www.bostonglobe.com/2020/03/13/opinion/coronavirus-cautionary-tale-italy-dont-do-what-we-did/)\n\n&nbsp;\n\n**Recent Updates**\n\n*Note: These are the updates from the last 48-72 hours.*\n\nMARCH 13 -\n\n* It’s a ‘false hope’ coronavirus will disappear in the summer like the flu, WHO says. [Read more here.](https://www.cnbc.com/2020/03/06/its-a-false-hope-coronavirus-will-disappear-in-the-summer-like-the-flu-who-says.html)\n\n* Europe is now the \"epicentre\" of the global coronavirus pandemic, the head of the World Health Organization says. [Read more here.](https://www.bbc.com/news/world-europe-51876784)\n\n* Spain, which has second-highest number of cases in Europe after Italy, joins other countries in declaring emergency. [Read more here.](https://www.aljazeera.com/news/2020/03/spain-declares-state-emergency-coronavirus-200313152453257.html)\n\n* Canada is warning against all international travel and is limiting inbound flights as part of a series of measures to limit the spread of COVID-19. Additionally, the wife of Prime Minister Trudeau has tested positive for coronavirus. [Read more here.](https://www.cbc.ca/news/politics/trudeau-covid-19-1.5496367)\n\n* The Masters, which brings together the world's best golfers in April for the year's first major, has been postponed because of concerns about coronavirus. [Read more here.](https://www.abc.net.au/news/2020-03-14/coronavirus-hits-golf-with-the-masters-postponed-some-later-date/12056232)\n\n* No cruises will be leaving U.S. coasts for a month. President Trump tweeted Friday evening that Carnival, Norwegian, Royal Caribbean and MSC were suspending outbound cruises for 30 days, at his request. [Read more here.](https://www.cbsnews.com/news/the-u-s-cruise-business-is-stopping-for-a-month-due-to-coronavirus-2020-03-13/)\n\n&nbsp;\n\nMARCH 12 - \n\n* The Australian Grand Prix has been called off, throwing the rest of the F1 season into doubt. [Read more here.](https://www.bbc.co.uk/sport/amp/formula1/51849163)\n\n* Disney is closing Disneyland and California Adventure, its theme parks in Anaheim, California, because of the coronavirus outbreak.[Read more here.](https://www.cnn.com/2020/03/12/media/disneyland-close-coronavirus/) Disney World in Florida will also be closed. [Read more here.](https://www.wesh.com/amp/article/disney-world-closing/31453741)\n\n* Canadian Prime Minister Justin Trudeau will self-quarantine “out of an abundance of caution” while his wife Sophie Grégoire undergoes testing for novel coronavirus. [Read more here.](https://thehill.com/policy/international/americas/487245-canadas-trudeau-is-self-quarantining-after-wife-tested-for) Ontario public schools are also closing for 2 weeks. [Read about that here.](https://www.cbc.ca/news/canada/toronto/ontario-government-closing-schools-1.5495736)\n\n* The entire country of Norway is 'shutting down'. [Read more here.](https://theweek.com/speedreads/901770/entire-country-norway-shutting-down)\n\n* All three major US indexes closed more than 9% lower. The Dow Jones industrial average, which closed in a bear market on Wednesday, dropped 10%. That marked its biggest single-day decline since Black Monday in 1987. [Read more here.](https://markets.businessinsider.com/news/stocks/stock-market-news-today-index-reaction-coronavirus-trump-fed-stimulus-2020-3-1028991586) \n\n* The Federal Reserve on Thursday announced it would inject $1.5 trillion into short-term markets to offset the economic impact of the Wuhan coronavirus. [Read more here.](https://www.nationalreview.com/news/federal-reserve-to-inject-1-5-trillion-into-markets-to-offset-economic-impact-of-coronavirus/)\n\n* U.S. states have started to close public schools. Ohio and Maryland are the first to do so. [Read more here.](https://www.usatoday.com/story/news/education/2020/03/12/coronavirus-school-closings-ohio-maryland-washington-seattle-king-closures/5036252002/)\n\n* More sporting events and seasons are being cancelled and suspended. [March Madness](https://www.cnbc.com/2020/03/12/coronavirus-ncaa-conference-tournaments-cancellations.html) has been cancelled, [NHL](https://www.espn.com/nhl/story/_/id/28891430/sources-nhl-suspending-play-immediately-due-virus) has suspended its season, [MLS](https://www.mlssoccer.com/post/2020/03/12/major-league-soccer-suspends-season-30-days-impact-coronavirus) has suspended its season for 30 days, and [MLB](https://twitter.com/MLB/status/1238180549174362117) has suspended spring training and delayed opening day by atleast 2 weeks.\n\n&nbsp;\n\nMARCH 11 -\n\n* The World Health Organization has declared the Coronavirus a global pandemic. [Read more here.](https://www.who.int/dg/speeches/detail/who-director-general-s-opening-remarks-at-the-media-briefing-on-covid-19---11-march-2020)\n\n* A U.S. Senate staffer in Sen. Maria Cantwell's D.C. office has been confirmed to have coronavirus. [See the tweet here.](https://twitter.com/misswilson/status/1237922288915415040)\n\n* The NBA has suspended the rest of its season. [See the tweet here.](https://twitter.com/wojespn/status/1237914166285008896)\n\n* Tom Hanks and Rita Wilson have announced that they have tested positive for COVID-19. [See his tweet here.](https://twitter.com/tomhanks/status/1237909897020207104)\n\n* March Madness will hold games without fans. [Read the announcement here.](https://twitter.com/NCAA/status/1237838583630721027)\n\n* Italy announced that they are expanding their quarantine. All shops will be shuttered except supermarkets, food stores and chemists, and companies must close all their departments that are not essential to production. Services such as hairdressers and beauty parlours will also be closed, along with bars and restaurants that cannot guarantee they can keep a distance of at least one metre between customers. [Read more here.](https://www.abc.net.au/news/2020-03-12/coronavirus-live-updates-italy-closes-stores-pandemic-declared/12048214#Italy)\n\n* Britain, Italy announce multi-billion dollar war chests to fight coronavirus. [Read more here.](https://www.reuters.com/article/us-health-coronavirus/britain-italy-announce-multi-billion-dollar-war-chests-to-fight-coronavirus-idUSKBN20Y1RF) Canada and the US have also announced funding to fight the coronavirus.\n\n* Nationwide school closures in 22 countries have interrupted learning for more than 372 million students from primary to tertiary levels, including 58.6 million in universities and other post-secondary institutions, according to Unesco. The majority are in China. [Read more here.](http://www.rfi.fr/en/international/20200311-unesco-says-one-in-five-students-out-of-school-due-to-coronavirus-covid-19-china-france-italy)\n\n* German Chancellor Angela Merkel has warned that up to 70% of the country's population - some 58 million people - could contract the coronavirus. [Read more here.](https://www.bbc.com/news/world-us-canada-51835856)\n\n* Google parent company Alphabet is recommending that all of its North America employees work from home through April 10 due to coronavirus. [Read more here.](https://edition.cnn.com/2020/03/10/tech/google-work-from-home-coronavirus/)\n\n* Major events are being cancelled all over the United States, including [E3](https://www.gamespot.com/articles/e3-2020-canceled/1100-6474647/?ftag=GSS-05-10aab8e) and [Rodeo Houston.](https://twitter.com/RODEOHOUSTON/status/1237795923088019456?ref_src=twsrc%5Etfw)\n\n* Ukraine's government decided on Wednesday to ban mass gatherings and close schools for three weeks in a bid to prevent the spread of the coronavirus. [Read more here.](https://www.usnews.com/news/world/articles/2020-03-11/ukraine-to-ban-mass-gatherings-close-schools-for-three-weeks)\n\n* Hungary’s government declared a state of emergency to help deal with the coronavirus outbreak, closing university campuses and banning large gatherings. [Read more here.](https://www.bloomberg.com/news/articles/2020-03-11/hungary-declares-state-of-emergency-shuts-universities-on-virus)\n\n* 13 US states so far have declared states of emergency in response to the coronavirus outbreak. [Read more here.](https://www.businessinsider.com/california-washington-state-of-emergency-coronavirus-what-it-means-2020-3)\n\n* President Trump just addressed the nation from the Oval Office. [Watch the address here.](https://youtu.be/I09RkjLcFpU?t=21) During the address, he said all travel from Europe would be suspended for the next 30 days. The new rules will go into effect on Friday at midnight, and the United Kingdom will be exempt. [Read more here.](https://www.bbc.com/news/world-us-canada-51846923) President Trump also announced that:\n\n> * Insurance companies have agreed to waive copays on coronavirus tests and ~~treatments, and to extend coverage to such treatments.~~ [Here is a tweet correcting this statement by the President.](https://twitter.com/owermohle/status/1237922717699014658) - Insurance companies have not agreed to extend coverage for treatment or waive those costs.\n\n> * The tax filing deadline will be extended for some Americans. He did not provide more details.\n\n> * He also called on Congress to provide Americans with “immediate payroll tax relief.”\n\n> * He said he would be soon taking emergency action to provide financial relief for workers who are quarantined or caring for others due to coronavirus. Details were also scarce about the specifics of this.\n\n> * The tax filing extension could provide up to $200 billion of liquidity that the government can make available to impacted businesses in the form of low interest loans. \n\n[Read more here.](https://www.usatoday.com/story/news/politics/2020/03/11/trump-address-nation-over-u-s-response-coronavirus-pandemic/5022464002/) And [read the fact check of this speech here.](https://www.bostonglobe.com/2020/03/12/nation/fact-check-trump-misstates-some-his-virus-actions/)\n\n&nbsp;\n\n\n**CDC Recommendations:**\n\n* People over 60 and those with severe chronic heart, lung, or kidney disease stay at home as much as possible and avoid crowds. [Read more here.](https://www.cdc.gov/coronavirus/2019-ncov/specific-groups/high-risk-complications.html) \n\n* Travelers, particularly those who are older and/or have underlying health issues, should “defer all cruise ship travel worldwide”. The CDC also notes that “cruise ship passengers are at increased risk of person-to-person spread of infectious diseases, including COVID-19\". [Read more here.](https://wwwnc.cdc.gov/travel/page/covid-19-cruise-ship)\n\n&nbsp;\n\n**Tracking COVID-19**\n\n* [Vox is keeping track of COVID-19 infections for each U.S. state here.](https://www.vox.com/2020/3/3/21163020/coronavirus-new-york-washington-california-florida)\n\n* [John Hopkins University has a live tracker/map of the global spread of COVID-19 here.](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6) \n\n* [Today's situation report from the WHO.](https://www.who.int/docs/default-source/coronaviruse/situation-reports/20200313-sitrep-53-covid-19.pdf?sfvrsn=adb3f72_2)\n\n* [The CDC's COVID-19 Situation Summary.](https://www.cdc.gov/coronavirus/2019-nCoV/summary.html)\n\n&nbsp;\n\n**New Countries reporting cases their first cases this week:**\n\n*Note 1: The list starts fresh each Monday.*\n\n*Note 2: This list is pulled from the WHO's daily situation reports (linked above).*\n\n* Bulgaria\n\n* Costa Rica\n\n* Faroe Islands\n\n* French Guiana\n\n* Maldives\n\n* Martinique\n\n* Republic of Moldova\n\n* Bangladesh\n\n* Albania\n\n* Paraguay\n\n* Brunei Darussalam\n\n* Mongolia\n\n* Cyprus\n\n* Guernsey\n\n* Panama\n\n* Bolivia (Plurinational State of)\n\n* Jamaica\n\n* Burkina Faso\n\n* Democratic Republic of the Congo\n\n* French Polynesia\n\n* Turkey\n\n* Honduras \n\n* Côte d’Ivoire\n\n* Jersey\n\n* Réunion\n\n* Saint Vincent and the Grenadines\n\n* Cuba \n\n* Guyana\n\nOver 100 countries have now reported lab-confirmed cases of COVID-19. \n\n&nbsp;\n\n**Reputable Sources for Information:**\n\n* [The CDC's Dedicated Coronavirus Resource,](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n\n* [The WHO's Dedicated Coronavirus Resource,](https://www.who.int/health-topics/coronavirus)\n\n* [The University of Chicago School of Medicine's handy FAQ style resource.](https://www.uchicagomedicine.org/forefront/prevention-and-screening-articles/wuhan-coronavirus)\n\n\n&nbsp;\n\nAnd for those too lazy to click on the University of Chicago Med [resource](https://www.uchicagomedicine.org/forefront/prevention-and-screening-articles/wuhan-coronavirus), here are some of the answers to commonly asked questions:\n\n&nbsp;\n\n**What is a coronavirus? What is a novel coronavirus?**\n\n> A coronavirus is actually the name for a set of illnesses, including the common cold and other respiratory infections. A novel coronavirus means it’s a new virus that originated in animals, but has jumped to humans. This particular 2019 novel coronavirus from Wuhan is called COVID-19 or 2019-nCoV.\n\n&nbsp;\n\n**How does the COVID-19 spread?**\n\n> This virus is really transmissible and can spread easily from person to person even before a person develops symptoms. It’s carried on respiratory droplets when we talk, sneeze, and cough and these can land on surfaces or in someone’s mouth or nose.  When it comes to respiratory droplets, 6 feet is the magic distance. That’s how far these tiny, infected droplets can travel.  Being within 6 feet of someone who is sick can get you or your personal space contaminated with COVID-19.  \n\n> When droplets land on surfaces, we can pick them up with our hands and transfer them to our eyes, mouth, and nose when we touch our faces. This is why hand hygiene is so important.  Respiratory secretions (like snot and sputum) are also infectious so cover your coughs and sneezes.\n\n\n&nbsp;\n\n**What are the symptoms of the virus? Is it deadly?** \n\n> It typically causes flu-like symptoms. Some patients — particularly the elderly and others with other chronic health conditions — develop a severe form of pneumonia.\n\n> Patients develop symptoms like fever, muscle and body aches, cough, and sore throat about 5-6 days after infection. Most people will feel pretty miserable for a week and get better on their own.  Some people won’t get as sick, but it’s still important not to be out and about, so as not to spread the disease.  A minority of patients will get worse instead of better. This usually happens after 5-7 days of illness and these patients will have more shortness of breath and worsening cough.  If this happens, it’s time to contact your doctor again or even go to an emergency room. Be sure to call first so they know you are coming.  \n\n> The numbers of people who have been diagnosed and how many have died are changing daily. As of early March, there have been over 97,000 confirmed cases, with a death toll of about 3,000 (more than 2,900 in mainland China). But these numbers are just estimates; it’s still unclear how many people have actually been infected worldwide. Most of the deaths have been in adults over 60 years old who had other health concerns.\n\n&nbsp;\n\n**Are we all at risk for catching this new coronavirus (2019-nCoV)?**\n\n> Yes. It doesn’t appear anyone is naturally immune to this particular virus and there’s no reason to believe anybody has antibodies that would normally protect them. \n\n> The lack of previous experience with this pathogen is part of the reason why public health officials around the globe are working so hard to contain the spread of this particular coronavirus from Wuhan. When viruses come out like this that are both new (which means the population is highly susceptible) and can easily pass from person to person (a high transmission rate), they can be really dangerous — even if here’s a low percentage of people who die from them. \n\n&nbsp;\n\n**Why do some people with the COVID-19 get sicker than others?**\n\n> It looks like only about 20% of people who contract this novel coronavirus need to be hospitalized. The other 80% get what feels like a bad cold and recover at home. A lot of this has to do with underlying medical conditions. People who are more vulnerable to any kind of infection — because of their age or chronic health conditions — are more at risk for getting really sick from COVID-19. \n\n> That said, some otherwise healthy people do seem to be getting sicker from this infection than we would expect. We don’t understand why that is or what might be different about these patients. If you have COVID-19 and you are getting sicker and sicker instead of better and better, you should contact your doctor or visit an ER. Be sure to call first so they know to expect you.  \n\n&nbsp;\n\n**What kind of medical care do patients with COVID-19 need?**\n\n> About 80% of people who contract this new coronavirus will feel sick, but ultimately be just fine. It’s the 20% of COVID-19 patients who get really, really sick that worry many of us in the infectious diseases field. A lot of these critically ill patients wind up needing to be hospitalized for their pneumonia-like illnesses. They typically require critical care and ventilation — special machines that help them breathe. And some need to stay on ventilators for weeks at a time. It’s this portion of patients that is most concerning. Depending on how many cases develop here in the U.S., providing that level of care for so many people over a number of weeks runs the risk of overwhelming the nation’s health care system pretty quickly. We can help prevent this kind of “surge” in patients by practicing social distancing (see below for more explanation). \n\n&nbsp;\n\n**Should people be more concerned about the seasonal flu or COVID-19?**\n \n> There’s widespread seasonal flu activity going on right now all around the U.S.  But there are steps you can take to protect yourself from influenza. You can get an annual flu shot. You can take medication like Tamiflu that protects you from getting influenza after you’ve been exposed. You can cover your mouth and wash your hands to mitigate the spread. And, like clockwork, this year’s influenza strain is going to die out in the spring because it will have run its course. \n\n> The challenge with COVID-19 is that we probably can’t contain it and we don’t know if we’re really prepared as a country for a massive coronavirus epidemic.  If we are lucky, it will slow down a bit over the summer but the next few months look like they are going to be pretty tough for all of us. We need to be as ready as we can for whatever comes our way and know that we will get through it eventually. \n\n&nbsp;\n\n**How can I protect myself?  Should I wear a facemask?**\n  \n> Take the preventive actions you do for the cold and flu. This includes avoiding close contact with people who are sick; not touching your eyes, nose and mouth; washing your hands thoroughly and frequently; and cleaning and disinfecting objects and surfaces you come in contact with regularly.\n\n> The CDC does not recommend you wear a facemask to protect yourself from getting COVID-19 or other respiratory illnesses. Those who have COVID-19 and/or are showing symptoms should wear a mask to protect others from getting the virus.  Any healthcare worker taking care of someone infected with COVID-19 also should wear a mask.\n\n&nbsp;\n\n**Can I take an antibiotic or vaccinate against the virus?**\n \n> There is no antibiotic (they are designed for bacterial infections, not viral ones) to treat COVID-19.  Scientists are already working on a vaccine, but we don’t expect to have a good vaccine until spring of 2021 at the earliest.  However, ongoing trials in China suggest that there are some existing antiviral drugs that may be helpful for the sickest patients.  In fact, the University of Chicago is part of a multi-institutional team that has mapped a protein of SARS-CoV-2 and found drugs previously in development for SARS could be effective for COVID-19.\n\n> For now, doctors can only treat the symptoms, not the virus itself."
    },
    "Post 29": {
        "Title": "The United States will likely suffer the loss of its triple-A credit rating from another major rating agency by the end of this year due to concerns over the deficit, Bank of America Merrill Lynch forecasts.",
        "Flair": null,
        "Date Created": "10-24-2011 00:01:19",
        "Upvotes": 26,
        "Upvote Ratio": 0.74,
        "ID": "lmaue",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.reuters.com/article/2011/10/23/us-usa-rating-merrill-idUSTRE79M2J120111023",
        "Comment Count": 6,
        "Text": ""
    },
    "Post 30": {
        "Title": "Thousands of immigrant children fleeing poverty and violence in Central America to cross alone into the United States",
        "Flair": null,
        "Date Created": "06-23-2014 01:48:53",
        "Upvotes": 13,
        "Upvote Ratio": 0.7,
        "ID": "28tlwl",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://hosted.ap.org/dynamic/stories/U/US_IMMIGRANT_CHILDREN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2014-06-22-10-06-15",
        "Comment Count": 3,
        "Text": ""
    },
    "Post 31": {
        "Title": "COVID-19 Megathread #4",
        "Flair": null,
        "Date Created": "03-01-2020 19:00:23",
        "Upvotes": 1401,
        "Upvote Ratio": 0.95,
        "ID": "fbvz7n",
        "Edited?": "03-09-2020 12:02:22",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/fbvz7n/covid19_megathread_4/",
        "Comment Count": 10624,
        "Text": "**This post is updated daily.**\n\n&nbsp;\n\nCOVID-19 has now infected more than 111,363 people. There have been 3,892 confirmed deaths and 62,375confirmed recoveries attributed to the virus.\n\n&nbsp;\n\n**Recent Updates**\n\n*Note: These are the updates from the last 48-72 hours.*\n\n\nMARCH 8 and 9 -\n\n* Ireland is expected to cancel all St. Patrick's Day parades/festivities. Dublin and Cork have already canceled. [Read more here.](https://www.bbc.com/news/world-europe-51806551)\n\n* Iran temporarily released about 70,000 prisoners because of the coronavirus contagion, as the death toll rose by 43 new fatalities to 237. Meanwhile, Saudi Arabia temporarily suspended land and sea travel to and from Oman, France, Germany, Turkey and Spain for citizens and residents to help stem the spread of coronavirus. Earlier suspensions include the United Arab Emirates, Kuwait, Bahrain, Lebanon, Syria, South Korea, Egypt, Italy and Iraq.  [Read more here.](https://www.aljazeera.com/news/2020/03/italy-coronavirus-toll-soars-north-sealed-live-updates-200308235426110.html)\n\n* The U.S. death toll reached 21 on Sunday, with 554 confirmed cases across 34 states and the District of Columbia. All but three of the deaths have been in Washington state; two were in Florida and one in California. [Read more here.](https://www.usatoday.com/story/news/health/2020/03/08/coronavirus-live-updates-grand-princess-cruise-ship-bound-oakland/4953496002/)\n\n* China reports the fewest number of coronavirus cases since it started tracking the disease in January. [Read more here.](https://www.usatoday.com/story/news/world/2020/03/09/coronavirus-international-developments/4998528002/)\n\n* France on Sunday banned gathering of more than 1,000 people as the death toll and number of coronavirus infections continued to rise. [Read more and see ongoing updates here.](https://www.theguardian.com/world/live/2020/mar/09/coronavirus-live-updates-outbreak-italy-lockdown-quarantine-uk-usa-america-australia-recession-fears-update-latest-news)\n\n* Rick Cotton, head of the Port Authority of New York and New Jersey, which runs NY’s airports, has tested positive for the new coronavirus. [See the tweet here.](https://twitter.com/JimmyVielkind/status/1237035053001183234)\n\n* President Trump [tweeted this](https://twitter.com/realDonaldTrump/status/1237027356314869761) on the morning of March 9:\n\n> So last year 37,000 Americans died from the common Flu. It averages between 27,000 and 70,000 per year. Nothing is shut down, life & the economy go on. At this moment there are 546 confirmed cases of CoronaVirus, with 22 deaths. Think about that!\n\n* Sen. Ted Cruz interacted with person who has tested positive for coronavirus. Cruz said he feels fine and is not showing symptoms of the coronavirus, but will self-quarantine out of an abundance of caution. [Read more here.](https://www.kvue.com/article/news/health/coronavirus/senator-ted-cruz-coronavirus-interaction/269-7c360647-ad66-428c-87b6-196cfe79103e)\n\n&nbsp;\n\nMARCH 7 -\n\n* Italy is set to lock down at least 16 million people in the region of Lombardy and in 11 other provinces in the north and east of the country. The mandatory quarantine will last until early April. [Read more here.](https://www.bbc.com/news/world-middle-east-51787238)\n\n* Iranian official who took part in 1979 Iran hostage crisis dies of coronavirus. He is the sixth politician or government official to be killed by the virus in Iran. [Read more here.](https://www.foxnews.com/world/coronavirus-iran-death-official-update)\n\n* About 70 people were trapped after a hotel being used as a coronavirus quarantine facility in the Chinese city of Quanzhou collapsed. [Read more here.](https://www.bbc.com/news/world-asia-china-51784167)\n\n* Authorities in the United States have reported 434 cases of the coronavirus and 19 deaths, according to data compiled by NBC News. Several states have declared emergencies in response to the virus, including California, Florida, Indiana, Kentucky, Maryland, New York, Utah and Washington. Pennsylvania has issued a disaster declaration and the city of Austin, Texas has issued a local disaster declaration. [Read more here.](https://www.cnbc.com/2020/03/07/coronavirus-live-updates-pope-cancels-large-public-appearances-as-cases-surge-in-europe.html)\n\n* CPAC attendee tests positive for coronavirus. [Read more here.](https://thehill.com/policy/healthcare/486457-cpac-attendee-tests-positive-for-coronavirus)\n\n&nbsp;\n\n\n**CDC Recommendations:**\n\n* People over 60 and those with severe chronic heart, lung, or kidney disease stay at home as much as possible and avoid crowds. [Read more here.](https://www.cdc.gov/coronavirus/2019-ncov/specific-groups/high-risk-complications.html) \n\n* Travelers, particularly those who are older and/or have underlying health issues, should “defer all cruise ship travel worldwide”. The CDC also notes that “cruise ship passengers are at increased risk of person-to-person spread of infectious diseases, including COVID-19\". [Read more here.](https://wwwnc.cdc.gov/travel/page/covid-19-cruise-ship)\n\n&nbsp;\n\n**Tracking COVID-19**\n\n* [Vox is keeping track of COVID-19 infections for each U.S. state here.](https://www.vox.com/2020/3/3/21163020/coronavirus-new-york-washington-california-florida)\n\n* [John Hopkins University has a live tracker/map of the global spread of COVID-19 here.](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6) \n\n* [Today's situation report from the WHO.](https://www.who.int/docs/default-source/coronaviruse/situation-reports/20200308-sitrep-48-covid-19.pdf?sfvrsn=16f7ccef_4)\n\n* [The CDC's COVID-19 Situation Summary.](https://www.cdc.gov/coronavirus/2019-nCoV/summary.html)\n\n&nbsp;\n\n**New Countries reporting cases their first cases this week:**\n\n*Note 1: The list starts fresh each Monday.*\n\n*Note 2: This list is pulled from the WHO's daily situation reports (linked above).*\n\n* Bulgaria\n\n* Costa Rica\n\n* Faroe Islands\n\n* French Guiana\n\n* Maldives\n\n* Martinique\n\n* Republic of Moldova\n\nOver 100 countries have now reported lab-confirmed cases of COVID-19. \n\n&nbsp;\n\n**Reputable Sources for Information:**\n\n* [The CDC's Dedicated Coronavirus Resource,](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n\n* [The WHO's Dedicated Coronavirus Resource,](https://www.who.int/health-topics/coronavirus)\n\n* [The University of Chicago School of Medicine's handy FAQ style resource.](https://www.uchicagomedicine.org/forefront/prevention-and-screening-articles/wuhan-coronavirus)\n\n\n&nbsp;\n\nAnd for those too lazy to click on the University of Chicago Med [resource](https://www.uchicagomedicine.org/forefront/prevention-and-screening-articles/wuhan-coronavirus), here are some of the answers to commonly asked questions:\n\n&nbsp;\n\n**What is a coronavirus? What is a novel coronavirus?**\n\n> A coronavirus is actually the name for a set of illnesses, including the common cold and other respiratory infections. A novel coronavirus means it’s a new virus that originated in animals, but has jumped to humans. This particular 2019 novel coronavirus from Wuhan is called COVID-19 or 2019-nCoV.\n\n&nbsp;\n\n**How does the COVID-19 spread?**\n\n> This virus is really transmissible and can spread easily from person to person even before a person develops symptoms. It’s carried on respiratory droplets when we talk, sneeze, and cough and these can land on surfaces or in someone’s mouth or nose.  When it comes to respiratory droplets, 6 feet is the magic distance. That’s how far these tiny, infected droplets can travel.  Being within 6 feet of someone who is sick can get you or your personal space contaminated with COVID-19.  \n\n> When droplets land on surfaces, we can pick them up with our hands and transfer them to our eyes, mouth, and nose when we touch our faces. This is why hand hygiene is so important.  Respiratory secretions (like snot and sputum) are also infectious so cover your coughs and sneezes.\n\n\n&nbsp;\n\n**What are the symptoms of the virus? Is it deadly?** \n\n> It typically causes flu-like symptoms. Some patients — particularly the elderly and others with other chronic health conditions — develop a severe form of pneumonia.\n\n> Patients develop symptoms like fever, muscle and body aches, cough, and sore throat about 5-6 days after infection. Most people will feel pretty miserable for a week and get better on their own.  Some people won’t get as sick, but it’s still important not to be out and about, so as not to spread the disease.  A minority of patients will get worse instead of better. This usually happens after 5-7 days of illness and these patients will have more shortness of breath and worsening cough.  If this happens, it’s time to contact your doctor again or even go to an emergency room. Be sure to call first so they know you are coming.  \n\n> The numbers of people who have been diagnosed and how many have died are changing daily. As of early March, there have been over 97,000 confirmed cases, with a death toll of about 3,000 (more than 2,900 in mainland China). But these numbers are just estimates; it’s still unclear how many people have actually been infected worldwide. Most of the deaths have been in adults over 60 years old who had other health concerns.\n\n&nbsp;\n\n**Are we all at risk for catching this new coronavirus (2019-nCoV)?**\n\n> Yes. It doesn’t appear anyone is naturally immune to this particular virus and there’s no reason to believe anybody has antibodies that would normally protect them. \n\n> The lack of previous experience with this pathogen is part of the reason why public health officials around the globe are working so hard to contain the spread of this particular coronavirus from Wuhan. When viruses come out like this that are both new (which means the population is highly susceptible) and can easily pass from person to person (a high transmission rate), they can be really dangerous — even if here’s a low percentage of people who die from them. \n\n&nbsp;\n\n**Why do some people with the COVID-19 get sicker than others?**\n\n> It looks like only about 20% of people who contract this novel coronavirus need to be hospitalized. The other 80% get what feels like a bad cold and recover at home. A lot of this has to do with underlying medical conditions. People who are more vulnerable to any kind of infection — because of their age or chronic health conditions — are more at risk for getting really sick from COVID-19. \n\n> That said, some otherwise healthy people do seem to be getting sicker from this infection than we would expect. We don’t understand why that is or what might be different about these patients. If you have COVID-19 and you are getting sicker and sicker instead of better and better, you should contact your doctor or visit an ER. Be sure to call first so they know to expect you.  \n\n&nbsp;\n\n**What kind of medical care do patients with COVID-19 need?**\n\n> About 80% of people who contract this new coronavirus will feel sick, but ultimately be just fine. It’s the 20% of COVID-19 patients who get really, really sick that worry many of us in the infectious diseases field. A lot of these critically ill patients wind up needing to be hospitalized for their pneumonia-like illnesses. They typically require critical care and ventilation — special machines that help them breathe. And some need to stay on ventilators for weeks at a time. It’s this portion of patients that is most concerning. Depending on how many cases develop here in the U.S., providing that level of care for so many people over a number of weeks runs the risk of overwhelming the nation’s health care system pretty quickly. We can help prevent this kind of “surge” in patients by practicing social distancing (see below for more explanation). \n\n&nbsp;\n\n**Should people be more concerned about the seasonal flu or COVID-19?**\n \n> There’s widespread seasonal flu activity going on right now all around the U.S.  But there are steps you can take to protect yourself from influenza. You can get an annual flu shot. You can take medication like Tamiflu that protects you from getting influenza after you’ve been exposed. You can cover your mouth and wash your hands to mitigate the spread. And, like clockwork, this year’s influenza strain is going to die out in the spring because it will have run its course. \n\n> The challenge with COVID-19 is that we probably can’t contain it and we don’t know if we’re really prepared as a country for a massive coronavirus epidemic.  If we are lucky, it will slow down a bit over the summer but the next few months look like they are going to be pretty tough for all of us. We need to be as ready as we can for whatever comes our way and know that we will get through it eventually. \n\n&nbsp;\n\n**How can I protect myself?  Should I wear a facemask?**\n  \n> Take the preventive actions you do for the cold and flu. This includes avoiding close contact with people who are sick; not touching your eyes, nose and mouth; washing your hands thoroughly and frequently; and cleaning and disinfecting objects and surfaces you come in contact with regularly.\n\n> The CDC does not recommend you wear a facemask to protect yourself from getting COVID-19 or other respiratory illnesses. Those who have COVID-19 and/or are showing symptoms should wear a mask to protect others from getting the virus.  Any healthcare worker taking care of someone infected with COVID-19 also should wear a mask.\n\n&nbsp;\n\n**Can I take an antibiotic or vaccinate against the virus?**\n \n> There is no antibiotic (they are designed for bacterial infections, not viral ones) to treat COVID-19.  Scientists are already working on a vaccine, but we don’t expect to have a good vaccine until spring of 2021 at the earliest.  However, ongoing trials in China suggest that there are some existing antiviral drugs that may be helpful for the sickest patients.  In fact, the University of Chicago is part of a multi-institutional team that has mapped a protein of SARS-CoV-2 and found drugs previously in development for SARS could be effective for COVID-19.\n\n> For now, doctors can only treat the symptoms, not the virus itself."
    },
    "Post 32": {
        "Title": "Iranian hackers have repeatedly attacked Bank of America, JPMorgan Chase and Citigroup over the past year, as part of a broad cyber campaign targeting the United States",
        "Flair": null,
        "Date Created": "09-22-2012 01:24:35",
        "Upvotes": 6,
        "Upvote Ratio": 0.72,
        "ID": "109osu",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.reuters.com/article/2012/09/21/us-iran-cyberattacks-idUSBRE88K12H20120921",
        "Comment Count": 5,
        "Text": ""
    },
    "Post 33": {
        "Title": "France will ban imports of live pigs, pork-based byproducts and pig sperm from the United States, Canada, Mexico and Japan to protect against a virus that has killed millions of piglets in North America and Asia.",
        "Flair": null,
        "Date Created": "05-03-2014 00:58:52",
        "Upvotes": 22,
        "Upvote Ratio": 0.79,
        "ID": "24kmeb",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.reuters.com/article/2014/05/02/us-france-pork-idUSKBN0DI1CH20140502",
        "Comment Count": 1,
        "Text": ""
    },
    "Post 34": {
        "Title": "Coronavirus Megathread #3",
        "Flair": null,
        "Date Created": "02-10-2020 04:03:44",
        "Upvotes": 1525,
        "Upvote Ratio": 0.96,
        "ID": "f1ih07",
        "Edited?": "02-29-2020 14:45:16",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/f1ih07/coronavirus_megathread_3/",
        "Comment Count": 7123,
        "Text": "**This post is updated daily.**\n\n&nbsp;\n\nUpdate: America has seen its first coronavirus death in Washington State. [Read more here.](https://www.nbcnews.com/news/us-news/1st-coronavirus-death-u-s-officials-say-n1145931)\n\nAdditionally, the first case of COVID-19 in the United States which may involve community spread was confirmed by a CDC test on Wednesday. The case is in California.\n\n&nbsp;\n\nThe Trump Administration held a second press briefing about the coronavirus today. You can [watch it here.](https://twitter.com/WhiteHouse/status/1233826652171333632)\n\n&nbsp;\n\nUpdate: The CDC is urging Americans to prepare for an outbreak in the United States. Read their preparedness memo here: https://www.cdc.gov/coronavirus/2019-ncov/php/preparing-communities.html\n\n[You can watch the press briefing here.](https://twitter.com/i/broadcasts/1RDGlQbMedjJL)\n\n&nbsp;\n\n[The World Health Organization has declared the Coronavirus a Global Health Emergency.](https://www.bbc.com/news/world-51318246)\n\n&nbsp;\n\n[Today's situation report from the WHO.](https://www.who.int/docs/default-source/coronaviruse/situation-reports/20200226-sitrep-37-covid-19.pdf?sfvrsn=6126c0a4_2)\n\n[The CDC's COVID-19 Situation Summary.](https://www.cdc.gov/coronavirus/2019-nCoV/summary.html)\n\n&nbsp;\n\nA novel coronavirus, likely transmitted from animals to humans at a market in Wuhan, China, has now infected more than 85,994 people. There have been 2,941 confirmed deaths and 39,761 confirmed recoveries attributed to the virus and it's now in more than 28 countries.\n\n&nbsp;\n\n**New Countries reporting cases this week:**\n\n* Algeria\n\n* Croatia\n\n* Switzerland\n\n* Austria\n\n*Note: For the first time, since the onset of symptoms of the first identified case of COVID-19 on 8 December 2019, there have been more new cases reported from countries outside of China than from China.*\n\n&nbsp;\n\n**Reputable Sources for Information:**\n\n[The CDC's Dedicated Coronavirus Resource,](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n\n[The WHO's Dedicated Coronavirus Resource,](https://www.who.int/health-topics/coronavirus)\n\nAnd the [University of Chicago School of Medicine's handy FAQ style resource.](https://www.uchicagomedicine.org/forefront/prevention-and-screening-articles/wuhan-coronavirus)\n\n&nbsp;\n\nYou can also check out [this live tracker/map of the spread of the coronavirus](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6) provided by John Hopkins University.\n\n&nbsp;\n\nAnd for those too lazy to click on the University of Chicago Med [resource](https://www.uchicagomedicine.org/forefront/prevention-and-screening-articles/wuhan-coronavirus), here are some of the answers to commonly asked questions:\n\n&nbsp;\n\n**What is a coronavirus? What is a novel coronavirus?**\n\n> A coronavirus is actually the name for a set of illnesses, including the common cold and other respiratory infections. A novel coronavirus means it’s a new virus that originated in animals, but has jumped to humans. This particular 2019 novel coronavirus from Wuhan is called COVID-19 or 2019-nCoV.\n\n&nbsp;\n\n**How does the Wuhan coronavirus spread?**\n\n> So far, there’s limited information about the Wuhan novel coronavirus, including how easy it is to spread and how dangerous it is. But we know the virus can be transmitted from person to person and it is passed by coughing and other close contact.\n\n> Close contact is a vague term that means a lot of things to different people. But in this case, it specifically means being within about six feet of someone for a prolonged period of time without wearing recommended personal protective equipment such as a disposable face mask. It could also be having direct contact with infectious secretions of someone who has a case of the virus (for example: being coughed on) while not wearing personal protective equipment.\n\n> That can sound scary, but it’s important to know that influenza is also transmitted the same way.\n\n&nbsp;\n\n**What are the symptoms of the virus?** \n\n> We’re still learning more about Wuhan novel coronavirus, but we know it typically causes flu-like symptoms including a fever, cough and congestion. Some patients — particularly the elderly and others with other chronic health conditions — develop a severe form of pneumonia.\n\n&nbsp;\n\n**Are we all at risk for catching this new coronavirus (2019-nCoV)?**\n\n> Yes. It doesn’t appear anyone is naturally immune to this particular virus and there’s no reason to believe anybody has antibodies that would normally protect them. \n\n> The lack of previous experience with this pathogen is part of the reason why public health officials around the globe are working so hard to contain the spread of this particular coronavirus from Wuhan. When viruses come out like this that are both new (which means the population is highly susceptible) and can easily pass from person to person (a high transmission rate), they can be really dangerous — even if here’s a low percentage of people who die from them. \n\n&nbsp;\n\n**Why do some people with the Wuhan coronavirus get sicker than others?**\n\n> It looks like only about 20% of people who contract this novel coronavirus actually wind up needing to be hospitalized. The other 80% get what feels like a really bad cold and they recover at home. A lot of it has to do with underlying medical conditions. People who are more vulnerable to any kind of infection — because of their age or chronic health conditions — are more at risk for getting really sick from this novel coronavirus too. \n\n> That said, some otherwise healthy people do seem to be getting more sick from this infection than we would expect. We don’t understand why that is or what might be different about those people. Thanks to the work of scientists and doctors on the ground in China, which is really nothing short of heroic, we’re learning a little more every single day.\n\n&nbsp;\n\n**Is this coronavirus deadly?**\n\n> The numbers of how many people have been diagnosed or how many have died are changing rapidly. Without accurate numerators and denominators, the jury’s still out. That said, we do know that more than 100 people in China have died from this virus. Based on the information I’m seeing, it looks very similar to SARS in a number of ways — except for the fact that it’s likely less deadly, but more transmittable.\n\n&nbsp;\n\n**What kind of medical care do patients with the Wuhan coronavirus need?**\n\n> About 80% of people who contract this new coronavirus will feel sick, but ultimately be just fine. It’s the other 20% who get really, really sick that worry so many of us in the infectious diseases field. A lot of these critically ill patients wind up needing to be hospitalized for their pneumonia-like illnesses. They typically require critical care and ventilation — special machines that help them breathe. And some need to stay on ventilators for weeks at a time. It’s that portion of patients that’s most concerning. Depending how many cases develop here in the U.S., providing that level of care for that many people over a number of weeks runs the risk of overwhelming the nation’s health care system pretty quickly. \n\n&nbsp;\n\n**How do you treat patients with this virus? Can you vaccinate against it?**\n\n> Things like antibiotics are designed to kill bacteria, not a virus. So typically doctors can treat the symptoms, but not the virus itself. There’s no vaccine yet."
    },
    "Post 35": {
        "Title": "A nine-year-old boy from the United States has become the younger person to reach the summit of Aconcagua, the highest mountain in the Americas.",
        "Flair": null,
        "Date Created": "12-28-2013 04:08:14",
        "Upvotes": 4,
        "Upvote Ratio": 0.7,
        "ID": "1tug94",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://bbc.in/1dJfugG",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 36": {
        "Title": "Monitoring America - Nine years after the terrorist attacks of 2001, the United States is assembling a vast domestic intelligence apparatus to collect information about Americans, using the FBI, local police, state homeland security offices and military criminal investigators.",
        "Flair": null,
        "Date Created": "12-20-2010 18:37:22",
        "Upvotes": 26,
        "Upvote Ratio": 0.78,
        "ID": "eossw",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://projects.washingtonpost.com/top-secret-america/articles/monitoring-america/?hpid=topnews",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 37": {
        "Title": "Monitoring America: \"Nine years after the terrorist attacks of 2001, the United States is assembling a vast domestic intelligence apparatus to collect information about Americans, using the FBI, local police, state homeland security offices and military criminal investigators.\"",
        "Flair": null,
        "Date Created": "12-20-2010 20:40:58",
        "Upvotes": 6,
        "Upvote Ratio": 0.72,
        "ID": "eouxo",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://projects.washingtonpost.com/top-secret-america/articles/monitoring-america/print/",
        "Comment Count": 2,
        "Text": ""
    },
    "Post 38": {
        "Title": "Guatemala's president proposed Saturday during a Central America meeting that he called to discuss his earlier proposal to legalize drugs, that the United States and other \"consumer\" countries pick up the tab for the cost of drug seizures.",
        "Flair": null,
        "Date Created": "03-26-2012 04:41:17",
        "Upvotes": 7,
        "Upvote Ratio": 0.82,
        "ID": "rdfpr",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://hosted.ap.org/dynamic/stories/L/LT_DRUG_WAR_CENTRAL_AMERICA?SITE=RIPAW&SECTION=HOME&TEMPLATE=DEFAULT",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 39": {
        "Title": "Conditions in Iraq don't match the spin. Paul Rieckhoff, founder and executive director of Iraq and Afghanistan Veterans of America, talks with Rachel Maddow about why \"the end of combat operations\" is inaccurate and the conditions in Iraq when the United States finally does withdraw.",
        "Flair": null,
        "Date Created": "09-17-2010 14:04:21",
        "Upvotes": 14,
        "Upvote Ratio": 0.71,
        "ID": "df4wh",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.msnbc.msn.com/id/26315908/vp/39223808#39223808",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 40": {
        "Title": "\"Americans may believe the United States is set up for the middle class, and Europe is set up for the bourgeois. Or  America is a great place to buy kitty litter at Wal-Mart and relatively cheap gas. But it is not designed for me, a professional without a lot of money. That’s who Europe is for\"",
        "Flair": null,
        "Date Created": "09-29-2010 20:38:11",
        "Upvotes": 8,
        "Upvote Ratio": 0.73,
        "ID": "dkkmj",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.inthesetimes.com/article/6194/",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 41": {
        "Title": "The United States is failing to find and help tens of thousands of human trafficking victims in America.",
        "Flair": null,
        "Date Created": "12-14-2009 20:44:29",
        "Upvotes": 7,
        "Upvote Ratio": 0.77,
        "ID": "aekpo",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.mcclatchydc.com/251/story/80576.html",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 42": {
        "Title": "\"America's creaky immigration system makes it difficult for talented young people born outside of the United States to come to the Bay Area...So a new company called Blueseed...plans to buy a ship and turn it into a floating incubator anchored in international waters off the coast of California.\"",
        "Flair": null,
        "Date Created": "12-01-2011 03:29:04",
        "Upvotes": 1,
        "Upvote Ratio": 0.57,
        "ID": "mvfgw",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://arstechnica.com/tech-policy/news/2011/11/startup-hopes-to-hack-the-immigration-system-with-a-floating-incubator.ars",
        "Comment Count": 1,
        "Text": ""
    },
    "Post 43": {
        "Title": "America Will Pay a Mighty Price If It Keeps Pretending It's the Superpower It Used to Be--The United States has built a self-deluding narrative of global domination which the world increasingly rejects.",
        "Flair": null,
        "Date Created": "12-29-2010 03:40:05",
        "Upvotes": 0,
        "Upvote Ratio": 0.49,
        "ID": "estdv",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.alternet.org/module/printversion/149350",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 44": {
        "Title": "America by the Numbers: A sampling of statistics from the newly released Statistical Abstract of the United States.",
        "Flair": null,
        "Date Created": "01-08-2011 20:07:07",
        "Upvotes": 0,
        "Upvote Ratio": 0.5,
        "ID": "eyit0",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.nytimes.com/interactive/2011/01/07/us/CENSUS.html",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 45": {
        "Title": "the cowardly methods of \"secret war\" -- is entirely counterproductive ... if your actual aim is to enhance America's national security by reducing violent extremism and hatred for the United States, that is. However, if your aim is to...",
        "Flair": null,
        "Date Created": "06-12-2010 20:50:59",
        "Upvotes": 1,
        "Upvote Ratio": 0.6,
        "ID": "ceaut",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.chris-floyd.com/articles/1-latest-news/1975-war-on-the-world-obamas-surge-in-state-terror.html",
        "Comment Count": 0,
        "Text": ""
    },
    "Post 46": {
        "Title": "Orlando Nightclub shooting - Megathread",
        "Flair": null,
        "Date Created": "06-13-2016 02:06:31",
        "Upvotes": 0,
        "Upvote Ratio": 0.12,
        "ID": "4nsjcn",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/4nsjcn/orlando_nightclub_shooting_megathread/",
        "Comment Count": 408,
        "Text": "This megathread is for discussion of the recent Orlando Nightclub shooting. This post will be kept up to date with the latest links from reputable news media organisations.\nLink to current reddit live thread: https://www.reddit.com/live/x2tjnk7gg9wa\n\nOriginal News Links:\n\n[Orlando nightclub shooting: 50 dead, 53 injured, police say, in worst mass shooting in US history](http://www.abc.net.au/news/2016-06-12/florida-police-confirm-shooting-at-orlando-nightclub/7503770)\n\n>At least 50 people have been killed and another 53 injured after a heavily armed gunman opened fire and seized hostages at a gay nightclub in Orlando, Florida, police say, in the worst mass shooting in US history.\n\n[Orlando nightclub shooting: Injuries severe, hospital official says](http://www.orlandosentinel.com/news/breaking-news/os-families-wait-for-information-at-hospital-after-orlando-nightclub-shooting-20160612-story.html)\n\n>Orlando Regional Medical Center admitted 44 patients after the mass shooting at the Pulse nightclub, and nine of those people died, said Dr. Michael Cheatham, chief surgical quality officer for ORMC.\n\n[Florida Nightclub Massacre Is Deadliest Mass Shooting in U.S. History](http://www.nbcnews.com/storyline/orlando-nightclub-massacre/florida-nightclub-massacre-deadliest-mass-shooting-u-s-history-n590476)\n\n>With at least 50 people killed, the massacre early Sunday morning at an Orlando nightclub is the deadliest single-day mass shooting in the history of the United States — by nearly double the previous most deadly incident.\n\n[50 killed in shooting at Florida nightclub in possible act of Islamic terror](http://www.foxnews.com/us/2016/06/12/gunman-dies-after-mass-casualty-shooting-at-orlando-nightclub.html\n\n>A gunman who may have pledged allegiance to ISIS opened fire early Sunday morning in a packed Orlando nightclub, killing 50 people and wounding at least 53 more in a bloody scene that ended hours later when police stormed the building and killed the shooter.\n\nLatest News Links:\n\n[Omar Mateen: Gunman who killed 50 in Orlando gay club identified by police](http://www.independent.co.uk/news/world/americas/omar-mateen-orlando-gay-club-shooter-identified-by-police-us-media-a7077936.html)\n\n>Police have identified the gunman in the mass shooting at a gay club in Florida as 29-year-old Omar Mateen, an American citizen whose parents are from Afghanistan.\n\n[Nightclub Shooter Omar Mateen Pledged Allegiance to ISIS, Was Once Probed by FBI](http://www.nbcnews.com/storyline/orlando-nightclub-massacre/terror-hate-what-motivated-orlando-nightclub-shooter-n590496)\n\n>In 2013, Omar Mateen first landed on the radar of federal agents after coworkers reported that he made \"inflammatory\" comments to them about radical Islamic propaganda.\n\n[Ex-wife of suspected Orlando shooter: ‘He beat me’](https://www.washingtonpost.com/world/national-security/ex-wife-of-suspected-orlando-shooter-he-beat-me/2016/06/12/8a1963b4-30b8-11e6-8ff7-7b6c1998b7a0_story.html?postshare=7921465748801168)\n\n>The ex-wife of the 29-year-old man who is believed to have killed 50 people in an Orlando nightclub early Sunday said that he was violent and mentally unstable and beat her repeatedly while they were married.\n\n[Islamic State Claims Worst Shooting In US History](http://news.sky.com/story/1710850/islamic-state-claims-worst-shooting-in-us-history)\n\n>Islamic State has claimed responsibility for the Orlando nightclub shooting which killed 50 people and injured 53 others. according to the Amaq news agency.\n\n[President Obama: 'This was an act of terror' and hate](http://news3lv.com/news/nation-world/president-obama-to-address-the-nation-on-orlando-nightclub-massacre)\n\n>President Obama called the attack on an Orlando night club \"an act of terror\" and hate\n\n[Orlando shooting: Witnesses describe what they saw](http://www.cbc.ca/news/world/orlando-shooting-witnesses-tributes-1.3631554)\n\n>Sounds of multiple gunshots can be heard in videos taken at the scene\n\n[Call for Blood Donors After Orlando Massacre Excludes Many Gay, Bisexual Men](http://abcnews.go.com/Health/call-blood-donors-orlando-massacre-excludes-gay-bisexual/story?id=39796751)\n\n>In the wake of the Orlando shooting that left at least 50 people dead at a gay night club, health officials pleaded for community members to donate blood to help the injured."
    },
    "Post 47": {
        "Title": "Facebook Note Posted by Former Marine Brandon J Raub, Recently Arrested by the FBI (Friday 8/16/12)",
        "Flair": null,
        "Date Created": "08-19-2012 22:42:56",
        "Upvotes": 8,
        "Upvote Ratio": 0.71,
        "ID": "yhd7r",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/yhd7r/facebook_note_posted_by_former_marine_brandon_j/",
        "Comment Count": 17,
        "Text": "The Truth\nby Brandon J Raub on Friday, November 11, 2011 at 10:00am\n\nAmerica has lost itself.  We have lost who we truly are.  This is the land of the free and the home of the brave.  This is the land of Thomas Jefferson.  This is the land of Benjamin Franklin.  This is the land of Fredrick Douglas.  This is the land of Smedley Butler.  This is the land John F. Kennedy.  This is the land of Martin Luther King.  This is the land where the cowboy wins.  This is the land where you can start from the bottom and get to the top.  This is the land where regardless of you race and ethnicity you can suceed and build a better life for you and your family.  This is the land where every race coexists peacefully.  This is the land where justice wins.  This is the land where liberty dwells. This is the land where freedom reigns.  This is the land where we help the poor, and people help eachother.  This is land where people beat racism.\n\n \n\nThe federal reserve is wrong.  They have designed a system based off of gread and fear.  They designed a system to crush the middle class between taxes and inflation.  This is wrong, and it is unjust.  It is wrong.\n\n \n\nWe have allowed ourselves to be devieced and seduced by the powers of the printing press.  It is not a good system.  It discourages saving: the foundation for all stable economic activity.  The federal reserve is artificially manipulating interests rates and creating phony economic data.  This thing has decieved our entire nation.\n\n \n\nThey created it 1913.  They also created the income tax in 1913.  They encouraged the growth of debt so they can tax you on it.  There is interest on the debt.  Your government is in bed with these people.  They want to enslave you to the government so that they can control every aspect of your lives.  It is an empire based on lies.  They operate of greed and fear.\n\n \n\nThere is a better way.  It's called freedom.  Freedom is called a lot of things.  But there is a true meaning.  It means very simply that you have the right to do whatever you want as long as you are not infringing on the feedoms of other people.\n\n \n\nI firmly believe that God set America apart from the other nations of the world.  He saved a place where people could come to to escape bad systems of goverment.  This system we have created works.  It really works.\n\n \n\nThere is evil going on all around the world.  The United States was meant to lead the charge against injustice, but through our example not our force.  People do not respond to having liberty and freedom forced on them.\n\n \n\nMen and Women follow courage.  They follow leadership, and courage.  Our example has paved the way for people all around the world to change their forms of goverment.\n\n \n\nForce is not the way because liberty is a powerful concept.  The idea that men can govern themselves is the basis for every just form of government. \n\n \n\nWe can govern ourselves.  We do not need to be governed by men who want to install a one world banking system.  These men have machine hearts.  Machine and unnatural hearts.  They have blocked out the possibility of a better world.  They fear human progress.  They have monopolies on everything.\n\n \n\nThis life can be free and beautiful.  There are enough resources on this earth to support the world's population.  There are enough resources on this earth to feed everyone.  There is enough land for everyone to own their own land and farm, and produce their own energy.\n\n \n\nThese people have been hiding technology.  There are ways to create power easily.  There is technology that can provide free cheap power for everyone.  There are farming techniques that can feed the entire world.\n\n \n\nThey are controlling your media.  They have dumbed you down through your school systems.  They have systematically dismantled the constitution.  It is in rags.\n\n \n\nThe bill of rights is being systematically dismantled.  Men have spilled their blood for those rights.\n\n \n\nYour sons and daughters, your brothers and sisters, and Americas best young men and women are loosing their limbs.  They are loosing their lives.  They are loosing the hearts.  They do not know why they are fighting.  They are killing.  And they do not know why.\n\n \n\nThey have done some extroadinary acts.  Their deeds go before them.  But these wars are lies.  They are lies.  They decieved our entire nation with terrorism.  They have gotten us to hand them our rights.  Our Rights!  Men died for those rights!\n\n \n\nSeptember Eleventh was an inside job.  They blew up a third building in broad daylight.  Building 7.\n\n \n\nYour leaders betrayed you.\n\n \n\nYou elected an aristocracy.  They are beholden to special interests.  They were brainwashed through the Council on Foreign Relations.  Your leaders are planning to merge the United States into a one world banking system.  They want to put computer chips in you.\n\n \n\nThese men have evil hearts.  They have tricked you into supporting corporate facism.  We gave them the keys to our country.  We were not vigilant with our republic.\n\n \n\nThere is hope.  BUT WE MUST TAKE OUR REPUBLIC BACK."
    },
    "Post 48": {
        "Title": "Banks holding over $200 million in Hurricane Sandy payments",
        "Flair": null,
        "Date Created": "02-13-2013 22:48:30",
        "Upvotes": 9,
        "Upvote Ratio": 0.77,
        "ID": "18goof",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/18goof/banks_holding_over_200_million_in_hurricane_sandy/",
        "Comment Count": 0,
        "Text": "http://www.cnn.com/2013/02/12/us/new-york-banks-sandy-payments/index.html?hpt=hp_t2\n\n\nBy David Ariosto , CNN\nupdated 9:42 AM EST, Wed February 13, 2013 CNN.com \n\n \nNew York (CNN) -- Banks are holding more than $200 million in insurance payments meant for victims of Superstorm Sandy, nearly four months after the storm made landfall, New York Gov. Andrew Cuomo said Tuesday.\n\nThe Cuomo administration said it has delivered letters to various banks and mortgage service providers asking they \"use maximum discretion and effort to speed the release of funds.\"\n\n\"Families need to be able to return to their homes and the state economy, which took a hit from Superstorm Sandy, needs the boost from spending on repairs,\" Cuomo said in a written statement. \"After insurance companies have sent homeowners checks to pay for repairs, the money should not be sitting with the bank because of red tape.\"\n\nA month of outrage later, Senate passes Sandy relief \n\nThe state's Department of Financial Services found that four of the biggest U.S. banks -- Wells Fargo, Bank of America, Citibank and JP Morgan Chase -- are holding more than 4,100 checks worth more $130 million. The banks were not immediately available for comment, though have maintained that they were socked with a massive amount in payouts that require processing in the wake of the storm.\n\nThousands of storm-battered residents are still awaiting a total of $208 million in insurance checks.\nCuomo said the payouts are often issued jointly to the homeowner and their bank or mortgage servicer, which then requires the \"bank's endorsement of the check before the homeowner may access the funds.\"\n\nDelays can follow when banks request proof of repairs or servicing required by federal mortgage agencies. But many residents have complained that they haven't received the funds they need to start the repairs.\n\nSuperstorm Sandy left 132 people dead in the United States and contributed to tens of billions of dollars worth of damages, especially along shoreline communities in New York, New Jersey and parts of Connecticut.\n---------\n*© 2013 Cable News Network. Turner Broadcasting System, Inc. All Rights Reserved.*"
    },
    "Post 49": {
        "Title": "Going To College : An education.",
        "Flair": null,
        "Date Created": "04-28-2011 22:26:32",
        "Upvotes": 0,
        "Upvote Ratio": 0.5,
        "ID": "gzi0s",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/news/comments/gzi0s/going_to_college_an_education/",
        "Comment Count": 0,
        "Text": "\"Across America today, 'guidance counselors' are pushing millions of high school students to go to the very best colleges that they can get into, but they rarely warn them about how much it is going to cost or about the sad reality that they could end up being burdened by massive debt loads for decades to come.\"\n\n\"college is a ton of fun and it is a really unique experience.  If you can get someone else to pay for it then you should definitely consider going\"\n\n\"When graduation finally arrives, many of our college students have actually learned very little, they find themselves unable to get good jobs and yet they end up trapped in student loan debt hell for essentially the rest of their lives.\"\n\n[\"The truth is that pretty much wherever you go to school the quality of the education is going to be rather pathetic.  A highly trained cat could pass most college courses in the United States today.\"](http://www.blacklistednews.com/Student_Loan_Debt_Hell%3A_21_Statistics_That_Will_Make_You_Think_Twice_About_Going_To_College/13691/0/0/0/Y/M.html)"
    }
}