{
    "Post 1": {
        "Title": "CLASS ACTION AGAINST ROBINHOOD. Allowing people to only sell is the definition of market manipulation. A class action must be started, Robinhood has made plenty of money off selling info about our trades to the hedge funds to be able to pay out a little for causing people to loose money now",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 16:49:11",
        "Upvotes": 217150,
        "Upvote Ratio": 0.96,
        "ID": "l6x130",
        "Edited?": "01-28-2021 12:44:45",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l6x130/class_action_against_robinhood_allowing_people_to/",
        "Comment Count": 18544,
        "Text": "LEAVE ROBINHOOD. They dont deserve to make money off us after the millions they caused in losses. It might take a couple of days, but send Robinhood to the ground and GME to the moon."
    },
    "Post 2": {
        "Title": "WE are Preparing a Class Action LAWSUIT against Robinhood!",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 17:57:45",
        "Upvotes": 85129,
        "Upvote Ratio": 0.98,
        "ID": "l6yrs3",
        "Edited?": "02-02-2021 22:52:12",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l6yrs3/we_are_preparing_a_class_action_lawsuit_against/",
        "Comment Count": 22427,
        "Text": "Hey everyone,\n\n&#x200B;\n\nWe all just got screwed by Robinhood's screwup here. I'm friends with a lawyer who says we have a good case for a class action lawsuit.\n\n&#x200B;\n\nEveryone comment here if you have/had shares or calls in GME held in Robinhood at market open today.\n\n&#x200B;\n\nLet's show these guys the system can't fuck with us!\n\n&#x200B;\n\nEdit:\n\nEveryone take screenshots of Robinhood's app saying you can't buy, or blocking your orders.\n\nEdit the 2nd:\n\nWheeeew lads let's get on it! I'll go through all these pms and comments this afternoon with my lawyer friend. Keep em coming!\n\nAnd please share!\n\nEdit 3:\n\nOMFG guys I'm getting 1000s of PMs! It'll take a while to sort through them all and reply, but keep messaging and sharing! Also if you were using WeBull or some other brokerage and got blocked, you might as well join too.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nEdit 4:\n\nMy team and the lawyers had a conference call, and it's on!\n\nWe'll have an update in the next 48 hours with the procedures and next steps.\n\nIf you have any questions or concerns, please PM me and I'll try to get through as many as I can once we have more details.\n\nEdit 1/30:\n\nWork is ongoing. Sorry for the lack of news, the lawyers are still getting their ducks in a row. I'll update with more info as soon as it's available.\n\n2/2 Update:\n\nJust to let everyone know where we're at, my team is currently doing the research and building the case. This is a pretty huge lift though, so we're getting people on the team with the expertise needed to give us the best chance of success. It's taking time to get the most qualified people possible, but I want to do this the right way. I hope to have another update with good news in the near future. Thanks for all of the support and encouragement!\n\nPS, sorry guys but I literally can't open my Chats now. Probably has something to do with the 8.9k next to it.... If you need to reach me you can send a Message, or leave a comment and tag my username. "
    },
    "Post 3": {
        "Title": "Robinhood will not let new options or shares be bought apparently. This is market manipulation lol",
        "Flair": "News",
        "Date Created": "01-28-2021 16:07:54",
        "Upvotes": 138944,
        "Upvote Ratio": 0.94,
        "ID": "l6w4uo",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/vboawqu6o2e61.jpg",
        "Comment Count": 15824,
        "Text": ""
    },
    "Post 4": {
        "Title": "Mark Cuban said \"once the brokerage stops restricting trades, then we'll see what WSB is really made of\". Well, guess what? Robinhood has removed all restrictions.",
        "Flair": "News",
        "Date Created": "02-05-2021 06:32:31",
        "Upvotes": 103792,
        "Upvote Ratio": 0.87,
        "ID": "lcyewd",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/lcyewd/mark_cuban_said_once_the_brokerage_stops/",
        "Comment Count": 6157,
        "Text": "Let's show them what we're made of: retards."
    },
    "Post 5": {
        "Title": "Robinhood now blocks users from getting their statements. Statements are required if you want to transfer to another broker.",
        "Flair": "News",
        "Date Created": "01-31-2021 01:47:06",
        "Upvotes": 62968,
        "Upvote Ratio": 0.96,
        "ID": "l8xv7p",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/6nbu10lctje61.jpg",
        "Comment Count": 4686,
        "Text": ""
    },
    "Post 6": {
        "Title": "Can you say \"CLASS ACTION LAWSUIT\". Fuck you RobinHood",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 16:16:43",
        "Upvotes": 86651,
        "Upvote Ratio": 0.97,
        "ID": "l6wbbj",
        "Edited?": "01-28-2021 10:39:03",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l6wbbj/can_you_say_class_action_lawsuit_fuck_you/",
        "Comment Count": 4036,
        "Text": "Edit 6: I created r/ClassActionRobinHood for people to gather around so that my reddit won't crash under the sheer force of autism that my inbox is receiving. This post was just out of frustration and memes over RHs bullshit corruption; I am not a laywer nor am I claiming that i'm going to create a class action by creating this post. You retards do as you wish, feel free to join if you want. Hell, use it as a backup in case something happens to WSB, I don't give a fuck\n\nEdit: Stop giving me these beautiful awards you retards, use the money on GME. \n\nThis is the way. 💎🙌💎. GME GANG FOREVER 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 STRAIGHT TO THE Nth DIMENSION BOYS 🚀🚀🚀🚀🚀🚀\n\nEdit 2: I will be acquiring more shares today. I have 17.7k liquid money in my TD. Bought 15 shares @327. Waiting for another dip to yolo 12.7k into the rest. I have 18 shares holding on RH with average cost of $112. 1000EOD Boys. Fuck the shorts, fuck the establishment. Melvin and friends can suck my fat diamond encrusted cock. Don't forget to leave RH a nice review on the app store thanking them for your gains\n\nEdit 3: I convinced my mother to yolo her stocks into GME early on @90. She still continues to add onto it and as of now she holds 147+ shares and is profiting well over 60k. I don't know what her cost average currently sits at but if my mother can 💎🙌💎 then so can you. She's more diamond-handed than me. Do your part brothers. We'll all be feasting on tendies from our golden plates and washing it down with Shitron tears as we wipe our asses with Melvin bucks by end of next week.\n\nEdit 4: I can't believe how much this is blowing up. I wasn't expecting it. But while I have the spotlight, I just wanted to thank every single one of you from the bottom of my heart. You tards have done absolute wonders for the community and started a financial revolution fueled by memes and autism.\n I read all these stories about how this community has helped people pay off their debts, care for sick loved ones, allowed people to give back to their local communities, and so much more. You guys are the true unsung heroes of this generation and are some of the most wholesome degenerates i've ever seen. This fight isn't about just tendies anymore, its about justice and equality, it's about sticking it to the corporate elites who run the world. Don't let these greedy scumbags take what's rightfully yours, for too long the little guy has been pushed and shoved around but now it's our time to shine. Keep up the good fight and don't back down. 💎🙌💎 for days boys, WE WILL NOT STOP UNTIL WE SEE ELON SHOOT A GME THEMED ROCKET FILLED WITH THE BURNT ASHES OF THESE BASTARDS TO MARS. FUCK SHORTS. THIS ONE IS FOR THE HISTORY BOOKS! 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 GME 5,000 IS NOT A MEME NOW. POWER TO THE PLAYERS!\n\nEDIT 5: Stop spamming me with awards and upvotes, you retards are crashing my inbox! Put forth all this glorious energy into GME.\n\n\n\n\nTL;DR: GME to 1,000 EOD, GME 5000 EONW. THE SUQEEZE HAS NOT SQUOZEN YET, BUY AND HOLD 💎🙌💎🚀🚀🚀🚀🚀🚀🚀🚀"
    },
    "Post 7": {
        "Title": "DO NOT SELL! Robinhood has blocked the buying of more shares. If you try to sell you will get fucked because who are you going to sell it to if nobody can buy it? They are trying to make you flood the market with sales offers and bring the price down. Dont fall for it!",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 16:38:34",
        "Upvotes": 109981,
        "Upvote Ratio": 0.97,
        "ID": "l6wsib",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l6wsib/do_not_sell_robinhood_has_blocked_the_buying_of/",
        "Comment Count": 4167,
        "Text": ""
    },
    "Post 8": {
        "Title": "The Hero we need right now : FUCK ROBINHOOD!",
        "Flair": "News",
        "Date Created": "01-28-2021 16:37:00",
        "Upvotes": 111406,
        "Upvote Ratio": 0.95,
        "ID": "l6wr6s",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/caa8mpqdt2e61.jpg",
        "Comment Count": 3608,
        "Text": ""
    },
    "Post 9": {
        "Title": "Robinhood is toast....Fidelity massive transfer volume",
        "Flair": "Discussion",
        "Date Created": "02-01-2021 01:59:09",
        "Upvotes": 50643,
        "Upvote Ratio": 0.97,
        "ID": "l9of92",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l9of92/robinhood_is_toastfidelity_massive_transfer_volume/",
        "Comment Count": 3738,
        "Text": "For what it's worth...\n\nThis morning I called up Fidelity because I wanted to make sure my extended hours trading was enabled on my account...took 90 minutes on hold to get through.  Apparently, they are slammed over at Fidelity, I asked the gal on the phone what's it been like today...she said because of all this stuff with Robinhood, they're looking at +700% daily volume for transferring accounts, which is quite amazing.\n\nHappy hunting! \n\nWE LIKE THE STOCK!\n\nSTICK IT TO THE MAN!"
    },
    "Post 10": {
        "Title": "Citadel reloaded their shorts before they told Robinhood to stop trading $GME",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 21:10:36",
        "Upvotes": 83959,
        "Upvote Ratio": 0.97,
        "ID": "l747eg",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://twitter.com/justinkan/status/1354853920762253315?s=21",
        "Comment Count": 3764,
        "Text": ""
    },
    "Post 11": {
        "Title": "Look ma, I’m famous! WSJ called me out for no reason in an article defending Robinhood. I don’t even margin trade! 😂 Boomer Wall St is scared and clueless 🤡",
        "Flair": "News",
        "Date Created": "02-02-2021 00:17:21",
        "Upvotes": 77402,
        "Upvote Ratio": 0.96,
        "ID": "laef86",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/jge0q26ymxe61.jpg",
        "Comment Count": 2527,
        "Text": ""
    },
    "Post 12": {
        "Title": "Robinhood still plans restrictions on $GME for Monday. You should already be signed up with a new brokerage.",
        "Flair": "News",
        "Date Created": "02-01-2021 03:25:29",
        "Upvotes": 36698,
        "Upvote Ratio": 0.98,
        "ID": "l9q60k",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reuters.com/article/us-retail-trading-robinhood/robinhood-narrows-trade-limitations-to-8-companies-from-50-blog-idUSKBN2A00VN",
        "Comment Count": 2897,
        "Text": ""
    },
    "Post 13": {
        "Title": "ROBINHOOD WILL HAVE TO BREAK INTO MY WIFE’S BOYFRIEND’S HOUSE IF THEY WANT TO FORCE ME TO SELL MY GME",
        "Flair": "YOLO",
        "Date Created": "01-31-2021 01:44:06",
        "Upvotes": 68339,
        "Upvote Ratio": 0.97,
        "ID": "l8xsxt",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/qfpvj7oisje61.jpg",
        "Comment Count": 1947,
        "Text": ""
    },
    "Post 14": {
        "Title": "Robinhood staff unhappy about the trading hault were paid off... With a $40 Doordash credit lmfao.",
        "Flair": "News",
        "Date Created": "01-29-2021 20:17:25",
        "Upvotes": 85331,
        "Upvote Ratio": 0.97,
        "ID": "l7y5ka",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/kd81m6d91be61.jpg",
        "Comment Count": 2348,
        "Text": ""
    },
    "Post 15": {
        "Title": "THIS GUY IS FLYING A BANNER SAYING \"SUCK MY NUTS ROBINHOOD\"",
        "Flair": "News",
        "Date Created": "01-30-2021 21:08:16",
        "Upvotes": 111248,
        "Upvote Ratio": 0.97,
        "ID": "l8rlyx",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/gallery/l8rlyx",
        "Comment Count": 1887,
        "Text": ""
    },
    "Post 16": {
        "Title": "Days ago, Robinhood had the potential to be a major brokerage and a top IPO. Now there's a significant chance they won't survive",
        "Flair": "News",
        "Date Created": "01-31-2021 06:27:41",
        "Upvotes": 39412,
        "Upvote Ratio": 0.98,
        "ID": "l93dum",
        "Edited?": "01-31-2021 03:45:44",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l93dum/days_ago_robinhood_had_the_potential_to_be_a/",
        "Comment Count": 2600,
        "Text": "Bringing **millions** of new agents into the market, disrupting the whole industry with commission-free trading, an intuitive UI that any ape like us can use, becoming the #1 downloaded app across most app stores...\n\nWithout Robinhood, this whole thing probably wouldn't have happened and WSB would likely be stuck at 100k subscribers like it was 3-4 years ago. Because lets face it, a hugee percent of WSB use(d) Robintard because we're too low-functioning to use brokerages that use >4 syllable phrases like \"money market fund\" or \"moving average\"\n\nSomething like this happening right before going public was **GOLDEN** for them. All they had to do was not be a corrupt sellout bitch, keep their huge influx of new users happy, and they would've been set to come out of this a more respectable, even larger brokerage, as well as a high-value public company.\n\nInstead they decided to expose the raw underbelly of their shitty business model and go exactly against their entire mission statement. Even if capital/margin requirements was the reason for the restrictions (it was definitely a factor but protip: it wasn't the full story), it doesn't change anything about the end result. Who the fuck wants to use a BROKErage who can't guarantee functionality during historical black swan events that usually result in the largest transfer of money? And then, **even if** they can't maintain capital requirements to execute trades, they could have handled it better. Just fucking pull the money from somewhere. Take out a huge loan from somebody ASAP. You can always get instant money if you don't give a fuck about interest rates, which they shouldn't because it's short-term and like I said, it would've been **HUGE** for the future of the company. Another one, they could have restricted both buying &amp;amp; selling of the trending tickers, or just go down altogether (RH users are very familiar with the app being down and losing full functionality, why is this time any different?). Yeah it would've sucked but at least it would've fucking stayed consistent with their mission statement of fair, democratic trading for all. I fuckin work at Wendy's and I can still imagine several better alternatives than the BS \"difficult solution\" they did.\n\nAnd speaking of their mission statement, it's complete BS. It's just a sugarcoated way of saying \"lol we allow poor people to trade and have pretty colors\". They clearly don't give a shit about DeMoCrAtIzInG tRaDiNg FoR aLl. Because if they did, their business model wouldn't have been a Wall Street megacorp keeping the lights on by frontrunning user trade data.\n\nAnd yeah another reason why \"volatiilty\" and \"trade volume\" excuses are BS is because they **increased** restrictions on Friday when both volume and volatility **decreased** lmfao. Screw this POS jokerage.\n\nEdit: And the lawsuits up the ass. They just finished a $65m SEC settlement **LAST MONTH**, think their rainy day fund is big enough to handle something like this immediately after? Lmao gl\n\n\nEdit: Tbh this fuckery was such a double win for Citadel because they get to force RH to manipulate the market while also signing their death note, which for Citadel means less retail investors....\n\n\n#FUCK YOU ROBINTARD. YOU CAN'T STOP US FROM LIKING THE STOCK🚀🚀🚀🚀🚀🚀"
    },
    "Post 17": {
        "Title": "Good Morning to Everyone Except Robinhood, courtesy of @KasparCMS on Twitter",
        "Flair": "Meme",
        "Date Created": "01-30-2021 21:07:36",
        "Upvotes": 113225,
        "Upvote Ratio": 0.98,
        "ID": "l8rlea",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://v.redd.it/tzn8jw52fie61",
        "Comment Count": 1293,
        "Text": ""
    },
    "Post 18": {
        "Title": "Google helps Robinhood after swarm of negative reviews drops company to 1-star rating. Fuck Google and Robinhood",
        "Flair": "Discussion",
        "Date Created": "01-30-2021 17:27:29",
        "Upvotes": 36687,
        "Upvote Ratio": 0.95,
        "ID": "l8ms73",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.foxbusiness.com/technology/google-robinhood-reviews",
        "Comment Count": 1972,
        "Text": ""
    },
    "Post 19": {
        "Title": "Robinhood Is Lying - You Are Blocked Acquiring More Than 5 Total Shares",
        "Flair": "News",
        "Date Created": "01-29-2021 14:11:53",
        "Upvotes": 33662,
        "Upvote Ratio": 0.99,
        "ID": "l7q1et",
        "Edited?": "01-29-2021 14:07:55",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l7q1et/robinhood_is_lying_you_are_blocked_acquiring_more/",
        "Comment Count": 1788,
        "Text": "Vlad, CEO of RH and chief mod at r/cuckold, went on national news outlets last night and swore RH would open trading of GME. \n\nThat is not entirely true. \n\nRH is allowing anyone with ZERO shares of GME to buy up to 5.  Anyone with currently less than 5 shares can buy more up to a total portfolio of 5 shares.  Anyone with more than 5 shares can not purchase shares. \n\nThis is important because these fuck clowns know that those of us carrying greater numbers of stock likely have the capacity to buy greater numbers of GME shares and reduce liquidity. \n\nThey are simultaneously:\n1)  manipulating the system\n2) taking advantage of people with less funds\n3) preventing a greater number of shares from being purchased\n\nThey did this so they could have a talking point in the media and during their congressional investigations and say “We reopened stock purchase of GME” and nobody will dig deeper. \n\nThis is fucking dirty ass pool and fucking outright manipulation. \n\nHere’s the video proof:  https://imgur.com/a/AV3IGMa\n\nEdit: and yes.  I do have other brokerage accounts and those are working fine. Shout out to my homies at SoFi, Fidelity, and Vanguard. I have GME stashed in those accounts too.\n\nEdit 2: I’m not giving a pass to those fucks at other brokers too. Thomas “The Shit Engine” Fluffer at IBKR can eat a bag of fucking rotten cocks too.  Saying GME is worth $17 and the stock should be restricted until it drops to $17 because it’s overvalued.  Fuck you Fluffer. You know what’s overvalued at $17? Your shitty blowjobs. You give really shitty head you old lemon party fuck. ^no ^homo\n\nEdit 3: RH has now dropped the shares you can buy to 2 shares. If you hold more than 2 shares you can not buy shares.  Go use another broker.  Fuck IBKR, Fuck RH and fuck the hedge funds and brokers.  They are gaming this entire thing.  Go ahead share this post with anyone not on reddit.  Everyone needs to know they are being bent over and violated without lube.  Market got caught doing retarded shit (shorting over 200% of GME) and now we all are suddenly the retards.  GO GET FUCKED Vlad the Cock Impaler and Thomas Fluffer and all of you fuck clowns.\n\nEdit 4: Dear SEC - When GME was trading and trending above $350 is when RH and others dropped the share buy limit to 2 shares.  This is coordinated and planned manipulation.  $350 matters because if GME continues to trade consistently above $350 then gamma squeeze occurs for todays closing options.  This is coordinated and premeditated manipulation.\n\nHere’s the proof of the new 2 share limit: https://i.imgur.com/RhwgoRu.jpg\n\n#Edit 5: I made a comment that RH was stealing a share from my account.  We all have moments of retardation.  Some of us, like me, dwell in the retard.  I was wrong and I appreciate other redditors pointing out my mistake.  I've delete the comments and posts I made elsewhere.  RH has done enough shit wrong but disinformation, unintentional or not, is not what we are about.  I apologize for the honest mistake.  But fuck RH, IBKR, and the hedge funds anyway.  Nothing changes.\n\n#I'm NOT FUCKING SELLING.\n\n#Edit 6: RH is now down to allowing a single share.  Thanks u/shithawks_circling for posting your image - https://imgur.com/a/BRDyxA0"
    },
    "Post 20": {
        "Title": "I used to work @ Merrill. Here's what likely happened today with Robinhood and what it means for short-squeezing investors",
        "Flair": "DD",
        "Date Created": "01-29-2021 04:57:42",
        "Upvotes": 20593,
        "Upvote Ratio": 0.96,
        "ID": "l7fw0x",
        "Edited?": "02-02-2021 00:57:27",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l7fw0x/i_used_to_work_merrill_heres_what_likely_happened/",
        "Comment Count": 2315,
        "Text": "I just wanted to throw this out there in the middle of the outrage, in the hopes that someone can take it in and strategize, rather than be upset. Worked @ Merrill as an analyst from ** - **.\n\nI also like to keep it concise so follow along. This ain't a fucking Qanon fan fiction.\n\nDisclaimer: I own GME. This is not financial advice. This is just some dude chatting with his old buddies.\n\n---------------------------------------------------------\n1) **Robinhood, restrictions, suppression**: \n\nWhen you place an order through RH, Citadel or some other HFT front runs your trade and pockets the spread; However, the transaction is not complete.\n\nEnter: Clearing house. The clearing house is the intermediary between the counter-parties. Because they stand between sellers & buyers, they have very defined levels of risk, risk management and regulation to be in front of.  The clearing house is who gives you the \"title\" for your shares, the folks who make it official.\n\n**What Likely Happened**: The risk department retard @ the clearing house, who does jack shit all year other than flag Stacy's trade so he can get some face time with her runs to the C-Suite frazzled; He has looked at option open interest expiring this week, has done the math and there simply isn't enough float for GME in anyway, shape or form; turns out WSB is printing out their stock certificates and burying them in the Mojave Desert. It's simply not enough.\n\nIn addition, they got a Snapchat from SEC/OCC which said hey, if you fucking keep selling open positions, you're on your own; we ain't gonna help you. SEC is sneaky like that; they like sending messages through the backdoor, not the front because they used to be hedgies themselves. If you're not following, Front door is making a public statement while the backdoor is a threat sent to an intermediary who you and millions of investors don't even know exists.\n\nSo, they call up the risk department at RH and tell em to stop fucking selling GME, there simply isn't enough float, the SEC told the clearing house they're on their own and who tf is gonna take the blame/liability if there's a \"failure to deliver\"? \n\n---------------------------\n\n2) **Failure to Deliver**:\n\nThis is a pretty big deal because it's basically a slam-dunk law suit. \n\nFailure to deliver means that one of the counterparties (in this case, the firm who sold you the option, RH or the clearing house) has failed to deliver you a contractually obligated position, profit or certificate. Since there's no float and ITM calls get exercised by HFT bots at the end of the day, how in the fucking hell are they gonna deliver the option holders their contractually obligated merchandise if there is no merchandise to be delivered? There simply isn't enough for everyone. \n\nIt has been on the FTD list for a month already. Thousands (or possibly hundreds of thousands) of failures to deliver =  big risk\n\n\n---------------------------\n\n3) **Liability**: \n\nYou must be asking so what? Fuck them; They should be the ones figuring it out and they gotta give me, the customer, the right to choose or whatever the fuck; That sounds great in a boomer fashion but it's not that simple. Robinhood is contractually obligated to deliver you those shares or positions. If they fail to, they become liable for any losses or profits that you may have endured and they will LOSE in court cause they FAILED to DELIVER. How many people have options on GME on RH? Half? Imagine if half of these fine RH customers were legally owed benefits and they were engaged in DDoS style lawsuits involving Robinhood or the clearing house. There would be no Robinhood left. There would likely be no clearing house left. \n\nRobinhood is also a shitshow of a company, so they likely didn't even have additional collateral to put up to the clearing house for normal share buying and selling on the meme tickers and since they bank with T-Mobile, they had to pull the plug. This lack of collateral from Robinhood is important to note because the \"music\" never stops, trading low float/volatile shares just becomes much more collateral heavy on the side of the broker.\n\nHence: Bad Decision > Bankruptcy or worse (WSB finds Vlad's mom and becomes her boyfriend collectively)\n\n\nI personally don't believe it was out of malice or a coordination for RH; there's definitely coordination all around, but occam's razor says this is not such an ordeal.\n\n---------------------------\n\n\nCouple of semi-related notes:\n\n-Fuck Billionaires. Parasites of modern society, simply existing to leech off every slurp of alpha and take up resources meant for billions of poor people. Something is needed. Whatever is needed to discourage hoarding of resources of this tiny fucking planet.\n\n-I very much doubt that Ken Griffin and Citadel (the HF) would engage in blatant market manipulation or coercion of Robinhood or other brokers to make a few bucks on Gamestop or AMC. They cleared over 6 billion net last year, so just logically, it seems pretty unlikely to risk it for this. It is also very unlikely that Citadel Securities would engage in illegal behavior for the profit of Citadel, simply because it's such a money maker. If you were an evil genius, would you let your money maker go to shit because you were getting squeezed on some short?\n\n-The media just wants clicks and engagement, so they will bring the worst people on, simply to pad their own bottom line. Don't get engaged. Don't give in to them. Be the captain of your own ship and fuck over wall-street however you please.\n\n-The restrictions on the others tickers is likely proactive, not reactive. \n\n- **TL;DR**: There's simply not enough float and the broker/clearing house will fail to deliver on a large scale if they keep letting new positions be opened, hence restrictions.\n\n- **What will happen now**:Based on my previous short squeezes, Friday (tomorrow) will be nuts; All this gamma has to go somewhere and since there's not enough float, I'm guessing up.\n\nedit (2/1/21): Thanks for all the awards. I exited on Fri open. Now GME is likely in a holding pattern to crush IV. Best of luck to everyone."
    },
    "Post 21": {
        "Title": "ROBINHOOD HAS RESTRICTED $GME DOWN TO 1 SHARE! DO NOT SELL! YOU CANNOT BUY BACK IN!",
        "Flair": "News",
        "Date Created": "01-29-2021 22:23:58",
        "Upvotes": 41816,
        "Upvote Ratio": 0.98,
        "ID": "l81j55",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/anwlmd17obe61.jpg",
        "Comment Count": 1787,
        "Text": ""
    },
    "Post 22": {
        "Title": "Yahoo Finance calling it: \"Robinhood is toast after GameStop backlash\"",
        "Flair": "News",
        "Date Created": "02-02-2021 15:22:29",
        "Upvotes": 35884,
        "Upvote Ratio": 0.97,
        "ID": "laubr4",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://finance.yahoo.com/video/robinhood-toast-gamestop-backlash-real-221914172.html?bye_vlad=1",
        "Comment Count": 1469,
        "Text": ""
    },
    "Post 23": {
        "Title": "I Pledge to Delete RobinHood After The Great Rise. Who’s With Me?",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 18:55:12",
        "Upvotes": 31835,
        "Upvote Ratio": 0.99,
        "ID": "l70fzw",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l70fzw/i_pledge_to_delete_robinhood_after_the_great_rise/",
        "Comment Count": 1737,
        "Text": "Let’s show them how many of their traders are out. These fuckers are set to IPO this year, fools. Who’s trading data are you gonna sell if all of us leave? Shilling out to big money was the worst financial mistake of your pathetic wanna-be corps life. I’m out, but I’m not selling on RH until it’s motherfucking done. Collect tendies and your tax information and split. Who’s with me? \n\nGME 5000 is not a meme.\n\nI am not a financial advisor 🚀"
    },
    "Post 24": {
        "Title": "It's happening in Australia now. STAKE is pulling a Robinhood and not allowing buys in $GME, $AMC & $NOK!!",
        "Flair": null,
        "Date Created": "02-02-2021 12:09:56",
        "Upvotes": 25317,
        "Upvote Ratio": 0.98,
        "ID": "larmtn",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://hellostake.com/au/stake-updates/understanding-trading-suspensions/",
        "Comment Count": 1370,
        "Text": ""
    },
    "Post 25": {
        "Title": "In Case There Was Any Doubt. Look At How Much The Hedge Funds Appreciate How Robinhood Fucked The Little Guys. $3.4bn In NEW Financing.",
        "Flair": "News",
        "Date Created": "02-04-2021 03:54:46",
        "Upvotes": 23820,
        "Upvote Ratio": 0.96,
        "ID": "lc3b9i",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/abl4buxqzcf61.jpg",
        "Comment Count": 1112,
        "Text": ""
    },
    "Post 26": {
        "Title": "Watch Cuomo crucify Robinhood CEO Vlad",
        "Flair": "News",
        "Date Created": "01-29-2021 06:10:36",
        "Upvotes": 20633,
        "Upvote Ratio": 0.97,
        "ID": "l7hh6h",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://twitter.com/cuomoprimetime/status/1354989746158784514?s=21",
        "Comment Count": 1572,
        "Text": ""
    },
    "Post 27": {
        "Title": "RobinHood CEO when responding to Chris Cuomo on why he shut down trading of GME and AMC",
        "Flair": "Meme",
        "Date Created": "01-29-2021 15:31:04",
        "Upvotes": 54128,
        "Upvote Ratio": 0.98,
        "ID": "l7rdlq",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://v.redd.it/33lscffgm9e61",
        "Comment Count": 963,
        "Text": ""
    },
    "Post 28": {
        "Title": "Elon just called out Robinhood on Clubhouse 😂",
        "Flair": "News",
        "Date Created": "02-01-2021 10:22:38",
        "Upvotes": 28783,
        "Upvote Ratio": 0.97,
        "ID": "l9xkny",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/u5j110j8ite61.jpg",
        "Comment Count": 879,
        "Text": ""
    },
    "Post 29": {
        "Title": "Robinhood Announces You Can No Longer Open GME/AMC Positions For Friday. 😱",
        "Flair": "News",
        "Date Created": "01-28-2021 09:03:42",
        "Upvotes": 10300,
        "Upvote Ratio": 0.98,
        "ID": "l6plv0",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/mmmfe3bik0e61.jpg",
        "Comment Count": 2248,
        "Text": ""
    },
    "Post 30": {
        "Title": "PETITION TO REMOVE ROBINHOOD FROM APP STORE",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 21:08:39",
        "Upvotes": 54606,
        "Upvote Ratio": 0.94,
        "ID": "l74653",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://chng.it/zHWwV8d5hc",
        "Comment Count": 834,
        "Text": ""
    },
    "Post 31": {
        "Title": "Stop reposting the obviously fake screenshot from a robinhood \"insider\"",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 22:53:11",
        "Upvotes": 34096,
        "Upvote Ratio": 0.98,
        "ID": "l76t20",
        "Edited?": "01-29-2021 02:13:42",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l76t20/stop_reposting_the_obviously_fake_screenshot_from/",
        "Comment Count": 861,
        "Text": "WE ARE UNDER A COORDINATED SOCIAL ATTACK IN AN ATTEMPT TO DISCREDIT WSB. There's a screenshot floating around from a \"robinhood insider\" (u/odin19199, sporting a lovely new user badge) who claimed that they \"overheard\" executives get calls from the white house and whoever the fuck else telling them to shut down GME. I have seen this 69 times today.\n\nHow stupid are people that they can actually believe this? YEAH when I'm talking over collusion and market manipulation with the fucking white house I make sure all my IT people can hear me. YEAH totally normal for low-level people to know the intimate details of highly-sensitive conversations.\n\nI can literally make a post right now that suggests your mom traded a cut of that ass to robinhood to restrict buying gme and it would be just as credible. Hell it's even more plausible\n\nMAKE NO MISTAKE, THIS IS ANOTHER ATTACK. this post is getting spammed to drum up the narrative that this is an alt-right movement, by targeting the white house as the instigator of these holds. If this becomes viral, if we buy into this and start this whole conspiracy based on a single anonymous redditor, we will be forever associated with another qanon conspiracy. we'll be irrelevant in a week.\n\nJUST FUCKING HOLD. NONE OF THIS BULLSHIT MATTERS. HOLD.\n\nEdit: just wanted to be clear - just because something CAN happen does not mean that it DID happen. Sure there is a hypothetical way the US government did this and someone overheard it. Yes, on some level, whether active or systemic, the government is involved. But isn't it more likely these firms, with an incredible incentive to disenfranchise us from the public, made a reddit account and wrote this fanfic for the total cost of $0?"
    },
    "Post 32": {
        "Title": "Make sure to file a complaint to SEC about Robinhood Market manipulation",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 16:31:50",
        "Upvotes": 39144,
        "Upvote Ratio": 0.99,
        "ID": "l6wmwx",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.sec.gov/complaint/select.shtml",
        "Comment Count": 847,
        "Text": ""
    },
    "Post 33": {
        "Title": "Literally ONE MONTH AGO, SEC Charged Robinhood Financial With Misleading Customers About Revenue Sources and Failing to Satisfy Duty of Best Execution",
        "Flair": "News",
        "Date Created": "01-30-2021 10:17:32",
        "Upvotes": 27486,
        "Upvote Ratio": 0.99,
        "ID": "l8gffc",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "http://www.sec.gov/news/press-release/2020-321",
        "Comment Count": 787,
        "Text": ""
    },
    "Post 34": {
        "Title": "Doing my part as a broadcaster to tell the truth about Robinhood and their manipulation....",
        "Flair": "News",
        "Date Created": "01-29-2021 18:48:27",
        "Upvotes": 40457,
        "Upvote Ratio": 0.97,
        "ID": "l7vtsi",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/osr4llxplae61.jpg",
        "Comment Count": 744,
        "Text": ""
    },
    "Post 35": {
        "Title": "Robinhood looking to hire government affairs staffers to navigate their impending congressional hearings",
        "Flair": "News",
        "Date Created": "01-29-2021 18:32:03",
        "Upvotes": 38215,
        "Upvote Ratio": 0.99,
        "ID": "l7vf3i",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/02rfuqjtiae61.jpg",
        "Comment Count": 869,
        "Text": ""
    },
    "Post 36": {
        "Title": "Please give the RIGHT Robinhood hate! This is a charity guys!",
        "Flair": null,
        "Date Created": "01-28-2021 21:50:06",
        "Upvotes": 52126,
        "Upvote Ratio": 0.96,
        "ID": "l751qz",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/vykx76n4d4e61.jpg",
        "Comment Count": 624,
        "Text": ""
    },
    "Post 37": {
        "Title": "Are you a Robinhood employee and looking for QUICK TENDIES? Get $5.5 million on average as whistleblower!",
        "Flair": "Discussion",
        "Date Created": "01-30-2021 01:16:01",
        "Upvotes": 31703,
        "Upvote Ratio": 0.99,
        "ID": "l85xk8",
        "Edited?": "01-29-2021 22:25:27",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l85xk8/are_you_a_robinhood_employee_and_looking_for/",
        "Comment Count": 669,
        "Text": "Edit: You're god damn right autists we won't let the stock market get Ajit Pai'ed!\n\n'The SEC has awarded more than $738 million to 134 individuals since issuing its first award in 2012.  All payments are made out of an investor protection fund established by Congress that is financed entirely through monetary sanctions paid to the SEC by securities law violators.  No money has been taken or withheld from harmed investors to pay whistleblower awards. Whistleblowers may be eligible for an award when they voluntarily provide the SEC with original, timely, and credible information that leads to a successful enforcement action. Whistleblower awards can range from 10 to 30 percent of the money collected when the monetary sanctions exceed $1 million.'\n\nSee [sec.gov/whistleblower](https://sec.gov/whistleblower) for more information"
    },
    "Post 38": {
        "Title": "Robinhood needed emergency $1 Billion cash injection, but was too embarrassed to admit it",
        "Flair": "News",
        "Date Created": "01-29-2021 20:05:39",
        "Upvotes": 19541,
        "Upvote Ratio": 0.99,
        "ID": "l7xu5k",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://daringfireball.net/linked/2021/01/29/robinhood-cash-injection",
        "Comment Count": 786,
        "Text": ""
    },
    "Post 39": {
        "Title": "No bitch only you restricted trading . This is from the robinhood daily email.",
        "Flair": "News",
        "Date Created": "01-29-2021 16:17:24",
        "Upvotes": 31710,
        "Upvote Ratio": 0.96,
        "ID": "l7sadp",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/9zmgd8jsu9e61.jpg",
        "Comment Count": 618,
        "Text": ""
    },
    "Post 40": {
        "Title": "Listen up, when Elizabeth Warren says on live national TV that she’s “looking forward” to talking to the RobinHood CEO in a hearing for the committee she chairs, you fucking hold",
        "Flair": "Discussion",
        "Date Created": "01-31-2021 20:49:37",
        "Upvotes": 13046,
        "Upvote Ratio": 0.96,
        "ID": "l9hiza",
        "Edited?": "01-31-2021 16:49:37",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l9hiza/listen_up_when_elizabeth_warren_says_on_live/",
        "Comment Count": 875,
        "Text": "She gave a great interview on CNN around 1230p EST w Dana Bash. Try and watch it. Monday is only the beginning of this, and the new political order seems to want to see the HF suffer. \n\nEW says 💎🙌🏻\nDFV is holding \nYour fellow WSBs and allies are holding (even r/askgaybros is with us 🏳️‍🌈). Incredible international support. \n\nIt’s about more than money at this point. \n\nWe are literally the force behind the upcoming changes to the boomer’s system. \n\nOne can hope it will be more equitable for retail traders going forward, and for generations to come. \n\n💎🙌🏻👨🏻‍🚀🚀\n\nI’m an idiot.\nEdit: I’m a naive idiot with 💎🙌🏻 ALL THE SAME TEAM\n\nEdit 3: thank you for the kind awards, strangers"
    },
    "Post 41": {
        "Title": "AOC calling out Robinhood",
        "Flair": "News",
        "Date Created": "01-28-2021 19:51:46",
        "Upvotes": 37607,
        "Upvote Ratio": 0.97,
        "ID": "l7225e",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/n7ark4l4s3e61.jpg",
        "Comment Count": 539,
        "Text": ""
    },
    "Post 42": {
        "Title": "Me at my job interview after I just watched The Big Short and got banned from Day Trading in RobinHood",
        "Flair": "Meme",
        "Date Created": "01-31-2021 17:01:53",
        "Upvotes": 29689,
        "Upvote Ratio": 0.96,
        "ID": "l9cu64",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://v.redd.it/0i1yw8ppboe61",
        "Comment Count": 413,
        "Text": ""
    },
    "Post 43": {
        "Title": "As a rebuke to Robinhood, I will be withdrawing all of my funds (I did not buy GME)",
        "Flair": null,
        "Date Created": "01-28-2021 22:07:05",
        "Upvotes": 13332,
        "Upvote Ratio": 0.99,
        "ID": "l75j1p",
        "Edited?": "01-28-2021 14:08:01",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l75j1p/as_a_rebuke_to_robinhood_i_will_be_withdrawing/",
        "Comment Count": 725,
        "Text": "I did not buy GME, but am still pissed off at Robinhood for it harming all of you by pandering to hedge funds.\n\nRobinhood turned on its customer base today. As a result, I will be withdrawing everything. This is a substantial sum ($260k). It will result in taxes for me, but I am fed up with Robinhood‘a actions. There is only one thing that will teach Robinhood who their customers really are, and that is if I react to their bad behavior by withdrawing my funds.\n\nGoodbye Robinhood."
    },
    "Post 44": {
        "Title": "Robinhood won’t let me buy 1 share of GME?!",
        "Flair": "News",
        "Date Created": "01-28-2021 15:07:13",
        "Upvotes": 10838,
        "Upvote Ratio": 0.98,
        "ID": "l6v2mh",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/s3zrbw0dd2e61.jpg",
        "Comment Count": 824,
        "Text": ""
    },
    "Post 45": {
        "Title": "🚨 Robinhood slims restricted list to 8 stocks, but users can still only buy 1 share of GameStop - MAKE SURE YOU HAVE OTHER BROKERS 🚀🚀",
        "Flair": "News",
        "Date Created": "02-01-2021 03:39:37",
        "Upvotes": 9504,
        "Upvote Ratio": 0.99,
        "ID": "l9qfsf",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.marketwatch.com/story/robinhood-slims-restricted-list-to-8-stocks-but-users-can-still-only-buy-1-share-of-gamestop-11612139243",
        "Comment Count": 580,
        "Text": ""
    },
    "Post 46": {
        "Title": "ROBINHOOD HAS BEEN SUED! OTHERS TO FOLLOW!!!",
        "Flair": "News",
        "Date Created": "01-28-2021 20:53:33",
        "Upvotes": 34350,
        "Upvote Ratio": 0.99,
        "ID": "l73tdc",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/xij6rz1334e61.jpg",
        "Comment Count": 382,
        "Text": ""
    },
    "Post 47": {
        "Title": "Citadel has blocked all trading partners (Such as Robinhood) to trade GME, BB and others. As over 40% of all trades in the US market are via Citadel, they are artificially limiting the supply balance to reduce these stocks in their favour.",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 16:54:15",
        "Upvotes": 18660,
        "Upvote Ratio": 0.99,
        "ID": "l6x5b8",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l6x5b8/citadel_has_blocked_all_trading_partners_such_as/",
        "Comment Count": 489,
        "Text": "This is both blatant market manipulation and morally abhorrent. WSB should bring a gofundme to crowdsource funding for a class action lawsuit against Citadel, calling for market makers to be permanently banned from having a vested interest in any one company or stock."
    },
    "Post 48": {
        "Title": "Lawsuits against Robinhood since last week",
        "Flair": "Chart",
        "Date Created": "02-03-2021 22:19:34",
        "Upvotes": 11318,
        "Upvote Ratio": 0.99,
        "ID": "lbvnxi",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/zbmh1lfvbbf61.png",
        "Comment Count": 418,
        "Text": ""
    },
    "Post 49": {
        "Title": "ROBINHOOD GME SHARE LIMIT INCREASED TO 500 TOMORROW",
        "Flair": "News",
        "Date Created": "02-04-2021 06:03:12",
        "Upvotes": 7828,
        "Upvote Ratio": 0.97,
        "ID": "lc5w6v",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/j6g3w6pomdf61.jpg",
        "Comment Count": 454,
        "Text": ""
    },
    "Post 50": {
        "Title": "These were all the stocks that Robinhood blocked: $GME $KOSS $AMC $NOK $BB $BBBY $VIR $GNUS $AAL $NAKD",
        "Flair": "YOLO",
        "Date Created": "01-29-2021 06:32:42",
        "Upvotes": 3611,
        "Upvote Ratio": 0.99,
        "ID": "l7hywo",
        "Edited?": "01-28-2021 23:22:38",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l7hywo/these_were_all_the_stocks_that_robinhood_blocked/",
        "Comment Count": 856,
        "Text": "These are my only watchlist tomorrow. These should be your only watchlist tomorrow. It’s payback time. Robinhood will pay! BUY, HOLD, BUY THE DIP, HOLD 💎 🚀 🙌\n\nStock market is as simple as supply and demand. We cut the supply by buying and holding. They’ll have to jack the price up.\n\nI forgot to add $EXPR $SNDL\n\nDisclaimer:  I’m not a financial advisor. I’m not licensed to give any advise. I don’t take money. Don’t listen to me. This is for entertainment purposes only. 🌚 🌝"
    },
    "Post 51": {
        "Title": "DON'T LET ROBINHOOD BECOME THE SCAPEGOAT. This goes deeper -- CITADEL fulfills most of Robinhoods orders. THEY ARE THE ONES CANCELLING WSB.",
        "Flair": "News",
        "Date Created": "01-28-2021 18:37:58",
        "Upvotes": 29108,
        "Upvote Ratio": 0.99,
        "ID": "l6zyx6",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/b1zoa2zzd3e61.png",
        "Comment Count": 337,
        "Text": ""
    },
    "Post 52": {
        "Title": "Robinhood App Hit With Class Action Suit After Trying to Shut Down GameStop Uprising",
        "Flair": "News",
        "Date Created": "01-28-2021 20:52:47",
        "Upvotes": 18834,
        "Upvote Ratio": 0.99,
        "ID": "l73ska",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://news.yahoo.com/robinhood-app-hit-lawsuit-trying-172304118.html",
        "Comment Count": 304,
        "Text": ""
    },
    "Post 53": {
        "Title": "I bought the maximum allowed by robinhood (spent $12,198 for all 100). I am gonna HOLD with you fine folks.",
        "Flair": "Donation",
        "Date Created": "02-02-2021 21:51:30",
        "Upvotes": 11770,
        "Upvote Ratio": 0.98,
        "ID": "lb380s",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/oqi6p9r124f61.jpg",
        "Comment Count": 307,
        "Text": ""
    },
    "Post 54": {
        "Title": "I just finished transferring from Robinhood to Fidelity.",
        "Flair": "Discussion",
        "Date Created": "02-04-2021 14:23:49",
        "Upvotes": 4748,
        "Upvote Ratio": 0.98,
        "ID": "lcdnmk",
        "Edited?": "02-04-2021 10:49:31",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/lcdnmk/i_just_finished_transferring_from_robinhood_to/",
        "Comment Count": 351,
        "Text": "I began this process late on Saturday night (31Jan) and as of this morning (4Feb) it has completed. \n\nThis is far quicker than I was expecting. This is quicker than Fidelity was expecting. They gave me an estimate of completion by the 8Feb. \n\nI'm saying this to encourage those who were afraid of transferring out of Robinhood that it doesn't take forever. \n\nTransferring from robinhood is a fantastic idea, especially with them having done shady shit. \n\nTo all my fellow smooth brains I wish you the best of luck in whatever stocks you purchase and hold. May the moon be within reach and your journey through the cosmos commence. 🚀🚀🚀\n\nI have 67 shares GME, 20 AMC, 86 NOK.\n\n\nEdit: I wrote 8Jan the first time instead of 8Feb.\n\nEdit Edit: Everyone has different experiences. Please take this into consideration if you decide to transfer.\n\nEdit Edit Edit: coins don't transfer. I use AnchorUSD. I dunno how good they are compared to others but they do the dog coins and other coins. This post will get deleted if it says anything about the actual word of this currency.\n\nEdit Edit Edit Edit: I am a moron this is not financial advice.\n\nEdit Edit Edit Edit Edit: Google how to set up real time quotes as well."
    },
    "Post 55": {
        "Title": "Well Robinhood, I don't know how many tendies the funds paid you, but for your sake it better have been at least a 20pc mcnuggets",
        "Flair": "News",
        "Date Created": "01-28-2021 20:56:02",
        "Upvotes": 17781,
        "Upvote Ratio": 0.99,
        "ID": "l73vqk",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/qgsn8rhl34e61.png",
        "Comment Count": 352,
        "Text": ""
    },
    "Post 56": {
        "Title": "ROBINHOOD I hope you read this.",
        "Flair": "Discussion",
        "Date Created": "01-30-2021 16:17:07",
        "Upvotes": 3883,
        "Upvote Ratio": 0.98,
        "ID": "l8li51",
        "Edited?": "01-30-2021 23:13:26",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l8li51/robinhood_i_hope_you_read_this/",
        "Comment Count": 623,
        "Text": "Dear Robinhood,\n\nDue to your actions last week you forced many of us to make a decision of what platforms we will be using to trade from in the future. I personally moved all of my funds from RH to another platform. What you may not realize is that there are a LOT of people who did this as well. All of my funds will become available to trade with on Monday morning as I'm sure many other peoples will be too. \n\nYou fucked yourself and your friends... as come Monday morning will be a whole lot more capital ready to be reivested in GME, AMC, NOK, BB and what ever the fuck other stocks I LIKE.\n\nI LIKE THIS STOCK, I LIKE THIS COMPANY, I LOVE RYAN COHEN and FUCKING LOVE MY FELLOW RETARDS. We are not just lowly elite, we are the SUPER ELITE. \n\nAPES STRONG TOGETHER\n\nALL SHARES MATTER\n\nCan't Stop, Won't Stop, GameSTONK!\n\nEdit: 💎💎💎👐 GME GANG Going to fucking ANDROMEDA 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍\n\nEdit 2: It seems some people are still asking if its too late to buy. I value this stock at $4206.90 and that's what I'm willing to walk away with. I'm not a financial advisor and this is not financial advice. With that being said... a life with out taking risks is a life having to wear a condom EVERY FUCKING TIME while you continually pound Melvin's Ass.\n\nEdit 3: Next step.... we reached 320 this week and that was our target. Congrats all my fellow degenerates as we held the line. As you can see they are now offering up to 800 on next week's options. That's our next target. The squeeze could happen or it may not happen next week but we have a target in sight. They are trying to do everything in their power to suppress our valuation. Hold strong autists. We set the price. Prediction: GME opens Monday 500+ and we continue on our mission.\n\nEdit 4: A lot of people are asking me questions about what happened. I was trading GME since Jan 11th as a broke ass bitch, I threw in $200 played a nice $26 call before we spiked to 32 I was excited and cashed out to turn that into 30 shares of GME and hedged my way up to 55 shares over the following weeks. Im not rich, I think I just played this right move.\nNow here's what happened on Thursday... The Robinhood app blocked me from buying so my plan was to do a hedge on multiple platforms. Sell half on RH and rebuy after the inevitable ladder attack on my Webull account and then transfer my money there as well from RH. When I sold on RH they literally sold ALL of my shares not just my available shares since the others were locked up in limit sells. I panicked after that happened. And bought in as many as I could on my low funded Webull account. So I had to essentially sit out for the day. Friday full RH transfer hit my account and I set up a new account.\nAtleast I sold at around 380 and was able to buy back in below that. I owe about 70k in medical debt and GME gave me a chance at making up some of that, I'm +25k on a $200 investment, I need this. You need this. We all need this.\n\nEdit 5: now I'm hearing a lot about people talking about possibly missing the short squeeze if they transfer. In all honestly do you fucking care at this point? I don't. I'm all in and have literally put every dime I possiy could on GME I don't really give a shit about it. We are making these cunts bleed out. And if something at some point hits my sell limit I'll be happy, but if it doesn't I don't care because I KNOW THAT I DID THE RIGHT THING."
    },
    "Post 57": {
        "Title": "RASHIDA TLAIB SAYS THAT CONGRESS NEEDS TO HAVE A HEARING ON ROBINHOOD'S MARKET MANIPULATION",
        "Flair": "News",
        "Date Created": "01-28-2021 18:38:44",
        "Upvotes": 14598,
        "Upvote Ratio": 0.98,
        "ID": "l6zzr1",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/jtdl95vwe3e61.png",
        "Comment Count": 344,
        "Text": ""
    },
    "Post 58": {
        "Title": "We were the best advertising for Robinhood. We need to end that now",
        "Flair": "Discussion",
        "Date Created": "01-30-2021 03:16:58",
        "Upvotes": 7259,
        "Upvote Ratio": 0.99,
        "ID": "l88uio",
        "Edited?": "01-29-2021 20:03:09",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l88uio/we_were_the_best_advertising_for_robinhood_we/",
        "Comment Count": 478,
        "Text": "Robinhood has been on some real bullshit, that much is clear. There are enough posts here to show how shitty they are and how they are fucking us over, so I feel like I don't need to get into the why of what I'm proposing.  \n\nWe were the best advertising for Robinhood. Think about it... Seeing a fellow WSBer post awesome gains was almost always via a Robinhood screenshot. You see those gains, you want those gains, so you get Robinhood. You post your Robinhood screenshot. The cycle continues...\n\nI've been here long enough to remember people saying \"not RH, don't understand\" to posts from WeBull or Fidelity or whatever the fuck you non-US people use. \n\nWe need to end that now. \n\nAfter all this shakes out (we sell GME at $42690 per share), **I propose BANNING ROBINHOOD SCREENSHOTS in WSB.**  Who's with me? \n\nTLDR - Fuck Robinhood.\n\nEdit: Fuck Vlad. And Apex, obviously. But we aren't posting their screenshots, so mainly FUCK ROBINHOOD. \nOn the off chance they are still in existence a month from now, I want to see ZERO RH screenshots on WSB"
    },
    "Post 59": {
        "Title": "We Need the Same Outrage Over Ladder Attacks As We Had Over Robinhood Limiting Purchases 💎🙌💎🚀🚀🚀",
        "Flair": "Discussion",
        "Date Created": "02-02-2021 03:06:38",
        "Upvotes": 12418,
        "Upvote Ratio": 0.99,
        "ID": "laic11",
        "Edited?": "02-01-2021 20:35:04",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/laic11/we_need_the_same_outrage_over_ladder_attacks_as/",
        "Comment Count": 248,
        "Text": "Just got off the phone with both of the Nevada Senators’ offices. Every one of you needs to do the same.\n\nWhen Robinhood restricted trading last Thursday, the reaction across the entire country was swift. So why the fuck have short sellers been allowed to continue to engage, in plain sight, in short ladder attacks for SIX FUCKING DAYS? It’s not even like it would be hard for the SEC to investigate, but shocker, they’re clearly letting it continue.\n\nThe fact that the same fucks who defunded the country in 2008 and made these risky bets on GME in the first place are now committing illegal acts in broad daylight is the biggest slap in the face yet. Call your Senators. Representatives. Governors. Blow up Portnoy, Chamath, Elon, AOC... maybe even Ted Cruz.\n\n💎🙌💎🚀🚀🚀\nPosition: 16 shares GME\n\nEdit: As this post is getting a little attention, I'm including this really quality post on the same subject that provides a template to discuss 1) what is happening and 2) the specific laws demonstrating illegality, with your representatives. https://www.reddit.com/r/wallstreetbets/comments/laferl/15_usca_78i_the_illegality_of_short_ladder/"
    },
    "Post 60": {
        "Title": "The $GME squeeze will bring down Melvin. The Silver squeeze will bring down the biggest banks in the world. That's why Robinhood barred trading of $SLV the day after they took a billion dollars in loans from JPM and Goldman Sachs. ARE YOU FUCKING KIDDING ME.",
        "Flair": "DD",
        "Date Created": "01-30-2021 23:25:46",
        "Upvotes": 1961,
        "Upvote Ratio": 0.7,
        "ID": "l8uu76",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l8uu76/the_gme_squeeze_will_bring_down_melvin_the_silver/",
        "Comment Count": 634,
        "Text": "You retarted apes are growing up. I remember a year ago this sub was nothing but memes of J-Powell littered with rocketship emojis. Now It's GME posts littered rocketship emojis. We've come so far. \n\nNow listen:\n\nIf you think Wall Street is shitting their pants over the GME short squeeze you are 100% right. Jim Bianco lays out a [convincing case](https://www.financialsense.com/podcast/19847/jim-bianco-gamestop-and-great-short-seller-takedown#.YBTK3GAFZmU.twitter) that SPY was down 2% on Friday because hedge funds were dropping their \"safe\" stocks to raise capital for collateral against their rising margin debt on GME. \n\nBut you also got to know this. At the same moment Robinhood halted purchases of GME, after calls from their hedge fund buddies, they also put on limits on $SLV. \n\n([Here is the list of all limited stocks](https://robinhood.com/us/en/support/articles/changes-due-to-recent-market-volatility/) \\- they've since added weird stuff like Starbucks, but $SLV was one of the first along with $GME and $AMC). I think that's pretty weird, considering that, unlike these other stocks, $SLV was up only a few percent on Thursday. It's even weirder when you consider that Robinhood had just been [bailed out by JPMorgan and Goldman Sachs](https://www.bloomberg.com/news/articles/2021-01-28/robinhood-is-said-to-draw-on-credit-lines-from-banks-amid-tumult?sref=rY0z5sRB)! These fuckers are two of the worst silver manipulators out there. (Seriously. Link for [Goldman](https://www.reuters.com/article/us-bank-nova-divestiture-goldman-sachs-idUSKBN1DS2C5). Link for [JPM](https://www.cnbc.com/2020/09/29/jp-morgan-settles-spoofing-lawsuit-alleging-fraud-in-metals-trades.html))\n\nThese banks have been raking it in on suppressing the price of silver for  decades. Look at this historical chart of silver. Does this make any sense? Silver was well over $30 for several years in the ***fucking 1980s.*** And now it's $27???\n\n&#x200B;\n\nhttps://preview.redd.it/8rf9ip323je61.png?width=1914&format=png&auto=webp&s=f8bfdbed2e78d08ef1d411241adc6d68141ede47\n\nThe fair price of silver, conservatively is CERTAINLY over $50, but it seems that there were some strings attached to JPM and GS's little loan to Robinhood. \n\nI'm balls deep in GME, but am riding this silver train too. Already last week $AG and $SLV were surging despite Robinhood's best efforts. If this thing breaks, both of those tickers will at least double. My personal price target for Silver is $70. The tendies from silver will be extra sweet for me  - nothing like breaking up the greatest cartel in modern history (apologies to OPEC). \n\nKeep fighting the good fight apes. We'll bring these bastards to their knees. \n\nMy positions: $GME shares, $AG and $SLV shares and July calls. \n\n<Obligatory rocketship emoji>"
    },
    "Post 61": {
        "Title": "I REACHED OUT TO 4 LAWFIRMS IN NYC TO SUE ROBINHOOD - Keep you updated as they get back to me",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 18:49:50",
        "Upvotes": 9366,
        "Upvote Ratio": 1.0,
        "ID": "l70ax4",
        "Edited?": "02-01-2021 09:41:06",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l70ax4/i_reached_out_to_4_lawfirms_in_nyc_to_sue/",
        "Comment Count": 393,
        "Text": "Those dumb fucks are only allowing me to sell and not buy or average my cost down. If SEC does not do anything about this will fucking sue them.\n\n&#x200B;\n\nUpdate:\n\nReached out to 10 Security Litigation Firms I will update you when I hear back.\n\nEmail below:\n\n *Hello XX,*\n\n*Current market manipulation is going on. GME. BB. and a few other stocks are only allowed to be sold and not purchased on platforms.*  \n\n\n*CITADEL pays Robinhood for their order flows which makes up 40% of their revenue. CITADEL has huge short positions that have been getting crushed the last 4 weeks due to retail traders like myself.*  \n\n\n*Robinhood and CITADEL are colluding to drive the price down by not allowing anyone else to purchase shares of those stocks.*  \n\n\n*There are 100's of thousands of people getting screwed including me where I'm not able to buy and average my cost down.*  \n\n\n*Robinhood TOS allows them to suppress stocks, but it is illegal when colluding with a Hedge fund to manipulate volume in favor of their shorts.*  \n\n\n*Open to discussing what options I have from class action to suing on my own.*  \n\n*Thank you!*\n\nUpdate 2: response from 1 law firm working on it.\n\nGood Morning xxx, \n\nI am responding to the inquiry we received from you via FindLaw to Anthony Harwood of Harwood Law PLLC. As Tony's assistant, and I field all the initial inquiries for legal representation, and you requested to be contacted via email. Would you please provide more information regarding your potential claim.\n\nRobinhood began to restrict retail investors from buying Gamestop and other stocks (AMC, Blackberry, etc.) this morning, while hedge funds are still able to trade these stocks. Please confirm, and can you estimate your potential losses as a result of not being able to buy shares at this time? \n\nWhat is the firm that you believe poses a conflict of interest for Robinhood and what is the conflict? \n\nWere you notified of the decision to limit buys by Robinhood? If so, how and when? \n\nPlease provide any additional information that you think might be helpful in providing a fuller understanding of your situation, and we will get back to you promptly. \n\nBest Regards,\n\nUpdate 3 My response:\n\nGood Morning Karin,\n\nThanks for getting back to me. My answers in black below.\n\nRobinhood began to restrict retail investors from buying Gamestop and other stocks (AMC, Blackberry, etc.) this morning, while hedge funds are still able to trade these stocks. Please confirm, and can you estimate your potential losses as a result of not being able to buy shares at this time? I'm currently down over $20,000 and lost out on over $500,000. I have made a post to gauge peoples losses and they are in the 100s of millions.\n\nWhat is the firm that you believe poses a conflict of interest for Robinhood and what is the conflict? Robinhood is connected with CITADEL. CITADEL Hedge Fund is shorting these stocks and have lost 2-3 billion the last couple weeks due to the short squeeze. I have also read it seems to be a colluded effort by a number of brokers to block buying and only allowing selling of these specific stocks that CITADEL has interest in.. IBKR, TD, and CS seem to be working in unison to manipulate the market.\n\nWere you notified of the decision to limit buys by Robinhood? If so, how and when? Not until 11:30am this morning where they sent a notification. You would not see the notification without pressing around the app. The notification only stated \"due to ongoing volatility some securities like AMC and GME are position closing only\". So basically they are only allowing people to sell their shares driving the price down to benefit the funds that are shorting the stock...\n\nPlease provide any additional information that you think might be helpful in providing a fuller understanding of your situation, and we will get back to you promptly. I have a few thousand people that want to join a class action lawsuit. A number of individuals are already reaching out to other law firms across the country. If you see the current news financial titants, congress members, and many others are commenting on the collusion market manipulation that is taking place on Robinhood.\n\nI'm working to gather more information but the damages can be in the billions..\n\nThanks!\n\nUPDATED 4:\n\nI HAVE A CALL TOMORROW WITH ATTORNEY.\n\nUPDATE 5:\n\nI had a call on Friday with attorney and he requested all proof, screen shots, and links to subreddits.\n\nHe is reviewing the potential for litigation and told me he will get back to me mid week.\n\nI will keep you all posted."
    },
    "Post 62": {
        "Title": "AOC demands probe after Robinhood app banned GameStop purchases",
        "Flair": "News",
        "Date Created": "01-28-2021 23:00:56",
        "Upvotes": 9347,
        "Upvote Ratio": 0.98,
        "ID": "l7714j",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.independent.co.uk/news/world/americas/aoc-robinhood-app-gamestop-stocks-shares-b1794276.html?utm_source=reddit.com",
        "Comment Count": 317,
        "Text": ""
    },
    "Post 63": {
        "Title": "Be VERY VERY careful using robinhood tomorrow. It is possible they may sabotage the app tomorrow since they are allowing limited buying of the stocks they blocked today. This wouldn’t be the first time robinhood crashed at an important time in the market. I wouldn’t be surprised if it’s deliberate.",
        "Flair": "Discussion",
        "Date Created": "01-29-2021 06:15:30",
        "Upvotes": 2955,
        "Upvote Ratio": 0.99,
        "ID": "l7hkww",
        "Edited?": "01-28-2021 23:30:14",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l7hkww/be_very_very_careful_using_robinhood_tomorrow_it/",
        "Comment Count": 508,
        "Text": "Hello all, this is just a warning to be cautious using robinhood tomorrow. They have had mass connection trouble before and it was on a Friday when people tried to exercise their options. \n\nI had a feeling last night and the day before robinhood would pull what they did today or server bomb their own app. I wish I had posted this prediction to document how predictable they are.\n\nThis may be Tinfoil hat but I believe if they need to they will crash the app to prevent buying and selling but claim technical errors. \n\nBe aware, be prepared\n\nCan’t stop, won’t stop, GameStop 🚀🚀🚀🚀💎🙌🏽💎🙌🏽💎🙌🏽🚀🚀🚀🚀\n\nEdit: I’m glad almost everyone is in agreement. I will be holding the current shares I have in robinhood but buying any additional ones over at Fidelity. Personally I wouldn’t use a broker that didn’t restrict any stock today. This is just my opinion. \n\nRobinhood lost the most important thing today and that was trust. I don’t know if this can ever be regained from them or any of the other companies that restricted."
    },
    "Post 64": {
        "Title": "FYI: Robinhood will NOT let you buy GME",
        "Flair": "Discussion",
        "Date Created": "01-29-2021 15:56:26",
        "Upvotes": 3982,
        "Upvote Ratio": 0.99,
        "ID": "l7ruzt",
        "Edited?": "01-29-2021 08:31:16",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l7ruzt/fyi_robinhood_will_not_let_you_buy_gme/",
        "Comment Count": 381,
        "Text": "This has shown up in a few comments and posts but I want to call more attention so no one gets Melvin’d:\n\nYOU CAN ONLY BUY 5 SHARES OF GME\n\nThat means:\n- if you have more than 5 shares you can’t buy GME\n- if you try to time a dip to sell and buy back up, you will only be able to buy up to 5 shares\n\nThe blatant omission of these small details is the most fucked thing I’ve seen since yesterday... they are literally preying on the misinformed (by not informing them).\n\nEdit: [Here’s some proof ](https://imgur.com/gallery/TJghr70) \n\nEdit 2: [Here’s a list of all tickers (including BB and AMC) that RH is manipulating](https://twitter.com/wsbmod/status/1355141894930624514?s=20) \n\nThis is not financial advice and I am not a financial advisor. I just really like 🍌"
    },
    "Post 65": {
        "Title": "To no one's surprise, Robinhood will continue its 1 GME share limit tomorrow 🤡",
        "Flair": "News",
        "Date Created": "02-01-2021 05:22:19",
        "Upvotes": 3146,
        "Upvote Ratio": 0.99,
        "ID": "l9sewz",
        "Edited?": "01-31-2021 21:54:04",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l9sewz/to_no_ones_surprise_robinhood_will_continue_its_1/",
        "Comment Count": 365,
        "Text": "Alright, retards. Tomorrow, [Robinhood will continue trying to fuck us like our wives boyfriends fuck our wives.](https://www.cnbc.com/2021/01/31/robinhood-to-continue-trading-limits-on-monday-customers-can-still-only-buy-one-gamestop-share.html) But how can we fuck them back? \n\nFor those of us who haven't migrated to a more investor friendly platform, they are still allowing purchase of up to 5 options contracts. There's nothing stopping those of you who like this stock from buying itm contracts and exercising them as soon as you can. Turning a 1 share limit into a 501 share limit.\n\nI'll be 💎🖐️ til this wonderful stock hits 100k.\n\nThank you and fuck Robinhood.  🦍🍌🦍🍌💎🖐️💎🍆\n\nEdit: forgot to call someone a retard\n\nEdit 2: OR just set up an account with fidelity, which can be set up and ready to go instantly. Seriously, avoid robinhoopla if you can. This post is just giving you another option\n\nEDIT 3 AND MOST IMPORTANTLY: Anything other than GME is the wrong play. The fact that they're letting you purchase a bunch of other \"limited\" stocks but only ONE of gamestonk should be a big fat red screaming sign that GME is the winner here. 📈"
    },
    "Post 66": {
        "Title": "ROBINHOOD OPENED GME! Just bought 20 more shares. Already held 70, 90 total now. 💎 🙌🏼",
        "Flair": "Gain",
        "Date Created": "02-02-2021 19:41:34",
        "Upvotes": 4972,
        "Upvote Ratio": 0.98,
        "ID": "lb012a",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/gallery/lb012a",
        "Comment Count": 275,
        "Text": ""
    },
    "Post 67": {
        "Title": "People on Robinhood who own GME are most likely to also own BB and PLTR in their portfolio. 😂 🚀🚀🚀",
        "Flair": "News",
        "Date Created": "01-20-2021 03:28:02",
        "Upvotes": 9060,
        "Upvote Ratio": 0.98,
        "ID": "l0xcnz",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/ocicpuwbtdc61.jpg",
        "Comment Count": 520,
        "Text": ""
    },
    "Post 68": {
        "Title": "Should Robinhood founders but charged with securities fraud for the actions that they did today?",
        "Flair": null,
        "Date Created": "01-29-2021 01:03:09",
        "Upvotes": 8115,
        "Upvote Ratio": 0.99,
        "ID": "l7ab25",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/w0hv46nob5e61.jpg",
        "Comment Count": 302,
        "Text": ""
    },
    "Post 69": {
        "Title": "Important enough for its own post: Robinhood was NOT the only one that banned GME and should NOT be the only one to get legal scrutiny thrown at them! List all culprits here.",
        "Flair": "Discussion",
        "Date Created": "01-29-2021 05:01:30",
        "Upvotes": 2952,
        "Upvote Ratio": 0.99,
        "ID": "l7fz4q",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l7fz4q/important_enough_for_its_own_post_robinhood_was/",
        "Comment Count": 513,
        "Text": "Go look at posts/comments from earlier today from dudes wondering where the hell to buy GME because their non-RH broker of choice ALSO banned purchasing GME. GME dropped over 75% from its high not because just RH did this, and we all know it.\n\nMOST BROKERS DID THIS. MOST OF THEM.\n\nNow - go look at the front page of Reddit, the front page of your favorite news source, and the tweets of your favorite politicians. 95% of mentions of these shenanigans mention ONLY RH.\n\nWhy's that? Hell, you KNOW why deep down, but let's spell it out.\n\nThese prominent people - politicians, celebs, rich people, etc. - who are suddenly on your side would **love** to see **only RH** bite the dust. RH already had been disrupting the industry and taking business away from the established brokers who were charging ridiculous fees from back when you had to hop on the phone and call a broker to perform trades.\n\nThe second RH goes away, and other newer ones like WeBull get similarly targeted and scrutinized, what'll happen? Return of the $8+ per trade $1 per contract BS as the norm. Fees that go down with the more money spent, because brokers loooove rich people, and hate us and want to rake as much as they can from us.\n\nShould RH get reamed? Absolutely. Should all the other brokers that pulled these shenanigans get reamed too? You betcha. And right now, that's clearly not going to happen. I've not seen a single politician, including AOC, mention ANY broker other than RH. Hell, a congressperson drafted a fucking letter about troubling/concerning yada yada about RobinHood. Only RobinHood. **Again, MOST BROKERS did this.**\n\nFrankly, ANY broker that pulled this shit should be shut the fuck down. If not by the law, by their customers getting the fuck away from their thieving asses.\n\nSo, did your broker do this to you too? List 'em here. Hell, make a separate post about them. Upvote all of them. Let's not let them get away with this. They're trying to sneak out of a war they started and present RH as the lone culprit and make you feel warm and happy about class action lawsuits that'll get you a baconator in about 5 years. Don't let them.\n\nIt's clear the media and politicians all intend for those other brokers to get away with it. The ONLY way they won't is for us to plaster their names everywhere and make it IMPOSSIBLE to ignore."
    },
    "Post 70": {
        "Title": "Robinhood, TD Ameritrade, Charles Schwab, Trading 212 has paused trading on hot stocks such as GME, AMC, NOK, etc! They're doing it to \"protect their valued customers from the volitive market.\" Forget them, find a new trading app, and make them wish they never fucked over the little people.",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 17:13:44",
        "Upvotes": 3839,
        "Upvote Ratio": 0.99,
        "ID": "l6xlw3",
        "Edited?": "01-30-2021 18:53:25",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l6xlw3/robinhood_td_ameritrade_charles_schwab_trading/",
        "Comment Count": 407,
        "Text": "Let me know if there are any other trading platforms guilty of this action OR if I get any of this information wrong. I BELIEVE IN $GME!\n\nMods, if I'm not helping, please remove this post. I want all of us to flourish in these crazy times and I hope this information helps. \n\n\nEDIT: \n\n•TradeRepublic platform is also down according to one user.\n\n•E*TRADE is NOW ALLOWING $GME TRADES ACCORDING to another user.\n\n•Fidelity appears to be allowing whole (but not fractional) trades with $GME, etc.\n\n•WeBull is NOT allowing $GME and $AMC purchases\n\n•Ally Invest restricting $AMC trades\n\n•Tastyworks is also GUILTY according to one user\n\n•Apex Holdings apparently placed a $GME band on STASH app\n\n•Tastyworks and Etoro have disabled trading on some stocks\n\n•TD Ameritrade is POSSIBLY RESTRICTING $GME and more share buys--need more confirmation from others\n\n•According to one user, \"interactive brokers\" are also blocking buying shares unless you shorted before\n\n•Hellostake.com $GME failing to execute. No official block on GME, but beware\n\n•Etoro is “close only” for certain stocks\n\n•Stake is \"fucked\" according to one user\n\n•Apparently FreeTrade works\n\n•CashApp: GME, BB and Naked are gone. AMC and NOK still up. \n\n•Schwab: GME, BB, AMC, NOK and Naked blocked from buys.\n\n\nEdit 2:\nPlease DM me updates as some comments are not showing up on this thread for me. That way I can do a better job with all these changes.\n\nEdit 3:\nFor those asking \"what should I use?\" Fidelity has been consistent for today, but always use caution during these times. I only have experience with Robinhood and Fidelity, so any recommendation on my end should be taken with a grain of salt. \n\nEdit 4: I STILL BELIEVE IN $GME.\n\nEDIT 5: HOLD THE LINE!!!\n\nEDIT 6 (FINAL EDIT): Below is a post that's 1000x better than mine. Go to this one. Thank you all for the information. Good luck, and don't forget, HOLD.\n https://www.reddit.com/r/stocks/comments/l8rhr3/weekend_gme_thread_homework_for_all_lets_stop/?utm_medium=android_app&utm_source=share"
    },
    "Post 71": {
        "Title": "Robinhood is total fucking garbage. Stop using it.",
        "Flair": "Discussion",
        "Date Created": "01-30-2021 00:10:54",
        "Upvotes": 3534,
        "Upvote Ratio": 0.99,
        "ID": "l84bw8",
        "Edited?": "01-29-2021 16:12:59",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l84bw8/robinhood_is_total_fucking_garbage_stop_using_it/",
        "Comment Count": 361,
        "Text": "[Look at this total bullshit.](https://robinhood.com/us/en/support/articles/changes-due-to-recent-market-volatility/)\n\n\nI've commented before about what trash this company is, and what trash their fucking app. is.\n\nThis is the equivalent of telling you that now you're only allowed to sell, not buy, because Citadel got on the wrong side of these trades when you made them.\n\nRobinhood does not send your trades to the exchange.  They send them directly to Citadel or one of three or four other market makers.  You're betting directly against Robinhood when you use it.  They clear their own trades.\n\nIt's a total sham, and they are exactly the antithesis of what they bill themselves as.  They are designed for these big money players to make money, and for you to lose.\n\nGet a fucking Fidelity account.  They send your trade to the exchange, and pay for that.  They don't get paid for order flow.  They're not on the other side of your trade, so they have *no incentive* to tell you that you can't buy something, *because they need you to sell it to them, instead*."
    },
    "Post 72": {
        "Title": "Helpful news from Robinhood",
        "Flair": "News",
        "Date Created": "02-04-2021 01:44:34",
        "Upvotes": 9289,
        "Upvote Ratio": 0.99,
        "ID": "lc0k6c",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/g7urbkijccf61.png",
        "Comment Count": 155,
        "Text": ""
    },
    "Post 73": {
        "Title": "Robinhood is REALLY screwing us. They have the shares we buy, so they pocket the 30% they get from lending shares to short sellers, that we didn't agree to be leant out in the first place.",
        "Flair": "News",
        "Date Created": "01-31-2021 05:53:16",
        "Upvotes": 1776,
        "Upvote Ratio": 0.98,
        "ID": "l92qsv",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/gallery/l92qsv",
        "Comment Count": 371,
        "Text": ""
    },
    "Post 74": {
        "Title": "My retarded friend sold his fractional share of GME. Robinhood decided they wanted to be the ultimate tard and sell his share for 2,605.50. YOU HEAR THAT AUTISTS? NO SELL LIMIT FOR ANYTHING UNDER 2605.50 A SHARE",
        "Flair": "Gain",
        "Date Created": "01-30-2021 22:44:07",
        "Upvotes": 1773,
        "Upvote Ratio": 0.91,
        "ID": "l8tuag",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/gallery/l8tuag",
        "Comment Count": 406,
        "Text": ""
    },
    "Post 75": {
        "Title": "Couldn’t buy any $GME as Robinhood and others blocked and limited sales this week. Contacted some smooth brain friends over in Japan and we shared what funds we had to get some $GME. This is to stick it to the hedge funds, Melvin, Citadel, and Robinhood. Diamond hands! 💎 🖐 🤚 To the Moon 🚀 🌝",
        "Flair": "YOLO",
        "Date Created": "01-31-2021 07:06:22",
        "Upvotes": 4744,
        "Upvote Ratio": 0.99,
        "ID": "l943dj",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/o2tn4g9aele61.jpg",
        "Comment Count": 226,
        "Text": ""
    },
    "Post 76": {
        "Title": "Big THANK YOU to Charles Payne at Fox Business for being one of the only financial TV hosts to call out Robinhood on this absurdity",
        "Flair": "News",
        "Date Created": "01-28-2021 19:24:05",
        "Upvotes": 21799,
        "Upvote Ratio": 0.99,
        "ID": "l718oc",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/b96u0n00n3e61.png",
        "Comment Count": 131,
        "Text": ""
    },
    "Post 77": {
        "Title": "Elon Musk Grills Robinhood CEO On Trade Restrictions",
        "Flair": "News",
        "Date Created": "02-01-2021 11:22:02",
        "Upvotes": 4723,
        "Upvote Ratio": 0.99,
        "ID": "l9yelq",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.hiddenamericans.com/elon-musk-grills-robinhood-ceo-on-trade-restrictions/",
        "Comment Count": 181,
        "Text": ""
    },
    "Post 78": {
        "Title": "DO NOT SELL TO MOVE YOUR ACCOUNT FROM ROBINHOOD",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 20:36:53",
        "Upvotes": 5118,
        "Upvote Ratio": 0.99,
        "ID": "l73djt",
        "Edited?": "01-28-2021 16:42:20",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l73djt/do_not_sell_to_move_your_account_from_robinhood/",
        "Comment Count": 218,
        "Text": "Use an ACAT transfer to move your holdings between brokerages WITHOUT SELLING THEM instead. Please read the post because there are some risks. Robinhood charges a $75 fee to move your account, but they will lose a lot more in actual value from a) not holding our massive bull balls and b) no more trading fees\n\n[https://robinhood.com/us/en/support/articles/transfer-stocks-out-of-your-robinhood-account/](https://robinhood.com/us/en/support/articles/transfer-stocks-out-of-your-robinhood-account/)\n\nEdit: a lot of people are asking me for advice, but I am a mere autist. Do your research. It often only takes a few days, but can take up to 2 weeks to transfer accounts, during which time YOU WILL NOT BE ABLE TO SELL THE SHARES, but if you're GME 1000 or GME LONG it shouldn't matter to you. [https://www.nerdwallet.com/article/investing/switch-brokers-move-investments](https://www.nerdwallet.com/article/investing/switch-brokers-move-investments)\n\nEdit 2: please upvote the least autistic comments. there are people in here who know things.\n\nEdit 3: consider not going with the crowd and choosing different brokerages. having everyone in robinhood is what got us into this mess\n\nEdit 4: merged into edit 1 because it was too important to be at 4\n\nEdit 5: I am not a financial advisor\n\nEdit 6: u/ZaphodNYC posted this great link (btw: love the guy, love the city) below that explains the mechanics behind ACAT's [https://www.sec.gov/reportspubs/investor-publications/investorpubsacctxferhtm.html](https://www.sec.gov/reportspubs/investor-publications/investorpubsacctxferhtm.html)\n\nEdit 7: I just want to say in the interest of full disclosure that I am not holding GME, but I wish you all the best of luck and love. I'm only here because [I love democracy.](https://imgur.com/gallery/VjMx8) If you did want to send a little love my way, my only dog in this race is a few shares of AMC that I'm holding at yesterday's highs. Feel free to throw \\*some\\* of that silver there instead (but don't be selling GME to do it)\n\nEdit 8: Once you're done, don't forget to call your new brokerage and tell them NOT TO LOAN YOUR SHARES TO SHORT SELLERS.\n\nGLHF"
    },
    "Post 79": {
        "Title": "Fucking coward, article: https://www.forbes.com/sites/rachelsandler/2021/01/28/robinhood-ceo-we-made-the-correct-decision-in-restricting-gamestop-trades/",
        "Flair": "News",
        "Date Created": "01-29-2021 04:02:01",
        "Upvotes": 2151,
        "Upvote Ratio": 0.98,
        "ID": "l7en36",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/cpk6w5fl76e61.jpg",
        "Comment Count": 335,
        "Text": ""
    },
    "Post 80": {
        "Title": "Yo dudes so I heard of this company called robinhood that’s going public soon",
        "Flair": "Discussion",
        "Date Created": "01-30-2021 06:57:25",
        "Upvotes": 1844,
        "Upvote Ratio": 0.98,
        "ID": "l8d77s",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l8d77s/yo_dudes_so_i_heard_of_this_company_called/",
        "Comment Count": 310,
        "Text": "So I don't think investing in them will be a good idea, this is all just personal opinion not advice and here's what I know.\n\n\nI heard they treat their customers like shit and care more about boot licking some billionaires dress shoes than providing a quality service to their users.\n\nThey also use some pretty sketchy methods to profit off their customers so once that becomes more widely known I don't feel like their user growth will continue any longer.\n\nAlso they have an extremely unreliable and low quality service compared to their competitors of which there are hundreds, that provide the same general services with better quality and respect to their customers.\n\nFinally, the company is also facing a couple class actions due to their illegal and sketchy methods of abusing their users.\n\n\nPersonally I would stay away from their IPO if that ever happens now, cuz I don't think the risk of the business surviving in the long term is very high, their customer growth is abysmal, and the lawsuits will definitely put a drain on their capital. Also their CEO looks like he's still a virgin, so how can he run a successful business if he can't even successfully dip his banana?\n\nThis isn't investment advice I just hate the company"
    },
    "Post 81": {
        "Title": "📢LISTEN UP!! I'm down 8k. I'm a student and this is an ENTIRE YEARS WORTH OF WAGES FOR ME. But you know what I'm going to do? HOLDDDDDD 💎🙌 Because I BELIEVE in you! Also, FUCK ROBINHOOD!! GME BB!!!🚀🚀🚀",
        "Flair": "YOLO",
        "Date Created": "01-28-2021 20:02:28",
        "Upvotes": 3883,
        "Upvote Ratio": 0.99,
        "ID": "l72dsz",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/xr8jbng1u3e61.jpg",
        "Comment Count": 203,
        "Text": ""
    },
    "Post 82": {
        "Title": "Stop Using Robinhood App",
        "Flair": "Discussion",
        "Date Created": "01-29-2021 05:49:25",
        "Upvotes": 1425,
        "Upvote Ratio": 0.96,
        "ID": "l7h07m",
        "Edited?": "01-29-2021 07:20:18",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l7h07m/stop_using_robinhood_app/",
        "Comment Count": 381,
        "Text": "The title says it all. I am no sure will this post be banned.\n\nRobinhood surely is very convenient and easy to use, but their actions today require consequences. It's no secret that they earn money by selling all sales' data to the ''big sharks'' who can fuck us small fish up pretty bad. If they will lose huge number of users, their data will stop being useful, it will be too small sample of population to sell it to anybody. I don't give a shit, I am pulling everything now at loss and will continue using some Ameritrade or whatever. There are other apps that are relatively still for free. Ok, I am illiterate, I don't know how to support my idea with smarter terminology.\n\nP.S. Oh, yes, if someone will start complaining about this post, well, look at it as a bad review of robinhood.\n\n&#x200B;\n\nEDIT: Recommendations for an alternative app are welcome.\n\nEDIT 2: ~~You don't have to sell~~ ~~and withdraw everything immediately~~,**(<<<-transfer instead->>>)** obviously that could also play out as an advantage to those that we are betting against, but at least try to cash out gradually. Take into account that it takes 4 days to be able to transfer the money form the app account.\n\nEDIT 3: [How robinhood makes money](https://www.forbes.com/sites/jeffkauflin/2020/08/19/the-inside-story-of-robinhoods-billionaire-founders-option-kid-cowboys-and-the-wall-street-sharks-that-feed-on-them/?sh=42fab76d268d)  \\- this explains pretty simply, after today's actions by Robinhood, do you really want to use app that is monitoring you and working against you with your every sale/contract???\n\n&#x200B;\n\nEDIT 4:  it does not offer OTC shares, some of which will go to Neptune in the next 5 years"
    },
    "Post 83": {
        "Title": "Robinhood Market Manipulation: Not letting me exercise my GME contract that expires today",
        "Flair": "News",
        "Date Created": "01-29-2021 22:07:16",
        "Upvotes": 1444,
        "Upvote Ratio": 0.98,
        "ID": "l813ad",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/wsk0eoq7lbe61.jpg",
        "Comment Count": 290,
        "Text": ""
    },
    "Post 84": {
        "Title": "Robinhood has finally released AMC and GME shares from custody at 3:18 AM",
        "Flair": "News",
        "Date Created": "01-29-2021 11:21:53",
        "Upvotes": 1156,
        "Upvote Ratio": 0.98,
        "ID": "l7ncio",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/gallery/l7ncio",
        "Comment Count": 340,
        "Text": ""
    },
    "Post 85": {
        "Title": "GME now the top stonk on Robinhood. We have done it my brothers. 🚀🚀🚀🚀🌕",
        "Flair": "Meme",
        "Date Created": "01-21-2021 00:25:12",
        "Upvotes": 5490,
        "Upvote Ratio": 0.97,
        "ID": "l1iy66",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/uwcdv4fm1kc61.jpg",
        "Comment Count": 306,
        "Text": ""
    },
    "Post 86": {
        "Title": "“BREAKING: Robinhood now limiting trading in 50+ stocks, including GM, Beyond Meat, and Starbucks”",
        "Flair": "News",
        "Date Created": "01-30-2021 01:51:15",
        "Upvotes": 1354,
        "Upvote Ratio": 0.99,
        "ID": "l86tdi",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://twitter.com/mrfourtoeight/status/1355274195836391424?s=21",
        "Comment Count": 340,
        "Text": ""
    },
    "Post 87": {
        "Title": "RH is limiting these stocks by the way https://www.google.com/amp/s/investorplace.com/2021/01/robinhood-bans-reddit-stocks-wallstreetbets-gme-cciv-sndl-jagx-amc-nok-bb/amp/",
        "Flair": "News",
        "Date Created": "01-30-2021 01:07:11",
        "Upvotes": 823,
        "Upvote Ratio": 0.97,
        "ID": "l85q4k",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/kro3o1ebhce61.jpg",
        "Comment Count": 374,
        "Text": ""
    },
    "Post 88": {
        "Title": "Robinhood CEO explains to Elon Musk why his platform restricted trading - As I said, Elon has our backs 🚀 🚀 🚀; Apes together Strong",
        "Flair": "News",
        "Date Created": "02-01-2021 16:08:49",
        "Upvotes": 2673,
        "Upvote Ratio": 0.98,
        "ID": "la2ohn",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.cnbc.com/2021/02/01/elon-musk-on-clubhouse-robinhood-ceo-explains-trading-restrictions.html?",
        "Comment Count": 182,
        "Text": ""
    },
    "Post 89": {
        "Title": "Got a free random stock when I signed up for Robinhood in March. The stock? Gamestop at $3.94. Thank you!!",
        "Flair": "Gain",
        "Date Created": "01-27-2021 23:41:34",
        "Upvotes": 8225,
        "Upvote Ratio": 0.99,
        "ID": "l6dwej",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l6dwej/got_a_free_random_stock_when_i_signed_up_for/",
        "Comment Count": 147,
        "Text": "&#x200B;\n\nhttps://preview.redd.it/qdcuxxcaqxd61.jpg?width=1125&format=pjpg&auto=webp&s=42e8a47ca328265cbae28a31384d52a5545b0332"
    },
    "Post 90": {
        "Title": "Google Play deletes over 150,000 Robinhood app reviews after frustrated users leave one-star ratings",
        "Flair": "News",
        "Date Created": "01-29-2021 05:31:21",
        "Upvotes": 2115,
        "Upvote Ratio": 0.99,
        "ID": "l7gmaf",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://reclaimthenet.org/google-play-removes-robinhood-reviews/",
        "Comment Count": 229,
        "Text": ""
    },
    "Post 91": {
        "Title": "Robinhood: A Tale Of The Darkside",
        "Flair": "Meme",
        "Date Created": "01-30-2021 22:42:31",
        "Upvotes": 5107,
        "Upvote Ratio": 0.99,
        "ID": "l8tsv4",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://v.redd.it/ppenm8vzvie61",
        "Comment Count": 129,
        "Text": ""
    },
    "Post 92": {
        "Title": "Robinhood seems to be automatically selling peoples GME shares.",
        "Flair": "News",
        "Date Created": "01-28-2021 22:15:56",
        "Upvotes": 2302,
        "Upvote Ratio": 0.96,
        "ID": "l75rvr",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://twitter.com/555Sunny/status/1354854993946406917",
        "Comment Count": 242,
        "Text": ""
    },
    "Post 93": {
        "Title": "Robinhood alternatives- upvote for visibility",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 20:17:12",
        "Upvotes": 1333,
        "Upvote Ratio": 0.99,
        "ID": "l72tfu",
        "Edited?": "01-29-2021 11:58:07",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l72tfu/robinhood_alternatives_upvote_for_visibility/",
        "Comment Count": 332,
        "Text": "I will edit this post as needed, I'm aggregating info from another post, and I'll be trying to do some research to support any of the suggestions that have been made: \n\n**IF YOU HAVE ADDITIONAL INFO, COMMENT IT SO I CAN UPDATE THE POST, I'M CHEKCING THIS THREAD BETWEEN TICKETS AT WORK** \n\n**Stock trading alternatives to RobinHood:** \n\n>Webull (unblocked GME etc.) \n\n>Capital.com (Non US only) \n\n>Vanguard \n\n>Fidelity  (Actually tested by me and works)\n\n>Schwab  (tested, works, just flooded with traffic, otherwise quick setup and wire transfers)\n \n>FreeTrade (Hassle free account creation, 10 minute setup time, instant transfers. Down side- $10/mo fee to use)\n\n>Sofi\n\n>Etoro (Has allowed GME trades again, be aware this is the 4th time I've had to change their status, they keep dropping and picking up GME) \n\n>US BANK *(has an investment tool, quick sign up, plus since it's already connected to your US bank account, purchasing should be instant)*\n\n>Navy Federal- **Note** Quick to make, but bank deposits take several days. Probably not best option for current stock boogaloo, but might be good for PT2 if there is one\n\n>Wellstrade (Doesn't seem to be down at the moment, but may have high fees and has past history of suspending stocks due to volatility) \n\n**Trading apps to avoid-** \n\n>RobinHood >!More like Robbin' the poor!< \n\n>TD Ameritrade(GME back down)\n\n>Cash App (has hidden GME)\n \n>Trading212  (Blocked buying of GME) \n\n>Merrill Lynch\n\n>IBKR (has blocked GME)\n\n>Ally Invest (formerly TradeKing)\n\n>Etrade (Apparently blocking GME and AMC at the moment)\n\n>Tastyworks (Blocked meme stocks)\n\n>Stash\n\n>M1 Finance (Appears to be blocking/has one trade window per day at 9:30am, possible this platform was just not built for rapid trading)\n\n>Alpaca (blocked meme stocks)\n\n**If anyone has any input/info about pros/cons between any of the trading app thingies mentioned above, or if anybody can make a better post than this one- DO IT.** \n\n**ADDITIONAL USEFUL INFO/LINKS:** (Someone suggested some links that might prove useful, note that I don't really have time to do deep investigation of any extra info anybody provides, so let me know if any of this isn't beneficial) \n\nhttps://us.etrade.com/what-we-offer/how-it-works/promo\n\n**THE FOLLOWING IS A WEBSITE DEDICATED TO WHAT THIS POST IS DOING HERE, PLEASE CHECK IT OUT**\n\n https://robbinthehood.carrd.co\n\nI don't care about the damn upvotes, I want to make stocks accessible to everyone and I want everyone to have the best tools possible to ~~stick it to these hedgefunds~~ *get stocks they just really like for no reason*"
    },
    "Post 94": {
        "Title": "Robinhood Eases Limits on GME to 20 Shares",
        "Flair": "News",
        "Date Created": "02-01-2021 22:14:15",
        "Upvotes": 1366,
        "Upvote Ratio": 0.96,
        "ID": "labd8p",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://twitter.com/FirstSquawk/status/1356316111076171778",
        "Comment Count": 206,
        "Text": ""
    },
    "Post 95": {
        "Title": "Robinhood will fuck you when the short squeeze actually happens...",
        "Flair": "Discussion",
        "Date Created": "01-30-2021 08:14:51",
        "Upvotes": 689,
        "Upvote Ratio": 0.94,
        "ID": "l8ek8e",
        "Edited?": "01-30-2021 00:25:09",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l8ek8e/robinhood_will_fuck_you_when_the_short_squeeze/",
        "Comment Count": 365,
        "Text": "They have already attempted to stop the squeeze from happening by limiting buying on the shorted stocks. They have previously completely taken away buying power on these stocks from you guys, this caused serious backlash by users of the app forcing them to re-allow trading of these stocks, but not without a catch. There are purchase stock and option limits, which fluctuates throughout the trading hours to clearly manipulate the market, as seen with $BB and $GME today.\n\nThere also been plenty of people posting liquidation of their stocks without their approval, probably due to borrowing money on margin, but typically you should still have 5\\~ days to fulfill the margin equity percentage requirement.\n\nAnyways, that's besides the point:\n\nWhat makes you think these retards won't fucking limit selling due to \"technical issues\" or have ANOTHER \"outage\" AGAIN. They'll let the hedgefucks liquidate, then allow us to sell after all the hedgefucks are out. C'mon tards you've seen this shit before during the SPY put days.\n\nI'd move to Vanguard, Fidelity, or TD Ameritrade. Vanguard and Fidelity have $GME shares so surely they'll allow trading on $GME indefinitely.\n\nPositions:\n\n440 shares $BB\n\n6 shares $GME\n\n**TLDR: ROBINHOOD HAVE OUTAGE/STOP SELLING DUE TO \"TECHNICAL ERRORS\" DURING SQUEEZE.** \n\nEDIT:  \"**DO NOT XFER OUT OF RH. THIS ADVICE IS FOR NEW BUYERS ONLY OR FOR THOSE WHO HOLD MORE THAN 5 SHARES IN RH AND WANT TO BUY MORE. ANYONE BOUGHT ON RH, DISABLE STOP LIMIT. DISABLE MARGIN, AND HOLD ON CASH.\"**"
    },
    "Post 96": {
        "Title": "Robinhood has literally shut down the ability for us to buy certain GME calls in an effort to help save the hedge funds",
        "Flair": "News",
        "Date Created": "01-28-2021 12:19:36",
        "Upvotes": 1660,
        "Upvote Ratio": 0.98,
        "ID": "l6sj7q",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/nyc45cigj1e61.jpg",
        "Comment Count": 291,
        "Text": ""
    },
    "Post 97": {
        "Title": "Robinhood not allowing us to withdraw money?",
        "Flair": "Discussion",
        "Date Created": "01-30-2021 22:31:21",
        "Upvotes": 702,
        "Upvote Ratio": 0.97,
        "ID": "l8tjna",
        "Edited?": "01-30-2021 14:40:05",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l8tjna/robinhood_not_allowing_us_to_withdraw_money/",
        "Comment Count": 352,
        "Text": "I tried to transfer $600 out of my Robinhood earlier (moving to Fidelity after all this is over, for obvious fucking reasons) and I got an error message. Tried it with three different bank accounts. No dice. It either gave me a \"server error\" message, or it told me that a bank had to be verified.\n\nAt this point I'm getting bad vibes, try to post my screenshot (still pending with the mods), and leave it for a minute. Come back later on my PC and try again. No dice. Then, I think, well, let's try it with $100 instead of $600.\n\nAnd it lets me withdraw.\n\nOK, we'll try a bigger number.\n\nNope.\n\nNow I'm sus, so I fire up OBS studio and screen record all of this shit as I go through and attempt to get it to let me withdraw any amount larger than $100. Nothing larger than $100 can withdraw, but $100 (and presumably lower) can. I kept going right up until I run out of daily withdrawals.\n\nIt looks to me very much like **Robinhood is limiting withdrawals to $100 or less and pretending it's a server error.**\n\nThis can't possibly be legal, and I don't know how it could be a server error. I'm not as strong on comp sci as I used to be, but 100 is a fucking int and 600 is a fucking int and they're both three digits and should require the exact same amount of computational power to transact/calculate/whatever.\n\nAgain, I have screenshots from my phone, and I took a screen recording as I went through and did this on my PC. Can anyone advise whether it is 1) possible that it is indeed a server error, or 2) if not, how it could possibly be legal? Cause like I said it still fucking looks to me like they're just not allowing us to get our money out.\n\n**EDIT: These funds were settled. They had not been invested in days and were marked as being withdrawable. And if they were unsettled funds, Robinhood would have given me a message to that effect, not a server error/bank needs verification message.**"
    },
    "Post 98": {
        "Title": "Lost 84k in robinhood account alone. Another 48k lost in schwab. Added 40 more shares after hours. I ain't fucking leaving! 💎🤚🚀🚀🚀",
        "Flair": "YOLO",
        "Date Created": "02-02-2021 01:57:03",
        "Upvotes": 3118,
        "Upvote Ratio": 0.98,
        "ID": "lagsnq",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://i.redd.it/y0cy722y4ye61.jpg",
        "Comment Count": 161,
        "Text": ""
    },
    "Post 99": {
        "Title": "Robinhood CEO interview CNBC",
        "Flair": "News",
        "Date Created": "01-29-2021 03:14:03",
        "Upvotes": 704,
        "Upvote Ratio": 0.97,
        "ID": "l7dinz",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://youtu.be/eOhR8YAiuGs",
        "Comment Count": 370,
        "Text": ""
    },
    "Post 100": {
        "Title": "DO NOT TRANSFER YOUR ACCOUNT IF MOVING TO A NEW BROKER. IT CAN TAKE UP TO 15 DAYS BEFORE YOU'RE EVEN ABLE TO TRADE YOUR TRANSFERRED SECURITIES AND ROBINHOOD WILL LOCK YOUR ACCOUNT DURING THAT TIME.",
        "Flair": "Discussion",
        "Date Created": "01-28-2021 23:01:35",
        "Upvotes": 3123,
        "Upvote Ratio": 0.99,
        "ID": "l771t9",
        "Edited?": "01-28-2021 15:09:30",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/wallstreetbets/comments/l771t9/do_not_transfer_your_account_if_moving_to_a_new/",
        "Comment Count": 177,
        "Text": "The hedge funds are artificially lowering the price by not letting people trade. When there's no volume they can buy/sell at any price and that is the price that will show up as the current price. Even if only a single share was traded.\n\nThis is basically The People VS Hedge Funds.\n\nI'll be buying shares as soon as it's possible. The billionaires can sell their mansions and live in a normal house like the rest of us. \n\nFuck them."
    }
}